[{"id": 1306185900230694, "advertiser_name": "Heirloom", "status": "Active", "date": "01/27/2023", "ad_url": [], "image_save_path": ["1306185900230694_00.jpg"], "ad_text": "Heirloom Sponsored About Heirloom Heirloom is a leading provider of large-format, luxury short-term rentals on the national level. Our unique focus on providing word-class accommodations to discerning groups of travelers in premier travel destinations, combined with a tech-enabled and data-driven business strategy, has allowed Heirloom to quickly carve out a unique space for itself within the highly competitive and rapidly evolving luxury hospitality industry. General Overview Stay Heirloom operates a 6,000 square foot receiving warehouse in Elmwood, LA. We receive and store furnishings, fixtures, and equipment ordered by our design team to furnish hospitality spaces across the country. This is not a traditional e-commerce “pick and pack” warehouse environment. We receive and dispatch 2-4 large containers each month on scheduled dates. Smaller deliveries are made M-F via regular carriers (FedEx, UPS, USPS). Essential Functions Be available and on site to receive packages and deliveries as they arrive at the warehouse. Use our cloud-based warehouse management application to execute on package labeling and organization in accordance with internal protocol. Prepare packages for dispatch using our internal organization protocol. Assist with training new employees on warehouse process and protocol. Daily duties include palletizing items, organizing warehouse items by project, assisting the setup team with labeling, and moving inventory within the warehouse (racking system is in place). Support returns, inventory management, and inspections. Assist with coordinating freight receiving and pick-ups, as needed. Adhere to the company’s warehouse safety and operational protocols. The warehouse Associate may be dispatched out to property installation sites to assist with basic operations/on-site support tasks on an as-needed basis. Assist with other tasks and projects, as assigned. Requisites Prior experience working in a smaller warehouse environment is strongly preferred. Familiarity with warehouse safety protocols and standards is strongly preferred. Prior experience using mobile applications to manage warehouse inventory. Technology feels intuitive and not intimidating. Forklift certified or willing to learn. This position requires operating a forklift regularly. This is a physically engaging role. Employees should expect to be on their feet during the vast majority of their working hours, they should be able to lift up to 50-75 lbs comfortably/unassisted, and should be comfortable going up and down ladders. Valid driver’s license and upstanding driving record. Access to reliable personal transportation. A background check will be conducted as a contingency for employment. Schedule & Compensation Location: The warehouse location is 5620 Salmen St. Elmwood, Louisiana. This is not a remote role. Compensation: The Warehouse Associate role is a part-time, hourly position within the Design & Install team. Compensation for this position is hourly and commensurate with experience. Schedule: The warehouse operates Monday-Friday 8:30 am - 4:30 pm. The initial time commitment will be 20 - 25 hours per week and will require some flexibility around large freight shipment scheduling. We do have some flexibility on the scheduled working hours. The warehouse associate can either consolidate the 20-25 working hours into a minimum of 3 8-hour days, or spread the hours out to 5 5-hour days, depending on the candidate’s preference and availability. The working schedule will be determined at the outset of employment and will be fixed once employment begins. How to Apply Qualified applicants should submit the materials listed below to jobs@stayheirloom.com. Resume Any additional material(s) you would like considered as part of your application. PART-TIME · NEW ORLEANS Warehouse Associate Apply now", "grouping_count": 0}, {"id": 878972243412699, "advertiser_name": "Heirloom", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["878972243412699_00.jpg"], "ad_text": "Heirloom Sponsored About Heirloom Heirloom is a leading provider of large-format, luxury short-term rentals on the national level. Our unique focus on providing word-class accommodations to discerning groups of travelers in premier travel destinations, combined with a tech-enabled and data-driven business strategy, has allowed Heirloom to quickly carve out a unique space for itself within the highly competitive and rapidly evolving luxury hospitality industry. General Overview The Maintenance Technician plays a central role in the daily operation of Heirloom - Savannah’s growing portfolio. In partnership with the Property Operations and Housekeeping, the Maintenance Technician is responsible for executing on basic repairs and preventative maintenance to ensure that all properties fulfill Heirloom’s property maintenance and brand standards. A successful candidate is a reliable team player, a resourceful problem solver with previous maintenance experience. Essential Functions Handling scheduled preventative maintenance and basic repairs and maintenance, including, but not limited to: Essential home repairs, including, but not limited to: repairing/replacing garbage disposals, unclogging drains, replacing toilets, replacing ceiling fans, etc. Troubleshooting equipment repairs (HVAC, electrical, plumbing), helping determine if a third-party technician is necessary. Hanging & Mounting: art, mirrors, decor, light fixtures, hooks, floating shelves, etc. Basic landscaping and groundskeeping: weed whacking, mowing, weeding, etc. Essential pool maintenance: Troubleshooting repairs, skimming, re-connecting pool vacuum, setting equipment timers. Basic carpentry repairs: repairing/replacing broken support rails in beds and couches, replacing balcony banisters. Drywall repair (patching and painting) Assists with conducting routine inspection of premises, equipment, and systems. Diagnosing mechanical, plumbing, and electrical issues and correcting them or coordinating with the Property Manager to schedule repairs, as necessary. Assists in overseeing technicians when professional repairs are necessary. Reporting any needed repairs, low stock items, and facilities maintenance needs in a timely fashion Assist with new property installations on an as needed basis. Hang and mount art, decor, window treatments, mirrors, and light fixtures. Stock and maintain the company tool kit. Assume emergency on-call duty, when assigned. Special projects, as assigned. Requisites Must have a valid driver’s license, an upstanding driving record, and access to dependable transportation. A company vehicle (cargo van) is provided during working hours. Lives in close or commutable proximity to Savannah (within 30 minutes) Prior in-house maintenance experience (3-5+ years) Highly proficient in the use of hand and power tools Prior experience with hanging and mounting art, mirrors, decor, window treatments, and decor. Including how to safely hang oversize and overweight items. Prior experience with drywall repairs and painting Can patch and repair drywall damage (example: blemishes the size of a grapefruit) Prior experience with basic carpentry: feels comfortable repairing a broken bed support beam, can build a basic floating shelf, can repair a screen door. Prior experience with basic plumbing: can repair and replace a toilet and garbage disposal, can unclog a drain and knows when a professional should be called. Can replace and hang electrical fixtures: pendants, sconces, ceiling fans, etc. Able to comfortably lift 50lbs and climb a ladder. Bilingual (English/Spanish OR English/Brazilian Portuguese) is a plus, but not a firm requirement. Any kind of construction background or trade certification is a plus, but not a firm requirement. Schedule & Compensation The Maintenance Technician is a full-time salaried role with benefits (PTO, health insurance, etc.) based in Savannah, GA. The work schedule is variable and is based on the guest check in/out schedule. How to Apply Qualified applicants should submit the materials listed below to jobs@stayheirloom.com. Resume Any additional material(s) you would like considered as part of your application: photos of past work are always welcome!", "grouping_count": 2}, {"id": 866244064487595, "advertiser_name": "Heirloom", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["866244064487595_00.jpg"], "ad_text": "Heirloom Sponsored About Heirloom Heirloom is a leading provider of large-format, luxury short-term rentals on the national level. Our unique focus on providing word-class accommodations to discerning groups of travelers in premier travel destinations, combined with a tech-enabled and data-driven business strategy, has allowed Heirloom to quickly carve out a unique space for itself within the highly competitive and rapidly evolving luxury hospitality industry. General Overview The Maintenance Technician plays a central role in the daily operation of Heirloom - Austin’s growing portfolio. In partnership with the Property Operations and Housekeeping, the Maintenance Technician is responsible for executing on basic repairs and preventative maintenance to ensure that all properties fulfill Heirloom’s property maintenance and brand standards. A successful candidate is a reliable team player, a resourceful problem solver with previous maintenance experience. Essential Functions Handling scheduled preventative maintenance and basic repairs and maintenance, including, but not limited to: Essential home repairs, including, but not limited to repairing/replacing garbage disposals, unclogging drains, replacing toilets, replacing ceiling fans, etc. Troubleshooting equipment repairs (HVAC, electrical, plumbing), helping determine if a third-party technician is necessary. Hanging & Mounting: art, mirrors, decor, light fixtures, hooks, floating shelves, etc. Basic landscaping and groundskeeping: weed whacking, mowing, weeding, etc. Essential pool maintenance: Troubleshooting repairs, skimming, re-connecting pool vacuum, setting equipment timers. Basic carpentry repairs: repairing/replacing broken support rails in beds and couches, replacing balcony bannisters. Drywall repair (patching and painting) Assists with conducting routine inspection of premises, equipment, and systems. Diagnosing mechanical, plumbing, and electrical issues and correcting them or coordinating with the Property Manager to schedule repairs, as necessary. Assists in overseeing technicians when professional repairs are necessary. Reporting any needed repairs, low stock items, and facilities maintenance needs in a timely fashion Assist with new property installations on an as needed basis. Hang and mount art, decor, window treatments, mirrors, and light fixtures. Stock and maintain the company tool kit Assume emergency on-call duty, when assigned. Special projects, as assigned. Requisites Must have a valid driver’s license, an upstanding driving record, and access to their own dependable truck and/or van (not a sedan) A monthly gas stipend will be provided for the use of the vehicle for work. Lives in close or commutable proximity to Austin (within 30 minutes) Prior in-house maintenance experience (3-5+ years) Highly proficient in the use of hand and power tools Prior experience with hanging and mounting art, mirrors, decor, window treatments, and decor. Including how to safely hang oversize and overweight items. Prior experience with drywall repairs and painting Can patch and repair drywall damage (example blemishes the size of a grapefruit) Prior experience with basic carpentry feels comfortable repairing a broken bed support beam, can build a basic floating shelf, can repair a screen door. Prior experience with basic plumbing: can repair and replace a toilet and garbage disposal, can unclog a drain and knows when a professional should be called. Can replace and hang electrical fixtures: pendants, sconces, ceiling fans, etc. Able to comfortably lift 50lbs and climb a ladder. Bilingual (English/Spanish) is a big plus, but not a firm requirement. Any kind of construction background or trade certification is a plus, but not a firm requirement. Schedule & Compensation The Maintenance Technician is a full-time salaried role with benefits (PTO, health insurance, etc.) based in Austin, TX. The work schedule is variable and is based on business needs. Weekend availability is required. How to Apply Qualified applicants should submit the materials listed below to jobs@stayheirloom.com. Resume Any additional material(s) you would like considered as part of your application: photos of past work always welcome! FULL-TIME · $50,000 - $60,000 / HOUR · AUSTIN, TEXAS Maintenance Technician Apply now", "grouping_count": 0}, {"id": 907561573611758, "advertiser_name": "Heirloom", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["907561573611758_00.jpg"], "ad_text": "Heirloom Sponsored About Heirloom Heirloom is a leading provider of large-format, luxury short-term rentals on the national level. Our unique focus on providing word-class accommodations to discerning groups of travelers in premier travel destinations, combined with a tech-enabled and data-driven business strategy, has allowed Heirloom to quickly carve out a unique space for itself within the highly competitive and rapidly evolving luxury vacation rental industry. Responsibilities: Act as the steward of the recruitment process and applicant tracking system for all company staffing needs. Assist HR Assistant with posting jobs to appropriate job boards. Source and recruit candidates by using databases, social media, etc. Screen candidates resumes and job applications. Conduct interviews using various reliable recruiting and selection tools/methods to filter candidates. Act as a point of contact and build influential candidate relationships during the selection process. Requisites 2+ years of recruiting experience. Solid ability to conduct different types of interviews. Excellent communication and interpersonal skills. Highly proficient in MS Office and G Suite. Exemplary planning, multi-tasking, and time-management skills. Active learner: taking initiative comes naturally. High degree of professionalism and judgment with the ability to maintain a high level of confidentiality. Strong decision-making skills. Exceptional verbal and written communication skills. Schedule & Compensation The Recruiter role is a part-time position based in New Orleans, LA. Scheduled working hours are Monday-Friday 9:00 am - 2:00 pm, some availability outside scheduled working hours may be required on an as-needed basis. Compensation for this position is hourly and commensurate with experience. How to Apply Qualified applicants should submit the materials listed below to jobs@stayheirloom.com. Resume Cover letter specifically addressing the essential functions of this role in relation to your skills, background, and experience. Any additional material(s) you would like considered as part of your application. PART-TIME · NEW ORLEANS, LOUISIANA Recruiter Apply now", "grouping_count": 0}, {"id": 850064156083721, "advertiser_name": "Heirloom", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["850064156083721_00.jpg"], "ad_text": "Heirloom Sponsored About Heirloom Heirloom is a leading provider of large-format, luxury short-term rentals on the national level. Our unique focus on providing word-class accommodations to discerning groups of travelers in premier travel destinations, combined with a tech-enabled and data-driven business strategy, has allowed Heirloom to quickly carve out a unique space for itself within the highly competitive and rapidly evolving luxury hospitality industry. General Overview The Pool Technician plays a central role in the daily operation of Heirloom - New Orleans growing portfolio. In partnership with the Property Operations, the Pool Technician is responsible for testing the pH of the swimming pool water, adding chlorine, acid, and other chemicals to correct the pH as well as repairing light fittings, leaks, cracks, and faulty equipment. A successful candidate is a reliable team player, a resourceful problem solver with previous maintenance experience. Essential Functions Maintaining equipment and chemical stock levels at store and in the vehicle. Testing swimming pool water pH, and chlorine levels. Adding acid, chlorine, and other chemicals to correct pH level. Cleaning the swimming pool using authorized equipment. Replacing globes in underwater light fittings. Fixing cracks or leaks in the swimming pool structure. Fitting and repairing pipes and plumbing for spas and pools. Servicing and fixing faulty pool cleaning equipment. Completing paperwork and reporting service requirements to management. Reporting any needed repairs, low stock items, and facilities maintenance needs in a timely fashion. Requisites Must have a valid driver’s license, an upstanding driving record, and access to their own dependable truck and/or van (not a sedan) A monthly gas stipend will be provided for the use of the vehicle for work. Lives in close or commutable proximity to New Orleans (within 30 minutes) Prior in-house pool technician experience (3-5+ years) Extensive knowledge of proper pool cleaning and maintenance methods. Extensive knowledge of swimming pool chemicals and their properties. Ability to lift heavy equipment. Ability to work in harsh weather conditions. Highly proficient in the use of hand and power tools Schedule & Compensation The Pool Technician is a full-time salaried role with benefits (PTO, health insurance, etc.) based in New Orleans, LA. The work schedule is variable and is based on business needs. Weekend availability is required. How to Apply Qualified applicants should submit the materials listed below to jobs@stayheirloom.com. Resume Any additional material(s) you would like considered as part of your application: photos of past work always welcome! FULL-TIME · NEW ORLEANS, LOUISIANA Pool Technician Apply now", "grouping_count": 0}]