[{"id": 509469067983684, "advertiser_name": "Service Bros. Transport", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["509469067983684_00.jpg"], "ad_text": "Service Bros. Transport Sponsored Class A Yard Driver Needed in San Bernardino $25 Hour JOB RESPONSIBILITIES: Provide efficient flow of trailers and spaces by driving and maneuvering yard truck & trailers from dock to dock switching out empty trailers with full trailers and/or within the designated areas as required by operations to keep production moving. Provides support to Shipping department with loading and unloading process of trailers and arrange trailers to maximize the yard space. Operate Yard Truck in a safe manner during numerous trailer / door change procedures daily involving loaded and empty trailer/containers. Communicate professionally with all levels of personnel (managers, staff, etc.) Assist with yard checks. Be proactive in communication with the plant and our personnel regarding issues and needs. Check trailers before pulling away from the dock doors. Ability to work in a fast-paced environment. Perform Pre and Post shift inspections as required by management. Must be able to work as a team and ability to get along and have a good working relationship with other employees. Comprehend instructions given by supervisors. Follow all safety and company policies and procedures including maintaining good housekeeping, reporting any issues, accidents, or incidents immediately. Able to work outdoors in varying weather conditions. Perform other duties as assigned. QUALIFICATIONS: High School Diploma 2 years’ relevant experience CDL class A Air Brake endorsement Completion of Commercial Driving School Warehouse experience a plus PHYSICAL REQUIREMENTS: Requires frequent walking, carrying, reaching, standing, and stooping. Requires lifting/lowering, pushing, or pulling of various items of varying weight. Benefits: Monday-Friday – 7:00 A.M to 3:30 P.M (Weekends Off) Benefit Coverages up to $300. Anniversary Payment. Holidays Paid. Sick Pay. 401K. Life Insurance. FULL-TIME · $25 / HOUR · SAN BERNARDINO, CALIFORNIA Class A Yard Driver in San Bernardino Needed $25 Hour Apply now", "grouping_count": 0}]