[{"id": 1143423326360715, "advertiser_name": "O'Brien's Moving & Storage", "status": "Active", "date": "01/04/2023", "ad_url": [], "image_save_path": ["1143423326360715_00.jpg"], "ad_text": "O'Brien's Moving & Storage Sponsored Launch your career at O’Brien’s Moving & Storage. We are actively hiring for several mover, driver and helper positions – all with competitive pay and benefits. We offer comprehensive training, with advancement opportunities so you can build a solid career close to home: at our Allentown location or in Reading, PA. Looking for career stability? Get the security of full-time work with guaranteed hours year-round at a growing company, and build a long-term career in the trucking industry. Want the pay you deserve? Start with a competitive salary and earn more with merit-based pay increases, overtime opportunities, and other financial growth options. Eager to learn and grow? Benefit from industry training with extensive opportunities for promotions within the company and professional advancement in the industry. Many come here as helpers, become drivers and then have the opportunity to become a business partner. We will help you finance your dream of business ownership – owning your own truck, if you desire. As one of the region’s most-awarded moving companies and an Allied Van Lines partner, O’Brien’s Moving & Storage has contracts with the area’s largest businesses and serves as the biggest provider of both commercial and residential services. We are continually growing to meet the relocation and warehousing requirements of our extensive customer base – and need to expand our professional staff with qualified candidates like you. Come join our growing teams of professionals. Contact hiring manager Barb Barnhart at barbb@obriens-moving.com or 610-217-0372 for more information and to set up an interview. FULL-TIME · TREXLERTOWN, PENNSYLVANIA Movers: Drivers and Helpers – Allentown Apply now", "grouping_count": 0}, {"id": 5841130759300967, "advertiser_name": "O'Brien's Moving & Storage", "status": "Active", "date": "01/04/2023", "ad_url": [], "image_save_path": ["5841130759300967_00.jpg"], "ad_text": "O'Brien's Moving & Storage Sponsored Get your career path on track with opportunity to grow at a strong company. Now hiring motivated candidates for multiple positions with competitive pay and benefits at O’Brien’s Moving & Storage – the region’s largest moving company. We provide training for mover, driver and helper positions, plus career advancement opportunities. Build a solid career close to home at either our Reading or Allentown location. Looking for a stable career? Get the security of full-time work with guaranteed hours year-round at a growing company, and build a long-term career in the trucking industry. Want the salary you deserve? Start with a competitive salary and earn more with merit-based pay increases, overtime opportunities, and other financial growth options. Motivated to learn and grow? Benefit from industry training with extensive opportunities for promotions within the company and professional advancement in the industry. Many come here as helpers, become drivers and then have the opportunity to become a business partner. We will help you finance your dream of business ownership – owning your own truck, if you desire. As one of the region’s most-awarded moving companies and an Allied Van Lines partner, O’Brien’s Moving & Storage has contracts with the area’s largest businesses and serves as the biggest provider of both commercial and residential services. We are continually growing to meet the relocation and warehousing requirements of our extensive customer base – and need to expand our professional staff with qualified candidates like you. Come join our growing teams of professionals. Contact hiring manager Barb Barnhart at [Email hidden] or 610-217-0372 for more information and to set up an interview. FULL-TIME · ALLENTOWN, PENNSYLVANIA Moving Company Drivers & Helpers - Reading Apply now", "grouping_count": 0}, {"id": 623759529509787, "advertiser_name": "O'Brien's Moving & Storage", "status": "Active", "date": "01/04/2023", "ad_url": [], "image_save_path": ["623759529509787_00.jpg"], "ad_text": "O'Brien's Moving & Storage Sponsored Be your own boss as a moving truck Owner/Operator, or join the professional moving crew, at our prestigious moving company! Experienced drivers or movers can become Owner/Operators or part of the crew at the region’s largest moving and storage company. We will set you up for success. Already have your truck? Join our expanding fleet. We have a large client base and need to expand our team at O’Brien’s Moving & Storage – Reading location or in Allentown. Are you a mover/helper that wants to make a lot more money or learn how to drive and become an owner/operator? This is your opportunity to enhance your career, with the compensation to match. • Take home pay based on 5 days per week over $200,000. • Ability to earn more if you want to work Saturday’s. • No overnights unless you want them. • Be your own boss. • Hire your own crews. • Lease a vehicle from us, and/or assistance in financing your own truck, including full financing for the proper candidate. • Control your schedule as far as what days you work. • Tips. • Quarterly bonuses for good performance. • Ability to expand to several trucks. We are adding several owner/operator crews to our large fleet. If you are working for a moving company or have moving experience and would like to become and owner/operator, or be part of an owner/operator crew, please contact us. Come join our growing teams of professionals. Contact hiring manager Barb Barnhart at barbb@obriens-moving.com or 610-217-0372 for more information and to set up an interview. FULL-TIME · ALLENTOWN, PENNSYLVANIA Owner/Operator and Moving Crew – Reading Apply now", "grouping_count": 0}, {"id": 528790959199759, "advertiser_name": "O'Brien's Moving & Storage", "status": "Active", "date": "01/04/2023", "ad_url": [], "image_save_path": ["528790959199759_00.jpg"], "ad_text": "O'Brien's Moving & Storage Sponsored Owner/Operator opportunities at a renown local moving company – whether you need a truck or have your truck, we have the career for you! We are hiring both new and experienced owner/operators at our Allentown location and for Reading. Movers, drivers or helpers can become Owner/Operators or part of the crew here at the region’s largest moving and storage company where we set you up for success. Have a truck? Join our fleet and support our large and expanding list of clients here at O’Brien’s Moving & Storage – Reading location or in Allentown. Advance your career at O’Brien’s: If you are a helper that wants to make a lot more money or learn how to drive and become an owner/operator, this is your opportunity to enhance your career with the compensation to match. • Take home pay based on 5 days per week over $200,000. • Ability to earn more if you want to work Saturday’s. • No overnights unless you want them. • Be your own boss. • Hire your own crews. • Lease a vehicle from us, and/or assistance in financing your own truck, including full financing for the proper candidate. • Control your schedule as far as what days you work. • Tips. • Quarterly bonuses for good performance. • Ability to expand to several trucks. We are adding several owner/operator crews to our large fleet. If you are working for a moving company or have moving experience and would like to become and owner/operator, or be part of an owner/operator crew, please contact us. Come join our growing teams of professionals. Contact hiring manager Barb Barnhart at barbb@obriens-moving.com or 610-217-0372 for more information and to set up an interview. FULL-TIME · TREXLERTOWN, PENNSYLVANIA Mover Owner/Operators & Crew – Allentown Apply now", "grouping_count": 0}]