[{"id": 1098455287647007, "advertiser_name": "Tigers Eye Self Storage Moncks Corner", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.managementblueprints.com%2Femployment%2F&h=AT2bzAZioHHnETxskZ4PIc_pMib7Z5Q_L27EzpEKloFOWAL8BitrND9E_Sb5zZmifK9D_NuBfTUM7jbwbvU12cBa_TPbDAdDPoIOSlSk9PHoWWWJkipkxNPeHkkORr9JKBpQqw3c224i480ZTW_IoBUgSpo"], "image_save_path": ["1098455287647007_00.jpg"], "ad_text": "Tigers Eye Self Storage Moncks Corner Sponsored Please start the application process here: www.managementblueprints.com/employment/ Tigers Eye Self Storage has a strong Customer First philosophy. We train new staff in an ongoing and supportive manner to assure they have been empowered to help our customers solve their needs quickly and simply. We help managers grow in their experience, knowledge and understanding of the job until they are ready to take over operations for themselves! We at Tigers Eye Self Storage believe that the process of developing and enhancing skills should occur at all levels of your career. We pride ourselves on this philosophy and on the great success that our entire team has seen since its adoption, in 2004. As a part of this philosophy, we have a very progressive compensation system that is directly related to a manager’s daily work contribution and the direct effective this has on the day to day operation of the store. We believe that our blend of on-the-job instruction, one-on-one coaching, and computer-based learning opportunities act to support our entire team and our over-riding goal for higher efficiency and an easier, more enjoyable day-to-day work experience for everyone. Supervisors and managers are actively involved in this process and are evaluated on their ability to improve knowledge-level and skill across our team ensuring success for one and all. The information on this website offers only a brief overview of the benefit plans available to Tigers Eye Self Storage team members. A description of the benefit provisions, conditions and limitations is available to our employees. Job Requirements: The successful candidate will have a minimum of 1-3 years’ experience in the retail, sales or self-storage management industry. Excellent customer service and team building skills a must. Tigers Eye Self Storage is a diversified property management company that focuses on acquiring self storage and commercial real estate as well as third-party management. We have offices throughout the Southeast. Salary commensurate with experience. We also offer Paid Vacation/Personal time. As a Store Manager you will perform various duties including: Provide outstanding service to our customers in person and on the telephone Process New Customer Move-Ins, Payments, Truck Rentals and handle Customer Service needs Prepare rental contracts and invoices for customers Manage the facility and property to keep them in a clean condition Clean and inspect storage spaces. Use of a broom, common household cleaners and pesticides is required. Position requires a valid driver’s license and a good driving record to operate a motor vehicle to allow for personal transport to the office. Ability to maintain good housekeeping practices in the work area and comply with all safety rules and procedures. Manage but not perform maintenance work at properties. Position requires a valid driver’s license and a good driving record to operate a motor vehicle. Ability to maintain good housekeeping practices in the work area and comply with all safety rules and procedures. Hours Needed: (These hours may change based on business needs) Mon through Friday – 9am to 6pm Sat – 9am to 4pm Sunday By Appointment Only After your information has been received and reviewed, you will be contacted when we begin scheduling interviews for a specific need. You are welcome to contact us to determine the status of your submission, but please keep the tone and frequency of these inquiries professional. Please use this form to send Tigers Eye Self Storage an Introduction Email. This is the first step in our hiring process. Upon completing the form below, you should instantly receive an email that will allow you to attach and submit your full resume. Please check for this and submit your resume as soon as possible. PDF or scanned versions of resumes will not be accepted. MS Word format is required. Basic Computer Skills that are required to perform this job include: Modern Smart Phone – Make and receive calls, SMS and emails, check SMS and emails while on a phone call, make and receive video calls, take and send images, notate and correct images, take and send screenshots and other normal use functions. Internet – Using the internet to browse and research. Tabs and multiple browsers. Understand menu bars, tabs on different internet browsers, difference between internet browsers, how to connect to the internet on a wireless network Know where the web address bar is located, what a URL is and where to type it Operate the print function Recognize icons (sound, internet, video, etc.) Understand how to search, assess search results, and download information from the internet Email – Using text to correspond with other users through the internet using an email application or browser Write, modify, and edit text using an email application FULL-TIME · $15 - $25 / HOUR · LADSON, SOUTH CAROLINA Store Manager & Lien Sale Coordinator Cane Bay Apply now", "grouping_count": 0}]