[{"id": 1033174871418200, "advertiser_name": "Reserve Truck Lines", "status": "Active", "date": "12/22/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT02o2qZuK0GVgBR64cFuXuOPckjYMS93e39lAX6jQpNXSFq5kFKw294r0_alo6nCWiV-O1y4yPTY271Qsny_TXFBAHPKHT4QvAGaq4EHarvGr2ODC_AoqcVnGJ5iL-Uel1YueY3NXsBTv21ugx-E4rFd4Xpyux1h0UUODrRmv4"], "image_save_path": ["1033174871418200_00.jpg"], "ad_text": "Reserve Truck Lines Sponsored HIRING CDL drivers! Reserve Truck Lines is a family owned trucking company based in IA and IL dedicated to reliable and friendly freight shipping. We offer our drivers great benefits and bonuses throughout the year. We are hiring Cdl-A company drivers, Owner Operators and we also offer lease buy option! Why choose RTL? -1099 weekly direct deposit- - Detention and layover paid- - Direct deposit every week- - Percentage pay- - Plate Program- - Fuel cards - - BEST PAY OFFER for qualified drivers- Please message us here on fbk or call/text our HR team at: 815-641-7742 (Aaron) Want to be home daily? Sign Up", "grouping_count": 0}, {"id": 614278603717136, "advertiser_name": "Reserve Truck Lines", "status": "Active", "date": "11/17/2022", "ad_url": [], "image_save_path": ["614278603717136_00.jpg"], "ad_text": "Reserve Truck Lines Sponsored Reserve Truck Lines is a family owned trucking company based in IA and IL dedicated to reliable and friendly freight shipping. We offer our drivers great benefits and bonuses throughout the year. **** We are hiring Cdl-A company drivers, Owner Operators and we also offer lease buy option!****** Why choose RTL? -1099 and W2 Programs- - Detention and layover paid- - Direct deposit every week- - Percentage pay- - Plate Program- - Fuel cards - - BEST PAY OFFER for qualified drivers- Please message us here on Fbk or call/text our HR team at: 815-641-7742 (Aaron) Be home weekly Transport Service Send message", "grouping_count": 0}, {"id": 2667590243384044, "advertiser_name": "Reserve Truck Lines", "status": "Active", "date": "11/10/2022", "ad_url": [], "image_save_path": ["2667590243384044_00.jpg"], "ad_text": "Reserve Truck Lines Sponsored Reserve Truck Lines is a family owned trucking company based in IA and IL dedicated to reliable and friendly freight shipping. We offer our drivers great benefits and bonuses throughout the year. We are hiring Cdl-A company drivers, Owner Operators and we also offer lease buy option! Why choose RTL? -1099 and W2 Programs- - Detention and layover paid- - Direct deposit every week- - Percentage pay- - Plate Program- - Fuel cards - - BEST PAY OFFER for qualified drivers- Please message us here on fbk or call/text our HR team at: 815-641-7742 (Aaron) Drivers be home daily! Transport Service Send message", "grouping_count": 0}, {"id": 8299160623491248, "advertiser_name": "Reserve Truck Lines", "status": "Active", "date": "11/09/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT02o2qZuK0GVgBR64cFuXuOPckjYMS93e39lAX6jQpNXSFq5kFKw294r0_alo6nCWiV-O1y4yPTY271Qsny_TXFBAHPKHT4QvAGaq4EHarvGr2ODC_AoqcVnGJ5iL-Uel1YueY3NXsBTv21ugx-E4rFd4Xpyux1h0UUODrRmv4"], "image_save_path": ["8299160623491248_00.jpg"], "ad_text": "Reserve Truck Lines Sponsored CDL-a drivers who want to be home daily and make good $$ check us out: Reserve Truck Lines is a family owned trucking company based in IA and IL dedicated to reliable and friendly freight shipping. We offer our drivers great benefits and bonuses throughout the year. We are hiring CDL-A company driver, Owner Operators and we also offer lease& buy. Intermodal and OTR job are available. Please message us here on Fbk or call/text our HR team at: 815-641-7742 Aaron for Driving inquires 847-708-8209 Sean for Lease to buy inquires HTTPS://RESERVELTD.COM/ We are hiring CDl-A drivers! Best pay offer! Sign up", "grouping_count": 0}]