[{"id": 547721080302645, "advertiser_name": "Monson Truck & Trailer Repair, Inc. and Monson Full Service Towing", "status": "Active", "date": "07/25/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.indeed.com%2Fviewjob%3Ft%3Dlight%2520duty%2520tow%2520truck%2520driver%2520family%2520owned%2520shop%26jk%3D295ff5856cefe3e9%26_ga%3D2.221593361.845711525.1658152641-1578438748.1653176103&h=AT34OLX_TWEilowbOpaTRAAo5-47NGmqm1ZoLWvfmtal6bauVWeWDS6EoHaRkPd8r-OODF5Vrd7HXaLRTUlmmCvsH4SQKAL_mqHxoTHZt_B-SC27PO_dSFwCaG3WMTtP8qBG63itxNM_f67Bv6VqzWi-q14p5OdwU3J8VeAVbe0"], "image_save_path": ["547721080302645_00.jpg"], "ad_text": "Monson Truck & Trailer Repair, Inc. and Monson Full Service Towing Sponsored Monson Truck and Trailer is looking for a light duty tow truck driver to join our fast growing team in Davenport, IA. Do you like people and enjoy assisting them? Want to earn excellent pay and be appreciated too? IT IS POSSIBLE if you are an ethical, upbeat, positive, tow truck driver-- WE WANT TO SEE YOU! Our Tow Drivers are team players. They know how to get the job done right, on time, and in a professional manner. HERE’S WHAT WE PROMISE: ✓ GOOD PAY AND BENEFITS – Competitive pay with salary + bonuses & incentives ✓ WE WILL KEEP YOU BUSY – We are the fastest growing truck services company in the I-80 & I-74 corridor and we offer job security and plenty of work so you can stay busy and kick butt! ✓ YOU WILL LEARN SOMETHING NEW EVERY DAY – There’s lots of variety in the types of work we run into and your interests can drive some of the work we take on. ✓ YOU WILL BE APPRECIATED – We are family-owned & operated. Everyone is a family here and you’ll get constant support from the team and be appreciated for your unique contribution. ABOUT MONSON TRUCK & TRAILER REPAIR, INC. Monson Truck & Trailer Repair, Inc. is a family-owned and operated full-service diesel repair shop. At Monson we talk Trucks! Fleet owners, dispatchers and single drivers all call Monson. Why? Because we speak their language, truck. From big rigs to pickups and medium-duty rides, farm/grain, reefers and dump trucks, Monson is the leader for roadside and in-the-shop service. We speak Volvo, Peterbilt, Mack. We’re fluent in Kenworth, Freightliner & Western Star. We even speak Hino, Isuzu and Mitsubishi without an accent. You choose the brand, we’ve got it covered. Customers test Monson with their toughest truck problems and we need a tow truck driver who is up for the challenge. If you are interested in this job, please call, apply on Indeed or simply bring your resume to us in person: Monson Truck & Trailer Repair 4900 Wapello Ave, Davenport, IA 52802 No pressure, no obligation, just give us a call and let us know you saw the ad to start the conversation. 563 322 8308. You can also text our shop at 309-350-3082, if that's easier for you. INDEED.COM Light-Duty Tow Truck Driver Wanted Salary + Bonus Let's talk... Apply now", "grouping_count": 0}, {"id": 571894844388416, "advertiser_name": "Monson Truck & Trailer Repair, Inc. and Monson Full Service Towing", "status": "Active", "date": "07/05/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2FIndeed.com%2F&h=AT07S7zQO00rUH_mANPoUtS3ToZh68HBJcjDs5l89jBIca00-wZ7J_YJFz6Y8XrxS2_5F1kcqQjghhZUqKYNPhrOBmNwBT4No3JTkbgpl6ZOkKPAFLa7n9fiTfeVWk1m8NfCGyoa-9A4nQ2K5eLBDsm2btL0cay829BQqVelNuA", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.indeed.com%2Fviewjob%3Ft%3Ddiesel%2520technician%2520family%2520owned%2520shop%2520good%2520pay%2520bonus%2520no%2520weekends%26jk%3Dc2e9ceb5c1e3c8a7%26_ga%3D2.23815097.266975172.1657026832-1578438748.1653176103&h=AT34OLX_TWEilowbOpaTRAAo5-47NGmqm1ZoLWvfmtal6bauVWeWDS6EoHaRkPd8r-OODF5Vrd7HXaLRTUlmmCvsH4SQKAL_mqHxoTHZt_B-SC27PO_dSFwCaG3WMTtP8qBG63itxNM_f67Bv6VqzWi-q14p5OdwU3J8VeAVbe0"], "image_save_path": ["571894844388416_00.jpg"], "ad_text": "Monson Truck & Trailer Repair, Inc. and Monson Full Service Towing Sponsored Diesel Technicians: Tired of the BULL? If you need to earn a decent paycheck for your family but the thought of grinding away another year as a number in a soulless dealer… …we have a solution. At Monson Truck & Trailer Repair in Davenport, IA we do things differently. Since we first opened our doors over 15 years ago we have excelled in the Diesel Truck & Trailer Repair field by having the best staff, the best tools and the best possible work environment. We are constantly focused on hiring and training the very best people to add to our team of professionals and that includes helping out with relocation expenses for the right techs who live outside of our local area. We hire the best, train the best, and keep the best. But don’t take our word for it; let us prove it to you… HERE’S WHAT WE PROMISE OUR TECHS… ✓ GOOD PAY AND BENEFITS – We offer PHENOMENAL PAY and GREAT bonuses depending on experience / Paid holidays / PTO (Paid) days off each year. Health benefits package (50% paid) / Life insurance policy / Relocation assistance for the right candidate / Company trips. ✓ WE WILL KEEP YOU BUSY – We are the fastest growing truck services company in the I-80 & I-74 corridor and we offer job security and plenty of work so you can stay busy and kick butt! ✓ YOU WILL LEARN SOMETHING NEW EVERY DAY – There’s lots of variety in the types of work we run into and your interests can drive some of the work we take on. ✓ YOU WILL BE APPRECIATED –We are family-owned & operated. Everyone is part of the family here and you'll get constant support from the team. Your opinion is respected and you can really make a difference. ✓ WE WILL HELP YOU BECOME MORE VALUABLE - We are big on personal growth, we offer both on-the-job and off-site training that will make you worth more in the industry and live a better life. ✓ WE PROVIDE A SAFE AND PRODUCTIVE WORKING ENVIRONMENT - Family-owned and operated with cutting-edge technology and diagnostic tools so you have everything you need to do your best work. ✓ WE’VE GOT YOUR BACK – We go out of our way to make sure that our employees are taken care of. We listen, we care and we want your life to work, inside and outside of your job. ✓ WE DON’T OFFER JOBS, WE OFFER CAREER PATHS - We love hiring good people who want to stick with us and grow. Share your future vision with us; we’ll help you get there. ✓ BECOME A LEGEND – We have the equipment, the know-how and the creativity to make a ton of viral videos in our shop this year. If you’re good at what you do, this is your chance to be known for what you’ve done. Join our team and leave a lasting mark on the industry long after you’ve put down the wrench. ABOUT MONSON TRUCK & TRAILER REPAIR, INC. Monson Truck & Trailer Repair, Inc. is a family-owned and operated full-service diesel repair shop. At Monson we talk Trucks! Fleet owners, dispatchers and single drivers all call Monson. Why? Because we speak their language, truck. From big rigs to pickups and medium-duty rides, farm/grain, reefers and dump trucks, Monson is the leader for roadside and in-the-shop service. We speak Volvo, Peterbilt, Mack. We’re fluent in Kenworth, Freightliner & Western Star. We even speak Hino, Isuzu and Mitsubishi without an accent. You choose the brand, we’ve got it covered. Monson TNT is currently looking for an experienced DIESEL TECHNICIAN who is a self-starter with a great attitude who takes pride in their work. The right team member will have a great attitude and be well-qualified and experienced in heavy-duty diesel/semi truck & trailer work. We are looking for the best and when you join our family, you will be appreciated, respected and well-compensated for your knowledge and skills. If you’re tired of the Bull and you’re ready to be part of something special, let’s talk. Give us a call. We look forward to speaking with you (563) 322-8308. You can also apply here on Indeed.com or simply drop off your resume in person: Monson Truck & Trailer Repair 4900 Wapello Ave, Davenport, IA 52802 #DieselTechnician #DieselMechanic #TruckMechanic #Technician #ATech", "grouping_count": 2}]