[{"id": 876791083471610, "advertiser_name": "VitaLifeMD", "status": "Active", "date": "01/20/2023", "ad_url": [], "image_save_path": ["876791083471610_00.jpg"], "ad_text": "VitaLifeMD Sponsored VitaLifeMD is seeking a professional and skilled IV licensed RN or LVN to join our high-end private practice in West Los Angeles. W2 employee, with full 401K, employer contribution, private health insurance, accrued paid time off, and reimbursement for mileage/expenses. Competitive salary with opportunity for extra pay/hours and bonuses. Qualifications: ◾️ Minimum 3 years RN or LVN experience--must be extremely proficient in IV placement ◾️ Preferred experience in Emergency Department (ED), IV Team, or Oncology ◾️ Possess an unencumbered California RN or LVN License ◾️ Excellent communications skills and bed side manners when servicing patients ◾️ Able to work with high profile patients in discrete manner ◾️ Excellent team worker: ready to share tasks with other nurses in office and able to converse with staff regarding scheduling/billing ◾️ Reliable transportation: willingness to travel to locations around greater Los Angeles area Responsibilities: ◾️ Work 32 to 40 hours per week both in office and at patients’ home administering nutrition / vitamins IV therapy, IM injections, performing lab draws, COVID testing, and processing labs in office ◾️ Work under the direct supervision of the medical director ◾️ Collaborate with nursing staff and administrative staff for optimal patient’s care ◾️ Prepare own supplies each day, mix own IVs in office ◾️ Chart accurately in a timely manner ◾️ Option to work after hours/weekends for compensation If you are ready to work with a professional medical team and friendly patients, we are happy to welcome you to our practice as a new asset to the VitaLifeMD family. Please send your resume and contact information to: [Email hidden] FULL-TIME · LOS ANGELES, CALIFORNIA IV Licensed RN or LVN Apply now", "grouping_count": 0}]