[{"id": 602268948397491, "advertiser_name": "Hound Dog's Towing & Recovery", "status": "Active", "date": "01/27/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.hounddogstowing.com%2Fapplication&h=AT3mkqZg6V0UguCUAgxgdIp83KGFTAcQT30BWpFZlnGGKDy0lZzMgAnytWjxE2IAglqTOYrZ06Bweda7sPH7vhmUk5nxM4_76CgWyHwJPUZp4zzGcHjzYw73uO-3gXUCWYqj7Dtjlh4Ic5F_joMcDD9_MlAZ4y-hIhBZ6dWc4cY"], "image_save_path": ["602268948397491_00.jpg"], "ad_text": "Hound Dog's Towing & Recovery Sponsored We're GROWING again!!! We're looking for Rollback Drivers!! Hound Dog's Towing & Recovery has multiple new accounts and we need rollback operators! This is a full time position with competitive wages. We offer a laidback, easygoing, low stress work environment and treat everyone like family! Our rollback operator positions are daytime positions Monday-Friday with most weekends off. We do not work for any motor clubs or police departments so most calls are stress free and you’re not rushed. Positions start at either 9am or 7am and we don’t keep you out late - we have a separate night shift to cover any calls after 6pm. We do have a rotation schedule for Saturdays but it is currently only one Saturday a month and as we add more drivers it will be less than that. You will NOT be on call at night or on the weekends like most companies so you will have plenty of time to spend with your family as well. This position is commission based and we have the work to keep you busy! We pay on a W-2 and pay every Friday! We offer paid training, newer trucks and equipment, employee discounts, company iPhones, dental & vision insurance, life insurance, 401K, paid PTO (vacation and sick days) after a year, paid holidays, and a fun work environment that is flexible for your needs. We care about our employees and also buy your childs school supplies at the beginning of each school year, supply a turkey with all the sides for Thanksgiving, and give Christmas bonuses. We can put you to work immediately! Job Requirements: Must have an excellent driving record. Must be 25 years of age or older. Must have own transportation to get back and forth to our office. Must be dependable with previous towing experience preferred but we will train the right candidate. Must be able to pass a DOT physical and drug test. Must be a people person and must have a clean, professional appearance and attitude. We are looking for people that are interested in a long term career with our company and our clients. We have grown fast in the last few years and have plenty of work for you to make an excellent paycheck! We are seeking individuals that can help our company grow and succeed. Interested applicants can fill out an application on Facebook, call 614-462-0729 or fill out an application on our website at http://www.hounddogstowing.com/application You can also apply in person at either location at: 432 E. 18th Avenue Columbus, Ohio 43201 (Immediate on-site interviews M-F 9am-6pm) Or 2918 Parsons Avenue Columbus, Ohio 43207 FULL-TIME · COLUMBUS, OHIO Tow Truck Driver Apply now", "grouping_count": 0}]