[{"id": 1310482316189147, "advertiser_name": "Wayne W Sell Trucking Corp.", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["1310482316189147_00.jpg"], "ad_text": "Wayne W Sell Trucking Corp. Sponsored Wayne W. Sell Trucking is immediately hiring qualified cement drivers with at least two years of CDL-A driving experience. Wayne W. Sell Corp was founded in 1955, our success is your success, we understand the importance of the trucker. We understand what it means to be a truck driver. As a member of our fleet, enjoy benefits like: ✅ Home daily with weekly pay ✅ 401k with weekly company contributions ✅ Paid holidays & vacations ✅ Health insurance ✅ 2017 and newer equipment ✅ Safety bonuses and more! Click here to apply. Home Daily | Immediate Openings Learn more", "grouping_count": 0}, {"id": 736109528076895, "advertiser_name": "Wayne W Sell Trucking Corp.", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["736109528076895_00.jpg"], "ad_text": "Wayne W Sell Trucking Corp. Sponsored Wayne W. Sell Trucking is immediately hiring qualified sand drivers with at least two years of CDL-A driving experience. Wayne W. Sell Corp, was founded in 1955, our success is your success, we understand the importance of the trucker. We understand what it means to be a truck driver. As a member of our fleet, enjoy benefits like: ✅ Weekly pay via direct deposit ✅ 401k with weekly company contributions ✅ Paid holidays & vacations ✅ Health insurance ✅ 2017 and newer equipment ✅ And more! Click here to apply. Hiring CDL-A Sand Drivers NOW | Wayne W. Sell Learn more", "grouping_count": 0}, {"id": 2279727622207068, "advertiser_name": "Wayne W Sell Trucking Corp.", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["2279727622207068_00.jpg"], "ad_text": "Wayne W Sell Trucking Corp. Sponsored Wayne W. Sell Trucking is hiring CDL-A drivers with at least two years of experience. As a regional driver, you’ll enjoy more home time, paid holidays, weekly pay, 401k plan with weekly company contributions, health insurance, safety bonuses, and more! Click here to apply. Hiring Regional CDL-A Flatbed Drivers NOW Learn more", "grouping_count": 0}, {"id": 719003506420369, "advertiser_name": "Wayne W Sell Trucking Corp.", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["719003506420369_00.jpg"], "ad_text": "Wayne W Sell Trucking Corp. Sponsored Wayne W Sell Corp is hiring experienced flatbed drivers immediately! Wayne W Sell Corp was founded in 1955, our success is your success, we understand the importance of the trucker. We know what it means to be a truck driver. We’re looking for CDL-A flatbed drivers with at least two years of experience to join our fleet. You’ll enjoy benefits like: 🚛 Weekly pay with direct deposit 🚛 401k with weekly company contributions 🚛 Paid holidays & vacations 🚛 2017 and newer equipment 🚛 Health insurance 🚛 Safety bonuses 🚛 And more! Click here to apply to join the Wayne W. Sell team. Experienced CDL-A Drivers APPLY NOW Learn more", "grouping_count": 0}, {"id": 1303526396861421, "advertiser_name": "Wayne W Sell Trucking Corp.", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["1303526396861421_00.jpg"], "ad_text": "Wayne W Sell Trucking Corp. Sponsored Wayne W. Sell Trucking is immediately hiring sand truck drivers with at least two years of experience. We understand what it means to be a truck driver and offer weekly pay; plus competitive benefits including health insurance, 401k match, safety bonuses, and more. Don’t just take our word for it — take a look at what our drivers have to say: “I’ve worked here for 20 years this March. I have always had consistent pay, a great truck and anytime that I needed something, John Sell was always able to help out.” Click here to apply and join the Wayne W. Sell fleet. CDL-A Sand Drivers APPLY NOW Learn more", "grouping_count": 0}, {"id": 1078761280193495, "advertiser_name": "Wayne W Sell Trucking Corp.", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["1078761280193495_00.jpg"], "ad_text": "Wayne W Sell Trucking Corp. Sponsored Be home daily as a cement driver! Wayne W. Sell Trucking is immediately hiring cement truck drivers with at least two years of experience. We offer weekly pay, competitive benefits including health insurance, 401k match, PTO, safety bonuses and more. Wayne W Sell Corp, was founded in 1955, our success is your success, we understand the importance of the trucker. We know what it means to be a truck driver. Click here to apply and join the Wayne W. Sell fleet. HOME DAILY Cement Drivers Learn more", "grouping_count": 0}]