[{"id": 717318053301703, "advertiser_name": "Prairie Supply Inc.", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["717318053301703_00.jpg"], "ad_text": "Prairie Supply Inc. Sponsored We are looking for an experienced truck driver with mechanic experience to serve our supply chain logistics department in a safe and timely manner. Home most nights, some overnight trips possible. General warehouse duties will apply when not driving. Position involves loading & unloading materials, staging orders, & other general warehouse duties as assigned. Concrete construction background & forklift experience a plus but will train. Duties Transport concrete construction materials over land to and from store locations & job sites Inspect vehicles for mechanical items and safety issues and perform preventative maintenance, mechanical experience is a plus. Plan routes and meet delivery schedules Document and log work/rest periods and miles spent driving and retain fuel/toll receipts Comply with truck driving rules and regulations (size, weight, route designations, parking and break periods) as well as with company policies and procedures Maneuver trucks into loading or unloading positions Collect and verify delivery instructions Report defects, accidents or violations Loading and unloading trucks Organizing, loading, unloading new items to be sold. Forklift operation General warehouse upkeep Attention to detail Delivery of Construction material and equipment a possibility Qualifications Proven work experience as a truck driver Hands on experience with electronic equipment and software (GPS, AVL units, CB etc.) Ability to drive long hours and travel regularly Extensive knowledge of applicable truck driving rules and regulations No recent moving or driving violations Adaptability and foresight to handle unexpected situations (traffic, weather conditions etc.) Valid truck driving license Concrete or Construction background a plus forklift training preferred, will train and certify valid driver’s license required FULL-TIME · WEST FARGO, NORTH DAKOTA CDL DRIVER WITH MECHANIC EXPERIENCE Apply now", "grouping_count": 0}]