[{"id": 726740072107702, "advertiser_name": "R+L Carriers", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT0tlBRTnSvG6Sj6nId8vuCTikYBojwwrIXrqf19SAxlUv1do6UjP2FyW_IottiTgtHRPOHJKrZ_LG_b1ksMJmVwkxiY9neCAT2wxZJjCG17gVO8gGYYMD68dPeCZ7KqI5AG858QTkdv6cgMvD9j8uNVcO8"], "image_save_path": ["726740072107702_00.jpg"], "ad_text": "R+L Carriers Sponsored Diesel Mechanics - Sanger, TX Full-Time, Monday-Friday, Various Shifts R+L Carriers has an immediate opportunity for Diesel Tractor Mechanics at our service center. Responsible for day-to-day equipment maintenance on the fleet equipment consisting of preventative maintenance and minor to major repairs to Class A Trucks, trailers, and forklifts. Diesel engine experience is required. Experience in maintaining trailers, overhead doors, lift gates, dollies, welding, and working on forklifts is preferred. Requirements / Qualifications: 2+ years of Diesel Mechanic experience preferred Experience in preventive maintenance of Cummins & Detroit engines Experience with AC and Electrical Must be able to handle major repairs Experience in Tractor PMs and repairs Have the ability to lift 50lbs Must have own tools Excellent Benefits R+L Carriers offers an excellent compensation and comprehensive benefits package, including Medical/Dental/Vision Insurance, 401(k) Retirement Plan with matching contributions, Paid Vacation & Holidays, and vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN, and Ocean Isle Beach, NC. CAREERS.RLC.COM Earn up to $32.65/hr. Learn more", "grouping_count": 0}, {"id": 1965623280496368, "advertiser_name": "R+L Carriers", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT0tlBRTnSvG6Sj6nId8vuCTikYBojwwrIXrqf19SAxlUv1do6UjP2FyW_IottiTgtHRPOHJKrZ_LG_b1ksMJmVwkxiY9neCAT2wxZJjCG17gVO8gGYYMD68dPeCZ7KqI5AG858QTkdv6cgMvD9j8uNVcO8"], "image_save_path": ["1965623280496368_00.jpg"], "ad_text": "R+L Carriers Sponsored Diesel Mechanics - Rock Rapids, IA Full-Time, Monday-Friday, Various Shifts R+L Carriers has an immediate opportunity for Diesel Tractor Mechanics at our service center. Responsible for day-to-day equipment maintenance on the fleet equipment consisting of preventative maintenance and minor to major repairs to Class A Trucks, trailers, and forklifts. Diesel engine experience is required. Experience in maintaining trailers, overhead doors, lift gates, dollies, welding, and working on forklifts is preferred. Requirements / Qualifications: 2+ years of Diesel Mechanic experience preferred Experience in preventive maintenance of Cummins & Detroit engines Experience with AC and Electrical Must be able to handle major repairs Experience in Tractor PMs and repairs Have the ability to lift 50lbs Must have own tools Excellent Benefits R+L Carriers offers an excellent compensation and comprehensive benefits package, including Medical/Dental/Vision Insurance, 401(k) Retirement Plan with matching contributions, Paid Vacation & Holidays, and vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN, and Ocean Isle Beach, NC. CAREERS.RLC.COM Earn up to $35.53/hr. Learn more", "grouping_count": 0}, {"id": 1351771535624244, "advertiser_name": "R+L Carriers", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT0tlBRTnSvG6Sj6nId8vuCTikYBojwwrIXrqf19SAxlUv1do6UjP2FyW_IottiTgtHRPOHJKrZ_LG_b1ksMJmVwkxiY9neCAT2wxZJjCG17gVO8gGYYMD68dPeCZ7KqI5AG858QTkdv6cgMvD9j8uNVcO8"], "image_save_path": ["1351771535624244_00.jpg"], "ad_text": "R+L Carriers Sponsored Operations Manager - South Windsor, CT Full-Time, M-F, 9pm-7am *hours may vary depending on terminal needs* R+L Carriers has immediate need for a Operations Manager to plan, organize, manage, and direct service center operations at our Service Center. This person oversees and is directly involved in all phases of the service center operation including, but not limited to, customer service, customer interaction, and operations. Responsibilities include: Front-line Supervisors, Driver, and Freight Handler Management Lead, educate, and develop employees Maintaining staffing levels for Dock, Linehaul, and City operations Prepare and implement action plans to ensure planned productivity and service goals are met Prepare and manage safety, security, and loss prevention procedures in accordance with Company, OSHA, and DOT guidelines. Responsible for ensuring clean and safe working condition of the facility and equipment Ensure quality freight handling procedures are followed Interpret, implement, and enforce Service Center Work Instructions and Company policies. Ensure the timely dispatching of LTL Loads Other duties as assigned by the Service Center Manager Requirements: Candidates must have proven leadership experience. Must have the ability to lead in a fast paced environment. Strong Organizational / Communication / and Logistical skills with solid problem solving abilities. Thorough knowledge of LTL Industry, DOT Rules and Regulations, OSHA Laws, Hazardous Materials Regulations, NMFC and Tariff Rules, and common LTL best practices, preferred. Knowledge of all aspects of ensuring quality freight handling techniques preferred. Must have computer skills, and be proficient with Microsoft Office products. Knowledge of the City, and surrounding areas Preferred candidates will have: Operations management experience in the LTL industry is STRONGLY preferred Excellent Benefits R+L Carriers offers an excellent compensation and comprehensive benefits package, including Medical/Dental/Vision Insurance, 401(k) Retirement Plan with matching contributions, Paid Vacation & Holidays, and vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN and Ocean Isle Beach, NC. CAREERS.RLC.COM $65,000 - $70,000/yr. - South Windsor, CT Learn more", "grouping_count": 0}, {"id": 551160166921544, "advertiser_name": "R+L Carriers", "status": "Active", "date": "01/16/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT0tlBRTnSvG6Sj6nId8vuCTikYBojwwrIXrqf19SAxlUv1do6UjP2FyW_IottiTgtHRPOHJKrZ_LG_b1ksMJmVwkxiY9neCAT2wxZJjCG17gVO8gGYYMD68dPeCZ7KqI5AG858QTkdv6cgMvD9j8uNVcO8"], "image_save_path": ["551160166921544_00.jpg"], "ad_text": "R+L Carriers Sponsored Router Supervisor - Troy, NY Full-Time, Monday-Friday, 11 p.m.- 11 a.m. R+L Carriers has an immediate need for Router Supervisors to manage dock and dispatch operations. Requirements / Qualifications: Driver and Freight Handler Management Coordinate Dock Operation and Driver/Freight Handler scheduling Ensure Safety Compliance Ensure quality freight handling procedures are followed Timely dispatching of LTL Loads Other duties as assigned by the Service Center Manager Candidates must have proven basic leadership experience. Must have the ability to lead in a fast-paced environment. Strong Organizational / Communication/ and Logistical skills with solid problem-solving abilities. Knowledge of quality freight handling preferred. Must have computer skills, and be proficient with Microsoft Office products. Knowledge of the City, and surrounding areas Prior LTL leadership experience is strongly preferred. Excellent Benefits R+L Carriers offers an excellent compensation and comprehensive benefits package, including Medical/Dental/Vision Insurance, 401(k) Retirement Plan with matching contributions, Paid Vacation & Holidays, and vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN and Ocean Isle Beach, NC. CAREERS.RLC.COM $65,000 - $70,000/yr. - Troy, NY Learn more", "grouping_count": 0}, {"id": 844516492935128, "advertiser_name": "R+L Carriers", "status": "Active", "date": "08/24/2021", "ad_url": [], "image_save_path": [], "ad_text": "R+L Carriers Sponsored Immediate opportunities for Local CDL Drivers nationwide. We offer excellent compensation and a complete benefits package including vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN, and Ocean Isle Beach, NC. Great Benefits Including Our Employee Resorts Learn more", "grouping_count": 0}, {"id": 148419870702226, "advertiser_name": "R+L Carriers", "status": "Active", "date": "08/24/2021", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT0tlBRTnSvG6Sj6nId8vuCTikYBojwwrIXrqf19SAxlUv1do6UjP2FyW_IottiTgtHRPOHJKrZ_LG_b1ksMJmVwkxiY9neCAT2wxZJjCG17gVO8gGYYMD68dPeCZ7KqI5AG858QTkdv6cgMvD9j8uNVcO8"], "image_save_path": [], "ad_text": "R+L Carriers Sponsored Immediate opportunities for Forklift Operators nationwide. We offer excellent compensation and a complete benefits package to our full-time employees, including vacation lodging at our exclusive employee resorts in Daytona Beach, FL, Big Bear Lake, CA, Pigeon Forge, TN, and Ocean Isle Beach, N.C. CAREERS.RLC.COM Experience the Difference with R+L Carriers Learn More", "grouping_count": 0}, {"id": 865680127712912, "advertiser_name": "R+L Carriers", "status": "Active", "date": "06/28/2021", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT0tlBRTnSvG6Sj6nId8vuCTikYBojwwrIXrqf19SAxlUv1do6UjP2FyW_IottiTgtHRPOHJKrZ_LG_b1ksMJmVwkxiY9neCAT2wxZJjCG17gVO8gGYYMD68dPeCZ7KqI5AG858QTkdv6cgMvD9j8uNVcO8"], "image_save_path": ["865680127712912_00.jpg"], "ad_text": "R+L Carriers Sponsored R+L Carriers has immediate openings for CDL A Team Truck Drivers - AVERAGE OVER $2000 PER WEEK EACH DRIVER! FB.ME Our Team Drivers Average Over $2,000 per Week Each Driver! Learn more", "grouping_count": 0}]