[{"id": 588621079735914, "advertiser_name": "Eskenazi Health", "status": "Active", "date": "01/20/2023", "ad_url": ["https://www.facebook.com/events/582550296539321/"], "image_save_path": ["588621079735914_00.jpg"], "ad_text": "Eskenazi Health Sponsored Sandra Eskenazi Mental Health Center invites mental health professionals to attend our virtual educational speaker series on Feb. 9 from 4 – 5 p.m. Interested participants can text “CEU” to 317.597.8069 to RSVP. You will receive a Webex invite via email to access the event. The presentation will be led by Chelsea Haring-Cozzi, Ph.D., executive director of the Coalition for Homelessness Intervention and Prevention, providing an overview of its services and advocacy efforts for those experiencing homelessness. The Coalition for Homelessness Intervention and Prevention (CHIP) is an Indianapolis-based organization dedicated to uniting the Indianapolis community around the belief that housing is a human right and that everyone has the right to be housed and connected to care. CHIP works to advance equitable systems that expand housing choices and enhance supportive services through a collaborative and coordinated approach. Please join this series to learn more about the state of homelessness, solutions and how community partners are coming together to address this complex issue. Sandra Eskenazi Mental Health Center’s monthly speaker series is free to attend and will be hosted virtually on Webex. Eligible participants (LMHC, LMFT and LCSW) have the opportunity to earn CEUs by attending the presentation. Thu, Feb 9, 2023 Virtual Educational Speaker Series | Coalition for Homelessness Intervention and Prevention Virtual Educational Speaker Series | Coalition for Homelessness Intervention and Prevention INTERESTED", "grouping_count": 0}, {"id": 586951849939158, "advertiser_name": "Eskenazi Health", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fapp.brazenconnect.com%2Fevents%2F6xVO3%3Futm_medium%3DSocial%26utm_source%3DFacebook%26utm_campaign%3DFEB%2BNURSING%2BEVENT&h=AT0zdolvcE_JaTOo9Mu3lbK8za_FZIBfckOg8X1sUK-a34_6Xy0YNwglBk0rduhAdlZH4T3FDHBj5rt9YyYOBgCL1m-lc7DtUo3ypoRxwVIVjKy1vjZ6F23LeRCcPNt0CHIDOE1jxwNtCmptlHgI80ynvcQTylmj0j8NevEzqgE", "https://www.facebook.com/events/1173871123513894/"], "image_save_path": ["586951849939158_00.jpg"], "ad_text": "Eskenazi Health Sponsored Join Eskenazi Health for a career fair for new and experienced registered nurses on Wednesday, Feb.8, 2023 from 3 to 6 p.m. at Sidney & Lois Eskenazi Hospital in Downtown Indianapolis. Event attendees will have an opportunity to speak directly with hiring managers from multiple departments, participate in on-site interviews, and learn about the unmatched culture, stability and benefits Eskenazi Health has to offer. To register, please visit: https://app.brazenconnect.com/events/6xVO3?utm_medium=Social&utm_source=Facebook&utm_campaign=FEB+NURSING+EVENT Wed, Feb 8, 2023 Eskenazi Health Nursing Career Fair Sidney and Lois Eskenazi Hospital Eskenazi Health Nursing Career Fair INTERESTED", "grouping_count": 0}, {"id": 583544533110990, "advertiser_name": "Eskenazi Health", "status": "Active", "date": "01/11/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.eskenazihealth.edu%2Fcareers&h=AT3KRt623djNCeCzMJzMuCCHoH1KtnEy_HZZsbW314m7Wg6DiGWJ1reV-8dJ8u_uHMhkdxDVVPOtxtTg3a0vC7fpDsj0RDWJzN_LIHNw-kbfG37V22PbfI2vbkl5lf42ZoUF0parkeWWrXI9DVSq8suNRYKEFCnueNpLq1Dw6k8"], "image_save_path": ["583544533110990_00.jpg"], "ad_text": "Eskenazi Health Sponsored Eskenazi Health is hiring for many positions! Apply to join one of America’s largest and most trusted essential health care systems today. ESKENAZIHEALTH.EDU Now Hiring – Competitive Pay & Benefits Careers at Eskenazi Health Learn more", "grouping_count": 0}]