[{"id": 3336846926553944, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FMedicalAssistantVHE&h=AT1OTGmI2UwyeezpXrRnRr6NyrNN5P3TtL6tgYRTlIHMLKx5lDcfUXfQ9B8mACG9DoTlNr85HlGEKWPQg5VZk-VyWY3XzBoDXLDgCboKrCLku3JqhoPgMVOFuXFo9xyZD2BUPs1l-mkOlnkTDoqxNag1Mz4BWnNhYacS7BqVTzk", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FMedicalAssistantVHE&h=AT3yUBWFBBAcmU9jqv9kJCX_Ha5BwemU-Q2hDBVRAb1v6EHHzX-CIPFehNSCaTUAaA_77hVwMSkmGf-mImf9QngqvJmJtkLrlhio8hYybs6tpQHKJ820odvzGX5fIfZg7vhg2aYIuUvuvY90EMD1dlmblRyvSVrOmd05WtkbV1U", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT0JKvIQnaxocR3xkHaVLOLZwy0IfoQlyeNns6Xp5Gx0p5DkoLkpGUzKjXxty2ExnnoNZHj47qbm8GOgPKbsVx88qHjB33AQD7iUFoUkvyLXKyiJ5woxLTcj4hpi5ohpp1zNgx_OfvF-QNR-1GDbihfq5RANTTufsFpS8ZRAVnQ", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.manpowermi.com%2F&h=AT25OtjDSZkgHlsA1zXiLvOQqC6HhTWNZs8o6quWE9XAnkxBbBs5T0HfFhy6W8H7Upj5poc08KV9eb4qhjWjIzP9aFKeYzZMH3IgoyZeyGcQoG4Gr45y0IK8sf8e8FhB9t_oFJ87Y4TQP5VwPQAMMiRxVUTBL13sX2ieessjcvI", "https://www.facebook.com/events/1371665776933514/"], "image_save_path": ["3336846926553944_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Calling all Medical Assistants! Did you just complete a Medical Assistant program? Are you currently working but looking for a new opportunity? Do you have prior patient care experience and looking to re-enter the workforce? We have a job for you! Our clients in Ann Arbor are currently seeking caring and compassionate individuals to work as Medical Assistants! A variety of clinics and specialties are available. Sign up today to attend one of our virtual hiring events at https://www.signupgenius.com/go/MedicalAssistantVHE . Job Location: Ann Arbor, MI Compensation: Up to $16.00 to 18.00 per hour (varies by job) – WEEKLY PAY! What’s In It For You: Flexible scheduling, day shift openings, great opportunity to apply your clinical patient care skills, training, and experience! What You’ll Be Doing: Assisting with patient flow, charting, obtaining patient health history and vitals, performing prescription refill requests, assisting with specialty procedures, contacting patients. Here’s What You Need To Apply: HS Diploma/GED; some positions require a MA Certificate; successfully pass a drug screen and criminal background check; perform essential physical functions (including standing, walking, pulling, squatting, bending, reaching, and lifting up to 50 pounds); comply with our client's immunization requirements including but not limited to a COVID-19 and annual flu vaccine; maintain HIPAA privacy. Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/MedicalAssistantVHE . For immediate consideration, you can also call734-665-3757. Know of others looking for work? Share this job with friends and family and take advantage of our referral bonus program! To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. To learn more about us, visit www.manpowermi.com. Wed, Feb 1, 2023 Medical Assistants - February Virtual Hiring Events Medical Assistants - February Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 1248947662652620, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fpatientattendant_hiring_event&h=AT20Ajc3FITdkPbEiaYbihicGgANuYqJ6-juCG4b27C1fQy732kXZ2qgCNjKBskhXX-p_pdrSk-jkoOIowvwhpeLs20WmBFLFMW3B1CGP7cylL-iNf54ebgcxNBoXmfYT7fTwxiaXMWVfaQaLaP7QRXGZUTEOrwFwLHp2NrTbTQ", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fpatientattendant_hiring_event&h=AT1Kop0adCmDvpvtPCcKHoM6Cr-sL3CdZg9YyzaSd-MwlJDRPki23Sr-ehv8WTNZaXIGqLD37mTLMfvOPxEviam6ZKFUrcpHBPqsPh2INkzxctN68fEfj7fTLotoTo9PW_Twn8nrYLMirHZ1IeQ09t3fG0oZWULKO3hlGMFCLWk", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT0hQHvHixOFAYw2ZM0y1WYLRQa9I7cncDAaSgtkpfzZ0WVsKDMgPg1DCweDMd2kUjI6CNREELoQkkHbgFZeXqnM7HB3RedMzA_bzGhXxK98FvVhDV_a9UOwXUC8U3XoMSvxM4X1UCnqL_uWKcQd-5cnxMZ6rkETSNdg71UjMsg", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.manpowermi.com%2F&h=AT053au-LULvfSGxNNIQHadmuvPQgHZFr-bE1lyx-iF3PHlaNA0sI63lskOj2bXO5-7d89M_UyBb2JJIEx3_daIBxt-zcummkctMf0PSHQm95G_LHCuGXW4xrpFaNRu42ifO3x1InxXtWzs580rBNaiRkIHHG6Evu63oZ0e5BrE", "https://www.facebook.com/events/3475311802702306/"], "image_save_path": ["1248947662652620_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Do you have a passion to help and care for others? We NEED you! Our client, Michigan Medicine, in Ann Arbor is currently seeking caring and compassionate individuals to work as Patient Attendants! Sign up today to attend one of our virtual hiring events at https://www.signupgenius.com/go/patientattendant_hiring_event . Job Location: Michigan Medicine (University of Michigan Hospital) in downtown Ann Arbor Compensation: Up to $19.50 per hour (depending on shift) – WEEKLY PAY! What’s In It For You: Flexible scheduling, part- or full-time, multiple shifts, great opportunity to gain valuable skills in a health care setting or put your existing patient care skills to work, build networking opportunities with a top-ranked medical center. What You’ll Be Doing: Providing care and safety to patients through alert observation, communicating and interacting with patients, accompanying patients to test and procedures as needed, assisting nursing and hospital staff with various duties and activities. Here’s What You Need To Apply: Successfully pass a drug screen and criminal background check, perform essential physical functions (including standing, walking, pulling, squatting, bending, reaching, and lifting up to 50 pounds), comply with Michigan Medicines’ immunization requirements including but not limited to a COVID-19 and annual flu vaccine, maintain HIPAA privacy. Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/patientattendant_hiring_event . For immediate consideration, you can also call 734-665-3757. Know of others looking for work? Share this job with friends and family and take advantage of our referral bonus program! To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. To learn more about us, visit www.manpowermi.com. Wed, Feb 1, 2023 Patient Attendant - February Virtual Hiring Events Patient Attendant - February Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 1341950449931145, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FDCW_virtualhiringevent&h=AT29GibuCjKhUvIwlvav6QsbHbgDNrh5FU5ffzw9PhTbHLcw1dk7olzwwgaTT2_YzQLl7w7AgfJChqoKUrn37PaT7CyAsISWbLNquCW7jdiTvClBVa_3wy6OP2NRkxZpECi-ED88wffOClJBtEKhlno6qBMQQ2izPEzPMD9Vtl4", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FDCW_virtualhiringevent&h=AT1d43VCkS8TNmB1VgT2LzOxDznglooi7NHH57L7wxSsNCpe6a7QWvZNQoxjmxqzpl0YegGMLorH2tOTjGYS8Z8rfU-hSFkRCkVA-q0etKrb4H9vnx7PGbbBA5zDn-9X1QrXcwLVt-m3NWedZ0q9qfMjmCcROZaCHhaNgZLlsrw", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT2MC4LbYSRntHXTAwlDnply5bsRUB3_VCObX1ldgK0Nd1LHj6r9xtXiqVyNV90fYFkw1dcS3CEa1YI68PXFCEfe6lcLpkThw_jjaFOLQz76GHOCUtwYL9HqteDaefm1CQQ0uI9deeFvOl4-74dIIebogq712jqs6oI0ZN9S_Sw", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.manpowermi.com%2F&h=AT1Qgv1uqMX3LfeOwQGAfjVIHVgBFUt77PI7tQa4s324voJruInsHBzr2k0tY4yKzMdur0_zlPRJSZ6v8snfG-4jiSci0wJqvSE1aMXBUrcKp6MPLwocizcnEI11OiLikx33LLY2nMko2skjK_LIQYxkUIGxW6qUy6kkYQtLfC8", "https://www.facebook.com/events/3546301435690905/"], "image_save_path": ["1341950449931145_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Do you want to make a difference in the lives of others? We're currently seeking Direct Care Workers for our local client with locations in Ann Arbor and Manchester. Sign up today to attend one of our virtual hiring events at https://www.signupgenius.com/go/DCW_virtualhiringevent . Job Locations: in Ann Arbor (near Briarwood Mall) and in Manchester (off M-52, between Chelsea and Manchester) Compensation: $18.00 to 21.00 per hour (depending on experience) – WEEKLY PAY! What’s In It For You: Flexible scheduling - day, afternoon, or midnight shifts; great training program and benefits upon hire; opportunity to give back to your local community while earning a competitive pay! What You’ll Be Doing: Assisting residents with activities of daily living and key tasks such as walking, feeding, bathing, housekeeping, shopping, and meal prep. Some light administrative and data entry responsibilities as well. Here’s What You Need To Apply: HS Diploma or GED; excellent verbal and written communication skills; successfully pass a drug screen and criminal background check; dependability and flexibility; basic data entry skills; ability to meet immunization requirements including a valid TB test. Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/DCW_virtualhiringevent . For immediate consideration, you can also call 734-665-3757. Know of others looking for work? Share this job with friends and family and take advantage of our referral bonus program! To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. To learn more about us, visit www.manpowermi.com. Wed, Feb 1, 2023 Direct Care Workers - February Virtual Hiring Events Direct Care Workers - February Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 1284729422384651, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FYanfeng_VirtualHiringEvent&h=AT1W0EkioySA-DN_g6VyEf5239O5xw9wPT0_5ZE8uqd3jDIThzf6DkwgnnkSlZMkOn8TPUVoxS-bEzg866Xfkq6iLMED8wyc5s3WyaaJdM4zheu1DBvfAjQk6aQv2n2Fgu3K7dsEzounDNgzf0vc_rcUQwpDsO6kJTJYpE5nXK4", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FYanfeng_VirtualHiringEvent&h=AT2E3R6hYp-dLCPO1u0hBRFazJSHWCIvNKe6hYayAzn0WPsvzD1cO0YiGg4S30SaGbclYg5eSwxYqt0AloANXdYx70wUSnv_vTxtxL4fnwzBpbKi3n17HCZe1We4lZ79m4KTUcxH2qc5EExOY6vY8WzpAlR_J-aQkoIPAHCEnUI", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT3gPWCchvteKLF9tjVylxeEo6kaRjqmZMDPljTPCQRnSy4Bh-rDkjUY37twHD9qFoWZnX-6MPb_Zx8J5pzDmw9BBdX-bTlVRthLFk6vF1L5DsgCyfCU5z1Mt2mwol46dz557pXUDs3MQO4FvBlHDB-JH1GjgRphzq57j5jtfMI", "https://www.facebook.com/events/1188051705432617/"], "image_save_path": ["1284729422384651_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Manpower is hiring Production Workers for a premier union facility, Yanfeng, in Monroe! Sign up today to attend one of our virtual hiring events. Go to: https://www.signupgenius.com/go/Yanfeng_VirtualHiringEvent . Job Location: Yanfeng in Monroe, MI (Frenchtown Center Drive) Compensation: up to $16.45 per hour – WEEKLY PAY! What’s In It For You: Many shifts/schedules available to choose from; quick turnaround, starting work within days of interview; sign on bonuses and enhanced benefits upon hire. What You’ll Be Doing: Operating machines, visually inspecting parts, producing automotive components. Here’s What You Need To Apply: A HS diploma/GED; comfortable lifting up to 50 lbs; successfully pass drug screen and criminal background check. Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, unlimited $100 referral bonuses for each successful referral, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/Yanfeng_VirtualHiringEvent . For immediate consideration, you can also call 734-665-3757. To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Know of others looking for work? Share this job with friends and family and earn dollars for every successful hire. Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. Thu, Feb 2, 2023 Yanfeng - February Virtual Hiring Events Yanfeng - February Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 6148138858549668, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FGestamp_Virtual_Hiring_Event&h=AT3p7WxVijGlJv9q06KmMgK_wWC9GPpOAcISYOA61oedu47oWUiOR6IbrM2laUWZa5NhqkkXdLPU7vc7azL0qTxqQhMZ3u9KmyOwliVuga2Oht7C1E1BH8xrWpLVRqJp-jsyU8cXOWI_T6s_TcaXwW7zOzN51km1D2iigf-UH-s", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FGestamp_Virtual_Hiring_Event&h=AT2Qidn0UUrt9W2FyUYCOF46C_mhYY5oudKfJQrMlq6-VqO4OJNm9oYrlupEVJOj92xXamd6I-yNQFClUWkMknXlz1EikbDKL4Gt0uHp2zRHD6sy4-PquWXC_s5HxLs9oY0m942vt201U-JuGxoJvZSerqcboqW4hSn7l6ecv4E", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT1s83S4hxHmE6UDpzTyJ7xNU-jXAA5C9momzX53ZvonKPPc0WmnHipYUiCX6XX2wbeW9Lg77j_xEOrfHG8vwVR-ES7pzvGhsQ0VPjxXiUUqmguA54Xb07BBnb9afRTsv2LzQYWct3yW50nW8BX18R3JgM9DS2oVQ55VluZcPZs", "https://www.facebook.com/events/913821669805980/"], "image_save_path": ["6148138858549668_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Are you in the Western Washtenaw County area and need work immediately? We have a job for you! Our client in Chelsea, Gestamp, is currently seeking hardworking and detail-oriented individuals to work as Production Operators! Sign up today to attend one of our virtual hiring events. Go to: https://www.signupgenius.com/go/Gestamp_Virtual_Hiring_Event . Job Location: Gestamp in Chelsea, MI, just off M-52/Main St near downtown Compensation: $16.00-17.00 per hour – WEEKLY PAY! What’s In It For You: Many shifts/schedules available to choose from; quick turnaround, starting work within days of interview; sign on bonuses and enhanced benefits upon hire. What You’ll Be Doing: Operating machines, visually inspecting parts, producing automotive components. Here’s What You Need To Apply: A HS diploma/GED; comfortable lifting up to 50 lbs; ability to stand for long periods of time. Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, unlimited $100 referral bonuses for each successful referral, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/Gestamp_Virtual_Hiring_Event . For immediate consideration, you can also call 734-665-3757. To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Know of others looking for work? Share this job with friends and family and earn dollars for every successful hire. Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. Fri, Feb 3, 2023 Gestamp - February Virtual Hiring Events Gestamp - February Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 5614319692013399, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fiuc_hiring_event&h=AT0dXcwUCnyvIbdj9t5EKmlSMeGdycmv5TwbYY4Sxh2wNrYfjAOTYZsOQTyAATsiHvNVHPVnzZ8wytg7qrTBnPMKemeIodr7asScFolpldbrnER9lpzb35yeXBDhx_9jYfZmkr-61xzsS9wbIF3zfS1Q-rqvmoXzyi2Q0YsZV5A", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fiuc_hiring_event&h=AT16yCe7mH_MDMq1xizS2ad5Y0PPv9LVhkLa_berJzWpGq6LGaeLzsqUoon9WTp8OnTtlKrOor_54KVzEw4e16l3Qvuj0Dn22VegPxwXsFF6XCKmrr9NW4XVTllfd1dVX5KRttegt3J8xFUOh-XJSwwhe9fLPo3pgKS0FRYWtIA", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT0wtQ5wvtbFjob2xV9mXeW72F2rVPhVNFyt_5p2MprWUG-wBxWJ4fAxCMyY5_EPlXDiBrUYuFWHKnOq5dXJvkBFguafLMiO-cfxnEYtLYYYSr-D_e38q9CNlaEYPnXO44LgwhyM9K5ol1lrqVWRsyePiBkZZMQwBhaMilSUIUo", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.manpowermi.com%2F&h=AT038r9V1ANJu-cTfgQzrn5ZZb_s-ZLGsjJzn-SMSr_8kR6HX6Z0Ae-xz7Lnk4pSemVCgin-6BckDgszEZWH6DW9QcrTp7HaGCMuFvJnlgHpETYyEvbKd9-rSSNyscxfXajGXtfdi0NTLJDwalD83UyukjcYuYNgeEqDPipLk_Q", "https://www.facebook.com/events/6069164349801967/"], "image_save_path": ["5614319692013399_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Are you an administrative superstar with stellar customer service skills? Do you enjoy working in a health care setting? Then look no further, we have a job for you! Our client, Michigan Medicine, in Ann Arbor is currently seeking customer service and medical office individuals to work as Inpatient Unit Clerks! Sign up today to attend one of our virtual hiring events. Go to: https://www.signupgenius.com/go/iuc_hiring_event . Job Location: Michigan Medicine (University of Michigan Hospital) in downtown Ann Arbor Compensation: $15.00-17.00 per hour depending on shift – WEEKLY PAY! What’s In It For You: Flexible scheduling, part- or full-time, multiple shifts, great opportunity to gain experience with a premier health care organization. What You’ll Be Doing: Assisting on a variety of patient units, performing front desk duties in a hospital setting, working with patients and clinical staff including nurses and doctors to handle clerical needs of the unit. Here’s What You Need To Apply: A HS diploma, at least 6 months of consecutive work experience in prior position(s), at least 6 months of customer service experience, ability to work holidays and every other weekend, ability to comply with Michigan Medicine’s immunization requirements including but not limited to a COVID-19 and annual flu vaccine. A strong work history is a major requirement to be considered for this role. Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/iuc_hiring_event . For immediate consideration, you can also call 734-665-3757. To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Know of others looking for work? Share this job with friends and family and earn unlimited $100 bonuses for every successful hire. Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. To learn more about us, visit www.manpowermi.com. Mon, Feb 6, 2023 Inpatient Unit Clerk - February Virtual Hiring Events Inpatient Unit Clerk - February Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 1220655918864923, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fcustodian_virtual_hiring_event&h=AT15xnCZ4Bmxhn5pBao6Rj-Ofyg2ribjaAieHq0olYdVhQaImF4x0c8PsKNfqeiVNZOPS7_D62YhLtHX1mtBe3oAQyJ9dcuAioUna8NCi5Fuk-_QR5PJcTcPKt-dPtlJNNkMJ67d68bieXGMgSlMMrmA0NhRoCWhT8hr7YOmpxQ", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fcustodian_virtual_hiring_event&h=AT2OV957A6tgZ1yw-4dJeSIZIByPdA6F2fuO60F1Ir-2SzK4lxsP57x3VFLglVjcx8OHi5M4vtzxY76nAc6uhM0m0vO0pydjijZmGfNdVU1MVZK5IgO-56cv0fHSEA9-4mTGKrGUrcbuobH1Ye45pJlFwtTOD9Pmn2jNRXGmkMs", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT1iq_fhz3nK0gM4ngz4mXrZnxiag8vZSXWS-8g7qCVZr1brR3ETD5F3fEPwwjDP4H6AMLKI_6KV09h914p1YyfrcUFFjwQT-mu1ryWbanBH6HvYbXdndN6it780Ogu1fWCSdAOQpoSjeEL-GIj2VeVvr60HD487h9N7_fZsjA4", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.manpowermi.com%2F&h=AT2I4wrYM0a1WBUXWN1aJPUnGjv9TNXvcQM9UIEZm7bP5FV6I7tzqrFf0LfnERV7_YzBfVol-RIuD58ssIgZAyajQUgvEWeqk3cNobZ1qaeX-B1OUch3bKzHhvxMjO0qNAMUefevfsGnR_x1UfzFuWq6suaIPDGh12KrjZZBvdM", "https://www.facebook.com/events/540974251313839/"], "image_save_path": ["1220655918864923_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Our client, Michigan Medicine, in Ann Arbor is currently seeking team players to work as Custodians! Sign up today to attend one of our virtual hiring events. Go to: https://www.signupgenius.com/go/custodian_virtual_hiring_event Job Location: Michigan Medicine (U-M Hospital) in Ann Arbor Compensation: $18.00 per hour – WEEKLY PAY! What’s In It For You: Full-time hours, openings on multiple shifts, opportunity for advancement and direct hire, build networking opportunities with a premier health care facility. What You’ll Be Doing: Cleaning patient rooms and bathrooms, cleaning common areas, vacuuming/sweeping/mopping floors and stairways, emptying trash. Here’s What You Need To Apply: Successfully pass a drug screen and criminal background check, a HS diploma, perform essential physical functions (including standing, walking, pulling, squatting, bending, reaching, and lifting up to 50 pounds), ability to comply with the University of Michigan's immunization requirements including but not limited to a COVID-19 and annual flu vaccine. Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight (8) paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, unlimited $100 referral bonuses for each successful referral, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/custodian_virtual_hiring_event . For immediate consideration, you can also call 734-665-3757. To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Know of others looking for work? Share this job with friends and family and earn dollars for every successful hire. Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. To learn more about us, visit www.manpowermi.com. Tue, Feb 7, 2023 Custodian - February Virtual Hiring Events Custodian - February Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 849666972799172, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fumdining&h=AT24dJoUpnCYZcU4kNaHWYm4UcnIrebN_QLoV1n1OP8nypOk29PzFMol_HItnAIUw9m38k7QJygJBnKsEVRIC0uBPeFifNnYRDiusxjRKOyRK32Eh9l0BH6r7dGvlcqHTw_0mwmn6y5c7JFVc_2RQk9cV4XY2DR-Eu4doTcufWo", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fumdining&h=AT16vTjFw5V9fZSelxUcHNsRIXwBohD7kb7fhYC_M7t7GonOmv8z-KU2_qiFU8ydVVPwX_JA6CalHX_t94uCI9hs6iI_v5ROgGskLrpYL06rI3G8qoNcOO2X3mXLdWacHd0GuS04fIhXXqh6d_1xHISJo6lXqxWlZN8xOye-DPw", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT2mmtVDd2yOxaCnuJOFhBjhtVytD8PcXPXK1CwzSYBG9EUmIc7sxpF_ScmObvwGhOGznGkH5ReW7RKws1QkRhGnftDbGKp8Jblk4aT68K_MsJYIL_QPMRGPibgWyp0WCtxpvavPGzo3CXzxEbHzjHxhxCml57JWvdf69Unl5hA", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.manpowermi.com%2F&h=AT0-zYg8ILMTIVnKbXOsObtpQBKD44J_5k7NsE7s8Jfk6ZB7EGnfxL6vS5L0dBSXMaY5IKod84kMzNCA6AxO3StBU__zL9i6cxWcidoujwFsFMyl0sBoFXvSNbBfCW1gX7zeHQtyMIireO4XqKTSa8-46qBxCAgTUZK7pJET568", "https://www.facebook.com/events/714792050252340/"], "image_save_path": ["849666972799172_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Check out this opportunity to work at the University of Michigan! We're seeking foodservice staff to join the Michigan Dining team on the campus of U-M in Ann Arbor. Sign up today to attend one of our virtual hiring events. Go to: https://www.signupgenius.com/go/umdining . Job Location: The University of Michigan Campus in Ann Arbor Compensation: $18.00 per hour – WEEKLY PAY! What’s In It For You: Flexible scheduling, both part- and full-time positions, build networking opportunities with a premier employer, gain fundamental customer service skills and culinary experience. Plus... competitive pay ($18.00 per hour), weekly paychecks, free meals (3-hour shift minimum), parking reimbursement, and discounts on public transit! What You’ll Be Doing: Serving food to residents/guests, helping with kitchen cleanup including dishwashing, and/or preparing/cooking food. No experience needed! Here’s What You Need To Apply: Successfully pass a drug screen and criminal background check, a high school diploma/GED, perform essential physical functions (including standing, walking, pulling, squatting, bending, reaching, and lifting up to 50 pounds), ability to comply with the University of Michigan's immunization requirements including but not limited to a COVID-19 vaccine/booster (if applicable). Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, unlimited referral bonuses for each successful referral, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/umdining . For immediate consideration, you can also call 734-665-3757. To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Know of others looking for work? Share this job with friends and family and earn dollars for every successful hire. Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. To learn more about us, visit www.manpowermi.com. Tue, Feb 7, 2023 Michigan Dining - February Virtual Hiring Events Michigan Dining - February Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 538200244938873, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FDCW_virtualhiringevent&h=AT3Yj144WL0DBZNwYTx-sVAwFqQPp8E7J1a0wdPqENQufOLRFiZQN3clio7xPcjYOIJ0alpvapI-mkLTjkFIK4_Xgc4OOUNVM5NsMCYPmzqtX82MIPMxSM6wHJDAU5eSLHob4Hp5KlrMbtiqN6A8DIp0htWf2iqZpXO4Ujse3AU", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2FDCW_virtualhiringevent&h=AT3r2YM_XyGHqW96aD3XPO6BrNxbJjTlcUwHIcw_OGQmUQNP0544rs-UBla9yzOoquth0iYWl1kvgSrbHOOkXDiz2OTdMea_FMVpDhZvdEabdqxVnxrHGoVmPHBKU9gJEzaP_0yVvHGncLZNX291E03QJGBVbNcHUayWo-4p4mU", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT2quy8SMlLthQEd3cNG_Qe_ocHKAkMvJ2Yrm6r-HYCwOtVvPsWiuWamqKpTirZnDUuoxR3NaXHU_sXRZD4IWH8waLBbGdLOorWws8A_ZWddJFv43A00U6YrdpIkhoioGSeYCo_KEalMjqW4ZqJWqsEUHRdePSKpsD-MaiNrTME", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.manpowermi.com%2F&h=AT1dbx8QS3q52tDkWsyVD3kOHKYCTNTbisvyfLVqFJ0CmuilKkhCGcApDG3AqfvdPLbbFe0AiRO_x-KEHXlnLfki-jDnGhXQu8jQ7sKBR7zHTYHUOtKp1rviLtjxn4eE_XMIhldyfjTMs1kb0cJ9CaGGSpwjF72TaXZduYpGB7U", "https://www.facebook.com/events/1189354738432194/"], "image_save_path": ["538200244938873_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Do you want to make a difference in the lives of others? We're currently seeking Direct Care Workers for our local client with locations in Ann Arbor and Manchester. Sign up today to attend one of our virtual hiring events at https://www.signupgenius.com/go/DCW_virtualhiringevent . Job Locations: in Ann Arbor (near Briarwood Mall) and in Manchester (off M-52, between Chelsea and Manchester) Compensation: $17.00 to 18.00 per hour (depending on experience) – WEEKLY PAY! What’s In It For You: Flexible scheduling - day, afternoon, or midnight shifts; great training program and benefits upon hire; opportunity to give back to your local community while earning a competitive pay! What You’ll Be Doing: Assisting residents with activities of daily living and key tasks such as walking, feeding, bathing, housekeeping, shopping, and meal prep. Some light administrative and data entry responsibilities as well. Here’s What You Need To Apply: HS Diploma or GED; excellent verbal and written communication skills; successfully pass a drug screen and criminal background check; dependability and flexibility; basic data entry skills; ability to meet immunization requirements including a valid TB test. Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/DCW_virtualhiringevent . For immediate consideration, you can also call or text “EISENHOWER” to 734-665-3757. Know of others looking for work? Share this job with friends and family and take advantage of our referral bonus program! To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. To learn more about us, visit www.manpowermi.com. Tue, Jan 24, 2023 Direct Care Workers - January Virtual Hiring Events Direct Care Workers - January Virtual Hiring Events INTERESTED", "grouping_count": 0}, {"id": 6113488992027994, "advertiser_name": "Manpower, Inc. of SE Michigan", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fumdining&h=AT3HxrRyozuaNnUqpnN8wERdtBFM25qOTlJ4WMhEA5_mHJmX6wpFoab0iF1nkmYUPkhsyCTzYSUlUuip4P9jCa-s-irMbGo_Ec6h1ET0Cejk0zzXKH1QBINiq0OUv90abkKMk4Eu0ObPqG5_2AMsfubOeCCl_5Elsr1Wt5vZ3Rs", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.signupgenius.com%2Fgo%2Fumdining&h=AT2TO2nPz7_Eeb-bzGnFHd_fR0pgZp52boEw5sp2BjRS-U1cbh1RXAbK57MN1vaNiJMU48PbD4JY5yWVDDm3AN2zvYuuwSbd3l2dmQpH2eluxaMOOLWHPyTxsE6ibUhisC_3OW-kf2wP2JsptCbmRcNZaUsxXfZQ6uhgyLztSYY", "https://l.facebook.com/l.php?u=http%3A%2F%2Fmanpowermi.com%2Fjobs&h=AT28HFXSfMDJQjrBftO8M_7Is2Ub7ceWZrTCeJxSOCrRXGnud4RXU5Bu5j7Y3TNj0iCJvU594kGvZdw5vx8dOWJyEpJHIWyI06XNZ3bVHHIlyWtXAjdiUr33tpZrZVnPFgU4W7FPQBVpd7Gr8h7D2JKrPeOaQdFt-uDVoTd2EPs", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.manpowermi.com%2F&h=AT1XrHDKda3jUwMmRGcqjlpbIRzZwB_nEv8iDmvRoiEUS1_riTM4TUZ-ptvTbrae0lTgakAK2TqajVRL_JARGWSnAKJ2CP3OofcJaNtaT8p5NWuBfjDMLFPfb9qBCYk_DozKmRS0DJ6Q1S8DRpJh8kW6XCdVTJBwZoz_OJ6LAyA", "https://www.facebook.com/events/831299158103664/"], "image_save_path": ["6113488992027994_00.jpg"], "ad_text": "Manpower, Inc. of SE Michigan Sponsored Check out this opportunity to work at the University of Michigan! We're seeking foodservice staff to join the Michigan Dining team on the campus of U-M in Ann Arbor. Sign up today to attend one of our virtual hiring events. Go to: https://www.signupgenius.com/go/umdining . Job Location: The University of Michigan Campus in Ann Arbor Compensation: $18.00 per hour – WEEKLY PAY! What’s In It For You: Flexible scheduling, both part- and full-time positions, build networking opportunities with a premier employer, gain fundamental customer service skills and culinary experience. Plus... competitive pay ($18.00 per hour), weekly paychecks, free meals (3-hour shift minimum), parking reimbursement, and discounts on public transit! What You’ll Be Doing: Serving food to residents/guests, helping with kitchen cleanup including dishwashing, and/or preparing/cooking food. No experience needed! Here’s What You Need To Apply: Successfully pass a drug screen and criminal background check, a high school diploma/GED, perform essential physical functions (including standing, walking, pulling, squatting, bending, reaching, and lifting up to 50 pounds), ability to comply with the University of Michigan's immunization requirements including but not limited to a COVID-19 vaccine/booster (if applicable). Why You Should Choose Manpower? Upon eligibility, our associates have access to wide range of benefits including a comprehensive insurance program, a free and confidential Employee Assistance Program (EAP), up to eight paid holidays per year, tuition and certification reimbursement, free training and development opportunities, a fully funded GED bonus program, unlimited referral bonuses for each successful referral, weekly pay and electronic deposit – we get you paid fast and securely, 24/7 Manpower support. How to Get Started: Applying is easy! Sign up to attend one of our virtual hiring events at https://www.signupgenius.com/go/umdining . For immediate consideration, you can also call or text “DINING” to 734-665-3757. To see more openings with Manpower across Southeastern Michigan, visit manpowermi.com/jobs . Know of others looking for work? Share this job with friends and family and earn dollars for every successful hire. Manpower, Inc. of SE Michigan is an Equal Opportunity Employer. To learn more about us, visit www.manpowermi.com. Tue, Jan 24, 2023 Michigan Dining - January Virtual Hiring Events Michigan Dining - January Virtual Hiring Events INTERESTED", "grouping_count": 0}]