[{"id": 1845474459150220, "advertiser_name": "Kryger Glass", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["1845474459150220_00.jpg"], "ad_text": "Kryger Glass Sponsored Kryger Glass currently has a position open for a Warehouse Associate within our Kansas City distribution center. This is a full time hourly day position; Monday through Friday, shift between the hours of 7:00 AM - 6:00 PM. Position includes a benefits package and vacation time. Starting Pay $ 16.00-$17.00 per hour depending on experience. Essential duties & responsibilities include: > Reads customer order to determine items to be distributed and fill orders utilizing cherry picker & forklift. > Drives company vehicle to transport items from warehouse to customer > Day to day general warehouse duties, including shipping & receiving To perform the job successfully, an individual should demonstrate the following competencies: > Demonstrates accuracy and thoroughness > Customer service skills > Dependability Qualifications include: > Must hold and sustain a valid driver’s license and be insurable by company standards > Must be able to operate a forklift and cherry picker with ease. > Must be able to pass criminal background screening by company standards and applicable law > Must regularly lift and/or move up to 80 pounds FULL-TIME · $16 - $17 / HOUR · KANSAS CITY Warehouse Associate (KC) Apply now", "grouping_count": 0}, {"id": 863671871550325, "advertiser_name": "Kryger Glass", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["863671871550325_00.jpg"], "ad_text": "Kryger Glass Sponsored Kryger Glass currently has a position open for an Overnight Delivery Driver for our Omaha Distribution Center. We distribute auto glass throughout Iowa & Nebraska. This is a full time hourly position that starts at 4:30 PM and ends at approximately 3 AM; whenever route is completed; Monday through Friday. Position includes a benefit package and vacation time. Starting pay is $15.00 - $ 16.00 / hour. Essential duties & responsibilities include: > Loads truck for delivery route; drives truck to deliver such items as auto glass, flat glass, and replaced products to customer's home or place of business overnight. > Drives company vehicle to transport items to customer (Sprinter/Transit Van) > Maintains clean inside of truck and reports routine maintenance to supervisor to have the work performed. > Listens to and resolves service complaints To perform the job successfully, an individual should demonstrate the following competencies: > Demonstrates accuracy and thoroughness > Customer service skills > Dependability Qualifications include > Must hold and sustain a valid driver license and be insurable by company standards. > Must be able to pass criminal background screening by company standards and applicable law > Must regularly lift and/or move up to 80 pounds. FULL-TIME · $15 - $16 / HOUR · OMAHA Delivery Driver Overnight (OM) Apply now", "grouping_count": 0}]