[{"id": 1122390565025608, "advertiser_name": "Interim Delaware", "status": "Active", "date": "08/24/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.interimde.com%2Fcareers&h=AT1vxyO0LPFaObOvIZzVanRoPonm2QWpFotTFxyaS-gxKfG2HIMUlwg-lb6z9pvQO4tBZCMRTCywON2W8gYECBo3AJenGjOhkfaBPvOpeZj5nl5sarvZhSs64lpLtWE5AjqhJlYWsnGnzYQnOmft3BEESqHZKtpp64c7TXF5hzk"], "image_save_path": ["1122390565025608_00.jpg"], "ad_text": "Interim Delaware Sponsored What if caring for patients one on one was the main focus of your job? It can be 👩🏽‍⚕️! Rediscover your passion to care for others. Join America’s first home care company and get back to what you love.💗Interim HealthCare of Delaware is currently hiring RNs, LPNs and LVNs. Apply today! INTERIMDE.COM Interim Delaware - Apply Interim Healthcare of Delaware is a per diem agency providing the flexible assignments you need to fit your life and priorities. See What Interim can offer you today! Apply now", "grouping_count": 0}, {"id": 459938912484893, "advertiser_name": "Interim Delaware", "status": "Active", "date": "03/29/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.interimde.com%2Fapply&h=AT1vxyO0LPFaObOvIZzVanRoPonm2QWpFotTFxyaS-gxKfG2HIMUlwg-lb6z9pvQO4tBZCMRTCywON2W8gYECBo3AJenGjOhkfaBPvOpeZj5nl5sarvZhSs64lpLtWE5AjqhJlYWsnGnzYQnOmft3BEESqHZKtpp64c7TXF5hzk"], "image_save_path": ["459938912484893_00.jpg"], "ad_text": "Interim Delaware Sponsored Are you a Nurse (RN/LPN), CNA, HHA or DCW? Interim Delaware is hiring to fill our PRN positions. If you have a Delaware License to practice APPLY TODAY! INTERIMDE.COM Interim Delaware - Home Health Care Skilled Care Workers Apply NowInterim Delaware provides the flexible healthcare and home care jobs you need to fit your life and your priorities. As America’s leading provider of home care, as well as hospice and healthcare staffing, chances are we have the perfect assignment to fit your life..... Apply now", "grouping_count": 0}]