[{"id": 881996712924069, "advertiser_name": "Englewood Truck Towing and Recovery", "status": "Active", "date": "01/10/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.indeed.com%2Fviewjob%3Ffrom%3Dapp-tracker-saved-applybtn%26hl%3Den%26jk%3D2c8b61549360608e%26tk%3D1gmb9qdimjg7g801&h=AT012EyBZheZy96ZFZVPnBAusVC5wuledvTEIBvn0oljOW8BlnoLUD39u3hXfhH9VWYXMTON1bTQitEdgtLn7rM7Zhzelw9ArHVpp9wA3mRDtRubb6Hz2nKUoG-pLWDuUANbs82suvd-7jv337h0CLU--_qY3ajFRlTCGkdgsZ8", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.englewoodtruck.com%2Fwork-with-englewood.php&h=AT3RhF1hJnqv0VZB7HuDvNfpgHqpUVZ-4n2DcKqKt2emRBfQ_UHGS20srKSDINmwIKjZ6yoX-82Z3hMhZ2SxEFD7usczgonyJA04cibDtEh_cQ7Z9I7wEDNwYlBL8QVjMeQBlVlEUeKiTrOPiDqQay1vfl0inAsZo9zb5mC_-2A"], "image_save_path": ["881996712924069_00.jpg"], "ad_text": "Englewood Truck Towing and Recovery Sponsored https://www.indeed.com/viewjob?from=app-tracker-saved-applybtn&hl=en&jk=2c8b61549360608e&tk=1gmb9qdimjg7g801 NOW HIRING-LANDOLL/LOWBOY TRACTOR TRAILER DRIVER-CINCINNATI, OH Company Description: Englewood Truck Towing and Recovery is the premier heavy duty towing and equipment transport company in the Dayton, OH and Cincinnati, OH areas. Founded in 1948, Englewood Truck has grown to 6 terminals throughout the Southwest, OH region and has cemented itself as the largest commercial towing and transport company in the area. We specialize in heavy duty towing & recovery, heavy equipment transport, and heavy duty mobile repair. Please apply with The Heavy Duty Professionals today to experience the Englewood difference. Job Summary: Englewood Truck Towing and Recovery is seeking driven individuals to join our Equipment Transport Division. We are growing and looking for an equipment transport driver to join our team. We are hiring out of our Cincinnati, OH terminal. This person will be driving a Landoll and lowboy tractor trailer. This person will properly load and transport various pieces of construction equipment, forklifts, generators, etc. from one place to another. This is a 24/7/365 business so a flexible schedule will be required. Candidates will be home daily with the occasional overnight on the road. Candidates can expect to be on call several weekends per year. Primary Objective: The primary objective for an Equipment Transport Driver is to execute calls that are given by the Dispatcher without delay while providing excellent customer service to all Englewood Truck clients. Requirements and Responsibilities: 1. Class A CDL Required with no automatic restrictions 2. Must be DOT compliant-pass drug and alcohol tests, valid medical card, etc. 3. Must have a good driving record. 4. Experience with transporting construction equipment 5. No major criminal issues 6. Provide exceptional customer service 7. Motivated 8. A team player 9. Ability to work in all weather conditions 10. Maintain a safe work environment 11. Must live near the Cincinnati, OH area Pay/Benefits: Englewood Truck offers the highest compensation in the industry . We also offer a great benefits package including: paid medical, dental, & life insurance, disability and accident plan insurance, paid vacation, paid holidays, paid uniforms, paid cell phones, retirement plan with company match, boot allowance, and holiday bonuses. We run late model equipment. If you are a motivated individual who wants to join a rapidly growing family owned business, then please apply today. Pay is a solid weekly base guarantee plus no cap commissions. Experienced, motivated individuals can make virtually what they want. Englewood Truck Towing and Recovery’s culture and values are part of what makes the company successful and a great place to work. Candidates will be considered in terms of their consistency with culture and values. Englewood Truck Towing and Recovery is a rapidly growing company; flexibility is essential as we grow and develop. The successful candidate must be comfortable in a fast-paced work environment with many crucial deadlines. Click the link at the top of the post to apply today! For more information about the position call 888-513-1000. ENGLEWOODTRUCK.COM Towing Company Employment Southwest Ohio - Join Our Team - Towing company seeking hard workers for multiple open positions. Towing operators, dispatchers, mechanics positions available. Learn more", "grouping_count": 0}]