[{"id": 541762204381655, "advertiser_name": "Byland Transportation", "status": "Active", "date": "11/03/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fl%2Fspcqk%3Fls%3D17012&h=AT3vUBhnkoVwENl6nsrptlMwK2PzFWANqsa3bASbhYGn5nPC31XT2paK2Rr5cFNslGAKuGO3a-WcptyvpqwGdNypNcRIb8B9IKYWCrBZwO85-3JTzZlMkXWUmRIXWefi6nMCUU6NYEwKJk39ELpGugaLKUiDFYJ5VdQSuztCXhw", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.byland.com%2F&h=AT0VFQ6abZjp5s8R_8OPYSULF2yoCKaC7B0Jj7WFfXmVg5UuBU2gN0ULZ09Bpz1Fs-_IpSXXV4kR99nWjzuwavJTIm09nrE80Whv1dpY-wMyNPORnOW3eyoZ93Su6QHQierguL0jdppHbj5XgZInPaujG-60peivMbHgmPDizRc"], "image_save_path": ["541762204381655_00.jpg"], "ad_text": "Byland Transportation Sponsored Byland Transportation now hiring Class A CDL local, regional, and over the road truck drivers. When you go the extra mile, you should be rewarded. That's why we offer CDL-A truck driver opportunities with excellent starting pay rates and a host of great benefits. We are looking forward having you on our team. Benefits: OTR/Regional - W-2 Driver: 62 cpm No Touch and Touch Freight New Freightliner Trucks (2020-2023 models) Weekly Pay/Direct Deposit Referral Bonuses Safety component bonus Medical, Dental, and Vision Insurance 1099 Driver: 65 cpm No Touch and Touch Freight New Freightliner Trucks (2020-2023 models) Weekly Pay/Direct Deposit Referral Bonuses Safety component bonus Local/Regional W-2 Driver: $25/hour No Touch and Touch Freight New Freightliner Trucks (2020-2023 models) Weekly Pay/Direct Deposit Referral Bonuses Safety component bonus Medical, Dental, and Vision Insurance 1099 Driver: $26/hour No Touch and Touch Freight New Freightliner Trucks (2020-2023 models) Weekly Pay/Direct Deposit Referral Bonuses Safety component bonus Requirements: Must have 2 years of Class A experience Must be at least 22 years old Must have a valid Class A CDL Must have good MVR and stable work history Must Pass Drug Test, DOT Physical We are looking forward to having you on our team! Call or text (224) 704-0033 with questions, or apply online http://www.driver-reach.com/l/spcqk?ls=17012 BYLAND.COM Hiring OTR Drivers Apply now", "grouping_count": 0}]