[{"id": 5741717219281934, "advertiser_name": "The Meadows by EEI", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["5741717219281934_00.jpg"], "ad_text": "The Meadows by EEI Sponsored RN WEEKEND PROGRAM! Work Friday, Saturday, Sunday 3pm-11:30pm Work 3 shifts, get paid for 5!! RATE is NEGOTIABLE with EXPERIENCE! SUMMARY Directs, through head nurses, activities of nursing staff by performing the following duties. ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Plans and organizes activities in nursing services for two or more resident‑care units to ensure resident needs are met in accordance with instructions of Physician and facility administrative procedures Coordinates activities with other resident care units Consults with Head Nurse on nursing problems and interpretation of facility policies to ensure resident needs are met Plans and organizes orientation and in‑service training for unit staff members, and participates in guidance and educational programs Assists in formulating budget Engages in studies and investigations related to improving nursing care Establishes standard of practice Interprets, implements and changes when necessary polices and procedures relating to on shift nursing activity Changes and updates schedule as necessary Reviews and projects staffing needs for up to three upcoming shifts to assures adequate coverage Completes staffing change report and completes all new resident admission orders Communicates with charge nurses on all floors, as well as oncoming shift supervisor Responsible for admission checklists and all necessary chart information Completes all accident/incident reports for all residents when required, visits each resident at least once on each assigned shift, assures residents are fed all three meals. Evaluates all emergency situations and recommends or provides appropriate care Completes all QA requirements Supervises all nursing personnel on assigned shifts. Meets regularly with the staff, counsels and disciplines staff as required Supervises and assures all resident care is completed Supervises dining room. Ensures food is of adequate temperature for service Reviews medication incident forms and discusses same with Director of Nursing Monitors at risk skin break down protocol Perform primary care as required Maintains resident confidentiality at all times Attends in-services as required Counsels family members as necessary Is involved with the restraint committee and orientation of new employees as necessary. The supervisor assures that all universal precautions are followed at all times, including proper glove wear, glove disposal, needle precautions, etc., in accordance with facility policy. He/she also assures all other facility protocols such as attends changing, restraint use, repositioning of residents, supplemental nourishment, hydration, etc are followed. SUPERVISORY RESPONSIBILITIES Manages all floor nursing employees during their assigned shift. Is responsible for the overall direction, coordination, and evaluation of this unit. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws. Responsibilities include training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems. QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. EDUCATION and/or EXPERIENCE Bachelor's degree (B. A.) from four‑year college or university; or one to two years related experience and/or training; or equivalent combination of education and experience. Maintain a current, valid license as a Registered Nurse in the Commonwealth of Pennsylvania PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle, or feel; reach with hands and arms; and stoop, kneel, crouch, or crawl. The employee is occasionally required to sit. The employee must regularly lift and/or move up to 10 pounds and frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. Job Type: Full-time Benefits: 401(k) Dental insurance Health insurance Paid time off Vision insurance Supplemental pay types: Signing bonus Education: Bachelor's (Preferred) Experience: Nursing: 1 year (Preferred) License/Certification: BLS Certification (Preferred) RN (Preferred) FULL-TIME · DALLAS, PENNSYLVANIA RN - Weekend Program Apply now", "grouping_count": 0}, {"id": 1510813436094359, "advertiser_name": "The Meadows by EEI", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.themeadowsdallas.com%2Fnursing-home-employment&h=AT3fx1kSifb_588E5n7vQDlJlmKHTOPWiLv7yAv1fjJpZvVSE0PE8EcoQGA7WneiGRPTHpNFMpRHuKNSkyxz-dcG0taYlCoUmNpDTlIyt1nyqjoJPogvfbRflJ1zRyKvdvOf3fMXbonXaa3FO1Y13XMNnLmgSS75mVV6VSoUaO8", "https://l.facebook.com/l.php?u=https%3A%2F%2Fthemeadowsdallas.com%2F&h=AT1rVtNppGuD4S2emAmcwZfGFQqtsVl6gmqs1tSsPx2nvIFjoNGUH9ZZ69Wvs0Mf4Glut_cOuEivcT87LrOuXY_OYLpMk2QhoAHHOHwIwkFSC6IPx_SobXt_5_o9iyEH8HSYbfUqHlEob15u6VeMA1DvGTJCrm43dCDAV3pG1I4"], "image_save_path": ["1510813436094359_00.jpg"], "ad_text": "The Meadows by EEI Sponsored 🔸 Are you looking for a rewarding career in long term care? 🔸 Do you enjoy working with the elderly? THE MEADOWS IS THE PLACE FOR YOU! Come join our nursing department as a Certified Nurses Aide - Full time & Part time positions available! Start your journey at the Meadows today & APPLY! 👉 www.themeadowsdallas.com/nursing-home-employment #TheMeadows #JobOpening #Nursing #SkilledNursing #LongTermCare #DallasPa THEMEADOWSDALLAS.COM Meadows Nursing Homes, Assisted Living and Rehabilitation Center Our nursing homes and income based housing are centered on providing excellent care along with respect and dignity to all residents. Learn more", "grouping_count": 0}]