[{"id": 722607152706706, "advertiser_name": "International Transport Services", "status": "Active", "date": "01/22/2023", "ad_url": ["https://www.facebook.com/105975042380517"], "image_save_path": ["722607152706706_00.jpg"], "ad_text": "International Transport Services Sponsored International Transport Services LLC is a Middletown, Ohio based company specializing in “open-deck cargo transport. We are currently in search of a CDL A truck driver who has prior experience in OTR open-deck operations: Step deck, Double Drop-deck and RGN deliveries. This CDL A driver will perform a host of functions relevant to the safe transport of cargo ranging from $50,000 to $2,000,000 in cargo value. Class A CDL drivers from all backgrounds are encouraged to apply. Class A CDL Drivers Needed Step Deck drivers for 2022 & 2023 Kenworth Trucks Qualifications CDL A: (Required) TWIC Card Respectable MVR Over the Road step deck driving: 2 years (Preferred) 1-2 years of long haul, coast to coast experience (Preferred) Experience with step deck, double drop, RGN, Flatbed freight Experience building and executing successful trip plans Tarping and freight securement experience in all weather conditions Experience with Conestoga Meet all the federal motor carrier’s guidelines with no OWI’s in the past 5 years Over 21 Equipment includes: PrePass/Weight Bypass ELOG42 ELD Microwave Refrigerator Inverter Benefits New equipment Fuel Card Competitive pay range of 25 – 30% of weekly gross, $2,000 +Bonuses Or $0.75-0.80 CPM + Bonuses Bonuses included clean DOT inspection, Yearly safety bonus, referral bonuses Paid weekly direct deposit Class A CDL Owner Operators Needed Qualifications Good condition or better equipment must meet all safety requirements Power only not a problem CDL A: (Required) TWIC Card Over the road driving: 2 years (Preferred) 1-2 years of long haul, coast to coast experience (Preferred) Experience with step deck, double drop, RGN, Flatbed freight Experience building and executing successful trip plans Tarping and freight securement experience in all weather conditions Meet all the federal motor carrier’s guidelines with no OWI’s in the past 5 years Over 21 Benefits Competitive pay range of 88%, paid weekly direct deposit Fuel and oil discount between $0.30-0.80 CPG Tire discount Parts and maintenance discount 24/7 365 Driver support with a strong team that is with you every step of the way. Lease to purchase new or newer trucks and trailers after 6 months of employment 1099 or W2 In house dispatching International Transport Services Transport Service 143 people like this Like Page", "grouping_count": 0}]