[{"id": 553305313192626, "advertiser_name": "Frontline Ag Solutions", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["553305313192626_00.jpg"], "ad_text": "Frontline Ag Solutions Sponsored Purpose: Operate flagging vehicle and perform flagging operations that assists with traffic control and the safe transport of equipment for the dealership. Performs maintenance duties for the store. Responsibilities: o Escort truck drivers during the transport of equipment to/from customers and/or between dealer facilities, may also assist in the pick-up of new equipment from a John Deere factory o Safely load/unload and secure loads and equipment prior to hauling o Supports the sales & service departments with equipment delivery as needed o Maintains all required certifications in line with DOT, OSHA and company policy o Accountable for all time and distance traveled in performing assigned duties o May instruct customers on basic equipment operating procedures as required o Operated and maintains vehicles, tools and equipment required to perform job responsibilities o Maintains a clean work area and performs work in a neat and orderly fashion o Follows all safety rules and regulations in performing work assignments o Assist with the general maintenance of the facility and vehicles o Clean building floors by sweeping, mopping, scrubbing, or vacuuming them. o Gather and empty trash. o Notify managers concerning the need for major repairs or additions to building operating systems. o Remove snow from sidewalks, driveways, and parking areas, using snowplows, snow blowers, and snow shovels, and spread snow melting chemicals. o Requisition supplies and equipment needed for cleaning and maintenance duties. o May maintain tool room or run the wash bay o May perform grounds maintenance for the dealer properties o May be required to assist in moving displays or equipment within the dealership o May operate a forklift to transport parts, equipment and supplies for the dealership Experience, Education, Skills and Knowledge: o 1+ year of experience pulling a gooseneck, tilt or utility trailer o 1+ year of experience flagging for a semi-truck operator o Experience with the mechanical, electrical and hydraulic systems used in off road, construction, lawn, or heavy equipment o Experience working cooperatively in a team environment o Experience communicating effectively verbally and in writing o Valid driver’s license required: CDL (Commercial Driver’s License) preferred o Ability to lift items weighing upwards to 75 lbs. o Ability to perform multiple duties as assigned o Basic knowledge of equipment safety procedures", "grouping_count": 2}]