[{"id": 1513765572455411, "advertiser_name": "C.A. Albright & Sons L.L.C.", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["1513765572455411_00.jpg"], "ad_text": "C.A. Albright & Sons L.L.C. Sponsored We are looking for a responsible Auto Technician to perform all assigned vehicle repairs and maintenance work in accordance with dealership and factory standards. Qualifications: • Carrying out repairs and replacing damaged parts • Testing motor vehicles and equipment • Diagnosing the cause of any malfunctions • Carrying out inspections of completed repairs to ensure that the vehicle is safe to be driven • Returning a customer's vehicle to them in clean condition • Road testing vehicles, inspecting and testing mechanical units • Following a checklist to ensure that all key work has to be done • Checking engine lights, airbag systems, transmission fluids, and filters • Following safety policies and procedures • Assisting in assembling cars and trucks • Maintaining an organized, neat, and safe bay • Must have a valid NYS license and a clean record C.A. Albright & Sons, LLC has been in operation for over 110 years. We have an immediate opening for a dynamic person to help us keep growing. 2020 was a big year for the company with the launch of a propane division which propelled the company into a new market and immediate new customer growth. If you are excited to be part of a winning team, C.A. Albright & Sons, LLC is a perfect place to get ahead and call home. Room for advancement! After careful consideration of this position as described and the required qualifications, if you feel that this job could be an excellent fit for you and are looking for a company to call home, please apply. FULL-TIME · NEW BALTIMORE, NEW YORK Auto Technician Apply now", "grouping_count": 0}, {"id": 543155464572499, "advertiser_name": "C.A. Albright & Sons L.L.C.", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["543155464572499_00.jpg"], "ad_text": "C.A. Albright & Sons L.L.C. Sponsored Our Propane Division is hiring a Propane Technician to join our family-owned business that is growing quickly with great benefits and competitive pay. Qualifications: • Valid Driver's License • Installing Propane various sized above, below, and ground tanks, gas lines at commercial and residential locations while meeting all local, state, and federal code requirements • P3 Safety Checks - gas safety checks on propane tanks and appliances to ensure company and government safety regulations are met • Installing tank monitors • Must be able to meet the physical requirements of the job which include bending, lifting heavy equipment, and working in confined spaces and adverse weather conditions • Seasonal on call • Tech savvy • Strong sense of responsibility • Educate customer on how to use the Propane monitor app • Exceptional customer service skills • Install, maintain, troubleshooting, and repair fuel systems • Bill customers for services and collect payment at time of service for customers • Problem solves, work on your own and be able to work well with others without supervision • Maintain a fully stocked service truck with required parts and tools to accommodate all job needs Knowledge of Blue Cow Software and House Call Pro would be beneficial however the company will provide on-the-job training and assistance C.A. Albright & Sons, LLC has been in operation for over 109 years. We have an immediate opening for a highly experienced Propane Installer. Apply today to join our team! FULL-TIME · NEW BALTIMORE, NEW YORK Propane Service Technician Apply now", "grouping_count": 0}]