[{"id": 1196271827664244, "advertiser_name": "East Texas Sales & Service", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["1196271827664244_00.jpg"], "ad_text": "East Texas Sales & Service Sponsored Established C-store/travel center wholesale company is looking for a route sales representative/driver to take over some established accounts and to source and grow new accounts in the Houston Market. Someone with the drive to learn a new trade without experience would be considered. Preferably, someone in the Humble or surrounding areas. The individual we are looking for would have the following qualities: Be a self starter Can easily speak to and approach new people Must be a very diligent worker attentive to detail people person organized High integrity Clean driving record Valid drivers license must be able to pass background & credit check age 25+ Physically be able to: get in and out of a box truck Lift 40-50+ lbs regularly Drive short and long distances stoop, bend, kneel, push, pull Job Responsibilities: Servicing assigned stores invoicing sourcing new clients setting new stores displays ensuring clean displays maintaining stock and a clean truck ensuring maintenance on provided truck (company pays for all truck maintenance) Cold Calling Driving to warehouse weekly to load Pay: Contract labor Weekly draw monthly commission off sales $30,000-$60,000 per year + based on performance and commission Job Type: Contract Salary: $30,000.00 to $60,000.00 /year For any applicants who get through the interview phase there will be a one day paid ride along with one of our drivers to see if you are the right person for the job. Pay will be hourly $7.25 for this day. Upon hire, there will be a training/probationary period before contract position is awarded to the right person. Interview process will consist of emails, phone, Skype/face-time, and formal sit-down interviews. The process will take a week or longer. Job Type: Contract/ Commission Salary: $30,000.00 to $60,000.00 /year FULL-TIME · WHITEHOUSE, TEXAS DSD Sales Representative Apply now", "grouping_count": 0}]