[{"id": 1303210410457916, "advertiser_name": "Assured Emergency Services", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["1303210410457916_00.jpg"], "ad_text": "Assured Emergency Services Sponsored We are seeking an experienced night-shift tow truck operator/roadside assistance technician to join our team! All employees will be involved in police towing and recoveries, as well as standard towing and roadside assistance. Our full-time benefits include Health Care, Retirement Plan with Employer Match, and PTO. We offer internal training and promotion opportunities. Responsibilities • Drive and operate a Tow Truck to various locations in the Mid-Michigan area. • Offer Roadside Assistance including Tire Changes, Lockouts, Jump Starts, etc. • Effectively communicate with dispatchers and team. • Accommodate customers with exceptional Customer Service. • Keep your assigned truck clean and organized. • Maintain a clean and approachable appearance. Qualifications • Experience is preferred, but not required. • A Valid Michigan Driver's License (Chauffeur's License/CDL preferred). • Clean driving record. • Must be able to work a flexible schedule. • Good written and verbal communication skills. About Us We are a 3rd generation family-owned business, and take a great deal of pride in our work and in our experienced and dedicated team. Our full range of services include 24/7 light & heavy-duty towing, equipment transportation, airbag accident recovery, roadside assistance, commercial towing, mobile repair, underwater recovery, property management & impound services, specialized transportation services, and heavy-duty truck repair. FULL-TIME · WATERFORD TOWNSHIP Light-Duty Tow Truck Driver (Night Shift) Apply now", "grouping_count": 0}, {"id": 1648113025637266, "advertiser_name": "Assured Emergency Services", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["1648113025637266_00.jpg"], "ad_text": "Assured Emergency Services Sponsored The Logistics Coordinator works as a core member of our team performing highly diversified duties relating to efficiently managing our logistics schedule and fleet. This position oversees our fleet of drivers who provide emergency towing, recovery, and spill response services from our Flint, MI and Waterford, MI locations. The ideal candidate should have familiarity with Mid- and Southeast Michigan roadways. This is a Full-Time position with a standard business schedule, Monday - Friday. Our benefits include Health Care, Retirement Plan with Company Match, and PTO. Duties and Responsibilities - Use assigned systems, applications and communication methods to schedule drivers for calls, ensuring all information is relayed accurately. - Manage incoming calls through multiple communication streams including phone, email, text, and walk-in. - Work closely with the team to ensure that all calls and scheduling changes are coordinated efficiently. - Establish goals for drivers and work to continually improve dispatching metrics. - Comply with laws, regulations and standards by completing any required documentation as applicable. - Adhere to safety standards at all times while enforcing safe work habits with all team members. - Supervise drivers to ensure efficient driver productivity and excellent customer service. - Troubleshoot and resolve potential issues proactively. - Assist in other duties as needed. Education and Experience - High school diploma or equivalent. - Proven ability to collaborate effectively within a team atmosphere. - Superior interpersonal skills and communication abilities. - Strong organizational skills and attention to detail. - Proficiency with Microsoft Office software. - Strong process troubleshooting skills. About Us We are a 3rd generation family-owned business and take a great deal of pride in our work and in our experienced and dedicated team. Our full range of services include 24/7 Light, Medium, and Heavy-Duty Towing, Heavy Recovery, Truck Repair, Spill Response, and Specialty Hauling Services. FULL-TIME · WATERFORD TOWNSHIP Logistics Coordinator Apply now", "grouping_count": 0}, {"id": 1156749734940822, "advertiser_name": "Assured Emergency Services", "status": "Active", "date": "01/17/2023", "ad_url": [], "image_save_path": ["1156749734940822_00.jpg"], "ad_text": "Assured Emergency Services Sponsored We are seeking a Heavy Equipment Operator to join our rapidly growing team! Heavy equipment operating experience and excavation experience is required for this position. Some hazmat experience is preferred. This is a full-time position with benefits including Health Care, Retirement Plan with company match, and PTO. Compensation based on experience. Schedule 7am - 5:30pm, M - F Some evenings and weekends may be required for emergency spills, dispatched from home. Training Program: Our in-house training provides you with crucial First Responder certifications including 40-HR HAZWOPER. Responsibilities: • Heavy Equipment Operation • Excavation and Remediation • Environmental and Industrial Spill Cleanup Requirements: • Proficient heavy equipment operation and excavation skills required. • Some Hazmat, Industrial Cleaning, or Excavation experience preferred. • Valid Driver’s License & Clean Driving Record • Team Player with a Positive Attitude • Excellent Organizational Skills • Basic Mechanical Skills Preferred FULL-TIME · WATERFORD TOWNSHIP Heavy Equipment Operator / Hazmat Technician Apply now", "grouping_count": 0}]