[{"id": 1352761315565814, "advertiser_name": "Holland Special Delivery", "status": "Active", "date": "01/17/2023", "ad_url": [], "image_save_path": ["1352761315565814_00.jpg"], "ad_text": "Holland Special Delivery Sponsored INDIANAPOLIS TRUCK DRIVERS - Holland Special Delivery has open positions for Short-Haul drivers in your area. Competitive benefits package, flexible shifts, new equipment, Sundays OFF and a company that values YOU. Join our team today! FULL-TIME · $55,000 - $75,000 / YEAR · INDIANAPOLIS, INDIANA Local Truck Driver Apply now", "grouping_count": 0}, {"id": 748212086251136, "advertiser_name": "Holland Special Delivery", "status": "Active", "date": "01/17/2023", "ad_url": [], "image_save_path": ["748212086251136_00.jpg"], "ad_text": "Holland Special Delivery Sponsored West Michigan Truck Drivers - Holland Special has open positions for local/short haul truckers in your area. Competitive benefits package, flexible shifts and a company that values YOU. Join our team today! FULL-TIME · $55,000 - $75,000 / YEAR · GRAND RAPIDS, MICHIGAN Local Truck Driver Apply now", "grouping_count": 0}, {"id": 1172480556775931, "advertiser_name": "Holland Special Delivery", "status": "Active", "date": "01/17/2023", "ad_url": [], "image_save_path": ["1172480556775931_00.jpg"], "ad_text": "Holland Special Delivery Sponsored Indianapolis Truck Drivers - Holland Special has open positions for OTR truckers in your area. Competitive benefits package, flexible shifts and a company that values YOU. Join the best! FULL-TIME · $55,000 - $80,000 / YEAR · INDIANAPOLIS, INDIANA CDL Truck Driver Apply now", "grouping_count": 0}, {"id": 1194750861181124, "advertiser_name": "Holland Special Delivery", "status": "Active", "date": "01/17/2023", "ad_url": [], "image_save_path": ["1194750861181124_00.jpg"], "ad_text": "Holland Special Delivery Sponsored West Michigan Truck Drivers - Holland Special has open positions for OTR truckers in your area. Competitive benefits package, flexible shifts and a company that values YOU. Join the best! FULL-TIME · $55,000 - $80,000 / YEAR · GRAND RAPIDS, MICHIGAN CDL Truck Driver Apply now", "grouping_count": 0}]