[{"id": 1649569922124604, "advertiser_name": "R&B Climate Control", "status": "Active", "date": "01/16/2023", "ad_url": [], "image_save_path": ["1649569922124604_00.jpg"], "ad_text": "R&B Climate Control Sponsored Rapidly growing lawn care and landscaping company is seeking an experienced Lawn Care Crew Leader as well as dependable Crew Members. We are based in Fort Mill & offer a full range of services for commercial and residential customers in fort mill and surrounding areas. We are looking for committed individuals to grow with us and advance within the company. All applicants should be punctual, reliable and have dependable transportation to work Daily Duties include: *Mowing, edging and fertilizing lawns *Weeding and mulching landscape beds *Trimming small trees, hedges and shrubs *Removing unwanted, dead or damaged trees *Planting shrubs, flowers and trees Knowledge and requirements: *Must possess knowledge of tools and equipment *Must be able to follow directions *Must be able to lift 50 lbs. *Must be able to work outdoors *Must be able to work Normal workdays *M-F, shift varies 7 am - 4 pm (with required overtime during growing season) Lawncare Crew Leader Lawncare Crew Leader will be responsible for operating truck and trailer and effectively managing and communicating with their team to complete a daily schedule. Duties will include ensuring safety and quality standards are met, lawn mowing, trimming, edging, some equipment maintenance and other assigned duties. *Ability to drive truck and trailer *Must have a valid driver's license and clean driving record *3-year minimum experience with commercial lawncare equipment such as zero turn mowers, string trimmers, *pruning equipment, sprayers, etc. *Must have strong attention to detail and leadership skills Lawncare Crew Member Crew Member will be responsible for effectively working with their team members to complete jobs while upholding company’s safety and quality standards. Duties include mowing, trimming, pruning, mulching, bed maintenance, plant installation, etc. *1-year minimum experience with commercial lawncare equipment such as zero turn mowers, string trimmers, *pruning equipment, sprayers, etc. *Must have valid drivers license or ID *Must have strong attention to deal FULL-TIME · $35,000 - $45,000 / YEAR · FORT MILL, SOUTH CAROLINA Landscape Crew Member Apply now", "grouping_count": 0}]