[{"id": 1117588888936314, "advertiser_name": "BJC HealthCare Careers", "status": "Active", "date": "01/27/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fbjc.jibeapply.com%2Fjobs%3Fkeywords%3Dpct%26tags6%3DBarnes-Jewish%2520Hospital%26page%3D1&h=AT3erUPI8Gc2m-ZTZsZdVfZr10c_9I_QN6VwRdyzNpNVCvPo584CJHiqZGDe_NtWVEsXAyF9e6gOrKdK_ibbWM0oFYyyeD7nT_4jIWQhtaIBJHFLmrWBkOZ-cQJpvuLy_dSu3y1GvLEI1DAZSRPnD46ytEl1aaazSTFthWQBpus"], "image_save_path": ["1117588888936314_00.jpg"], "ad_text": "BJC HealthCare Careers Sponsored Begin your career at the #1 hospital in Missouri and join the team as a patient care technician at Barnes-Jewish Hospital! We are looking for candidates with past experience as a patient care technician or are a certified nursing assistant. A sign-on bonus is available for eligible roles. You Belong Here. BJC.JIBEAPPLY.COM Now Hiring –PCTs BJC HealthCare Careers Apply now", "grouping_count": 0}, {"id": 888100565568389, "advertiser_name": "BJC HealthCare Careers", "status": "Active", "date": "01/27/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.bjc.org%2Fjobs%3Fkeywords%3D%2522Pediatric%2520Convenient%2520Care%2520Nurse%2520Practitioner%2522%26sortBy%3Drelevance%26page%3D1%26tags6%3DSt.%2520Louis%2520Children's%2520Hospital&h=AT3erUPI8Gc2m-ZTZsZdVfZr10c_9I_QN6VwRdyzNpNVCvPo584CJHiqZGDe_NtWVEsXAyF9e6gOrKdK_ibbWM0oFYyyeD7nT_4jIWQhtaIBJHFLmrWBkOZ-cQJpvuLy_dSu3y1GvLEI1DAZSRPnD46ytEl1aaazSTFthWQBpus"], "image_save_path": ["888100565568389_00.jpg"], "ad_text": "BJC HealthCare Careers Sponsored We are hiring part-time nurse practitioners at our pediatric convenient care locations! Work in an after-hours/urgent care type setting and help make the kids of our community healthier. You Belong Here. JOBS.BJC.ORG Now Hiring Nurses! BJC HealthCare Careers Apply now", "grouping_count": 0}, {"id": 1334965944009250, "advertiser_name": "BJC HealthCare Careers", "status": "Active", "date": "12/29/2022", "ad_url": ["https://www.facebook.com/events/1110754589571746/"], "image_save_path": ["1334965944009250_00.jpg"], "ad_text": "BJC HealthCare Careers Sponsored Kick start your nursing career with BJC HealthCare and learn about opportunities for growth within our hospital network! If you are a nursing student, we invite you to join us for our virtual information sessions throughout the week of Jan. 30-Feb. 2 hosted by clinical leadership across our system. These virtual sessions will take place from 4-6 p.m. on each day. Scheduled sessions include: Jan. 30: Pediatrics, women and infants and ICU departments Jan. 31: ICU, medical surgery and neurological departments Feb. 1: Emergency/trauma, psych/behavioral health and medical surgical departments Feb. 2: Heart and vascular, perioperative and oncology departments Register and learn more about our hiring opportunities. Sun, Jan 29, 2023 - Wed, Feb 1, 2023 Student Nurse Information Sessions Student Nurse Information Sessions INTERESTED", "grouping_count": 0}, {"id": 437097268419205, "advertiser_name": "BJC HealthCare Careers", "status": "Active", "date": "06/10/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.bjc.org%2Fjobs%3F%252Fjobspage%3D1%26utm_medium%3DSEM%26sortBy%3Drelevance%26page%3D1%26keywords%3DGraduate%2520Nurse%26categories%3DNursing%2520Services&h=AT3erUPI8Gc2m-ZTZsZdVfZr10c_9I_QN6VwRdyzNpNVCvPo584CJHiqZGDe_NtWVEsXAyF9e6gOrKdK_ibbWM0oFYyyeD7nT_4jIWQhtaIBJHFLmrWBkOZ-cQJpvuLy_dSu3y1GvLEI1DAZSRPnD46ytEl1aaazSTFthWQBpus"], "image_save_path": ["437097268419205_00.jpg"], "ad_text": "BJC HealthCare Careers Sponsored Are you ready to begin your nursing career with a nationally-ranked health care network? At BJC HealthCare, it is important to us to grow our employees professionally and personally. That is why we offer new graduate nurse positions for all student nurses. Our University Recruitment Team is committed to helping new graduates navigate the staff nurse application process. Qualified students who apply to this position are eligible to receive career opportunities across all BJC HealthCare hospitals and nursing specialties. These include: * Cardiovascular * Behavioral Health/Psychiatric * Critical Care * Emergency * Home Care * Labor & Delivery/Women’s Health * Medical/Surgical * Neurosciences * Oncology * Operating Room * Pediatrics Benefits available for eligible positions include a $12,500 sign-on bonus, health care benefits, tuition assistance and student-loan repayment. All applicants must have at least an associates degree in nursing. World-Class Medicine Demands World-Class Talent. Apply today! JOBS.BJC.ORG BJC HealthCare Careers BJC HealthCare Careers Apply now", "grouping_count": 0}]