[{"id": 703514197939740, "advertiser_name": "University of Iowa Hospitals & Clinics", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fuihc.org%2Fjoin-our-nursing-team&h=AT1dIaWF7vwSJD77AzhBqVbQsLhe21BpvfUH3RgqRf27390X-xrWl-XMAOo1FnrbneSJ8722pQW915frlpV0YuMATU3NHkPyGwh9rMRt4lvn3RBbyKx-s5XW0ce6AiOzPkb226gAt3HDPERsHreCq9b9kSiSwt9nJ9YKPF6dLPU", "https://l.facebook.com/l.php?u=https%3A%2F%2Fuihc.org%2Fjoin-our-nursing-team&h=AT2MGHy1nXVU3jKUaJo6fb8rq-QrvHLryf1mJIXlabP35LW5CclkXH1XlFwn3rpEmjjqgjKS0LF8SI4-LcXvR6JTydTL5NuYIOD7LYyCFDjEsRbHgWkQsY1ngMSSNyjga7hU2F3SizO-sWp9e4c_O-Yo1lJWgJTb1zAJ4wuatD4", "https://www.facebook.com/events/877123070284011/"], "image_save_path": ["703514197939740_00.jpg"], "ad_text": "University of Iowa Hospitals & Clinics Sponsored Attend our Registered Nurse (RN) hiring event from 9 a.m. to 6 p.m. on Tuesday, Feb. 7 to see how Iowa’s top hospital is changing medicine and changing lives every day. And we could change yours, too. Whether you’re an experienced nurse or just starting out, UI Health Care will meet you where you’re at in your career with personalized training tailored to your experience. You’ll have the opportunity to participate in on-site interviews and unit tours to find the best fit for your skills and interests. Just bring your resume and we will help you through the application process. RSVP here: https://uihc.org/join-our-nursing-team Important Reminders: - Please bring a copy of your resume. - Shadow experiences may be available in the areas you’re interested in. Please come dressed in scrubs if you’d like to participate in a shadow experience. The shadows are up to 2 hours in length and are with a core UI Health Care RN who works on that unit or clinic. Shadow experiences give you the opportunity to fully explore the unit and team that you may be joining. What sets us apart: + Sign-on incentives Whether you’re an experienced nurse or a new graduate, registered nurses may qualify for up to $10,000 in sign-on incentives when you apply with UI Health Care today. An additional $2,500 incentive is available for select positions in the following areas: Medical Surgical Services, Operating Room, Behavioral Health Services, Digestive Health Services, Cancer Center, and Heart and Vascular Adult Cath Lab. + The Iowa difference University of Iowa Hospitals & Clinics has achieved Magnet® designation for nursing excellence four times and is ranked among the nation’s best hospitals by U.S. News & World Report. We offer competitive salaries and a generous benefits package—including insurance coverage and retirement options—that is unmatched by any other health system in Iowa. When: Tuesday, Feb. 7 from 9 a.m. to 6 p.m. Where: University of Iowa Stead Family Children’s Hospital, Level 12 200 Hawkins Drive, Iowa City, IA (Parking in Ramp 2 is free for all event attendees. Check-in will be in the lobby of UI Stead Family Children’s Hospital.) Learn more: https://uihc.org/join-our-nursing-team Mon, Feb 6, 2023 Registered Nurse (RN) Hiring Event University of Iowa Stead Family Children's Hospital Registered Nurse (RN) Hiring Event INTERESTED", "grouping_count": 0}, {"id": 862881728377184, "advertiser_name": "University of Iowa Hospitals & Clinics", "status": "Active", "date": "01/17/2023", "ad_url": ["https://www.facebook.com/HoldenCancerCenter", "https://l.facebook.com/l.php?u=https%3A%2F%2Fuiowa.referrals.selectminds.com%2Fjobs%2Fclinical-trials-research-associate-cancer-center-25625&h=AT01FQ8W62TF3HDEgSNPatZHiFsrM6PJmYHCQTIgnT7Buq5s5wbFjFiF4koEBru2RdxcFVpJ_7XKrxTM4HloIRSsBcpMqd2E8etiWljDkYjsKdH9xiG7f_vflrrn_JZr_YTBEcC1E0R6yMoSKfjBPZXEIxtLEWixtYhvR9sehnI"], "image_save_path": ["862881728377184_00.jpg"], "ad_text": "University of Iowa Hospitals & Clinics Sponsored Looking to use your health care experience and your administrative skills to make a difference in patients’ lives? Consider a career in clinical research with University of Iowa Holden Comprehensive Cancer Center . As a member of our clinical research team, you will help coordinate care and arrange access to new treatments and therapies that give hope to patients in need. Don’t do just any office job—choose one that’s challenging and rewarding. UIOWA.REFERRALS.SELECTMINDS.COM Now Hiring: Cancer Research Associate The Holden Comprehensive Cancer Center (HCCC) at the University of Iowa is seeking a Clinical Trials Research Associate to serve as a member of the... Apply now", "grouping_count": 0}, {"id": 459742943020289, "advertiser_name": "University of Iowa Hospitals & Clinics", "status": "Active", "date": "12/25/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fuihc.org%2Fnursing-careers%3Futm_source%3Dfacebookinstagram%26utm_medium%3Dstatic%26utm_campaign%3Dfoundation%26utm_term%3D2022%26utm_content%3DBIncentiveRevised&h=AT01FQ8W62TF3HDEgSNPatZHiFsrM6PJmYHCQTIgnT7Buq5s5wbFjFiF4koEBru2RdxcFVpJ_7XKrxTM4HloIRSsBcpMqd2E8etiWljDkYjsKdH9xiG7f_vflrrn_JZr_YTBEcC1E0R6yMoSKfjBPZXEIxtLEWixtYhvR9sehnI"], "image_save_path": ["459742943020289_00.jpg"], "ad_text": "University of Iowa Hospitals & Clinics Sponsored Now is a great time to apply with us! Sign-on incentives are available, PLUS an additional $2,500 incentive for select positions in the following areas: Medical Surgical Services, Operating Room, Behavior Health Services, Digestive Health Services, Cancer Center, and Heart and Vascular Adult Cath Lab. UIHC.ORG Your Voice Matters Learn more", "grouping_count": 0}]