[{"id": 1389232935148612, "advertiser_name": "AE Towing Inc", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["1389232935148612_00.jpg"], "ad_text": "AE Towing Inc Sponsored AE Collision & Towing is currently expanding and is seeking professional, safe and responsible Class A CDL drivers for our Eugene, Oregon location. Landoll, lowboy, rollback, flatbed tow truck, and/or forklift experience is preferred, but not required. We're willing to train the right people. You'll need to have a high school diploma or equivalent, a good driving record, excellent customer service, teamwork, and communication skills (written and verbal). As well as the ability to follow instructions. The positions we're hiring for are Monday through Friday. Local routes, so you'll be home every night, and weekends. Must be ok working 10-12 hour shifts. MUST BE ABLE TO PASS A 15 YEAR POLICE BACKGROUND CHECK!! $6,000 Sign-on bonus WE OFFER: -2/3rd Employer paid Medical, Dental, Vision, Chiropractic, and Pharmacy. -Aflac. -Simple IRA retirement plan with 3% employer match. -Discounted AAA Membership. -Employee discount for mechanical work at our Service Center. -Employee discount on tires. -Uniforms. -Paid Vacation. If you feel you would be a good addition to our team, then please apply today!! AE Towing 1511 Hwy 99N Eugene, OR 97402 FULL-TIME · $1,500 - $2,000 / WEEK · EUGENE, OREGON Class A CDL Driver $6k sign-on bonus Apply now", "grouping_count": 0}, {"id": 1293331081564414, "advertiser_name": "AE Towing Inc", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2FAEtowingsalem.com%2F&h=AT2tkKgOsWzvtLBYWbGCOcVWYzEKwI8AkDyZFolHeqnvvVIw9Lk69PS8gJeOvQa-VoVqxNoq905fbL0OA18k3DIkeAr0Dt37feaCSkn9AneMEejWOWEuswZntsRH5cGgYErcOXLlL309g4R4xNTpMbDsq0A"], "image_save_path": ["1293331081564414_00.jpg"], "ad_text": "AE Towing Inc Sponsored AE Collision & Towing is currently expanding and is seeking professional, safe and responsible Class A CDL drivers for our Salem, Oregon location. Landoll, lowboy, rollback, flatbed tow truck, and/or forklift experience is preferred, but not required. We're willing to train the right people. You'll need to have a high school diploma or equivalent, a good driving record, excellent customer service, teamwork, and communication skills (written and verbal). As well as the ability to follow instructions. The positions we're hiring for are Monday through Friday. Local routes, so you'll be home every night, and weekends. Must be ok working 10-12 hour shifts. MUST BE ABLE TO PASS A 15 YEAR POLICE BACKGROUND CHECK!! $6,000 Sign-on bonus WE OFFER: -2/3rd Employer paid Medical, Dental, Vision, Chiropractic, and Pharmacy. -Aflac. -Simple IRA retirement plan with 3% employer match. -Discounted AAA Membership. -Employee discount for mechanical work at our Service Center. -Employee discount on tires. -Uniforms. -Paid Vacation. If you feel you would be a good addition to our team, then please apply today!! AE Towing 1705 Silverton Rd NE Salem, OR 97301 AEtowingsalem.com FULL-TIME · $1,500 - $2,000 / WEEK · SALEM, OREGON Class A CDL Driver $6k Sign-on bonus Apply now", "grouping_count": 0}]