[{"id": 464414545696703, "advertiser_name": "Iowa Civil Contracting", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["464414545696703_00.jpg"], "ad_text": "Iowa Civil Contracting Sponsored Full-Time Field Mechanic to perform a variety of duties designed to service, repair and maintain equipment and Vehicles at different job locations. Starting Pay at $25-$29 based on experience. Per Diem $50 per day when out in the field. Truck for travel, fuel & Hotel provided by Iowa Civil Contracting. CDL Preferred. We utilize E-Verify. • Perform repair and maintenance duties assigned by supervisor. • Ensures equipment preventive maintenance is performed timely, thoroughly, and correctly. • Must be willing to travel up to 75% of the time. Travel expenses are provided by Iowa Civil Contracting. • Maintain a valid Driver’s License and acceptable driving record. • Must have ability to work with a team, in a constructive manner. • Willingness to perform duties outside the normal scope of work (in the field, outside normal hours, etc.). • Perform a full range of repair and modification work on heavy equipment vehicles to include but not limited to trucks, backhoes, loaders, diesel trucks, and miscellaneous equipment. • Determines nature and extent of repairs required, performs major and minor repair on engines, power transmissions, transfers and related electrical, fuel, and hydraulic components. To the best of their ability. • Uses technical manuals and other publications to identify and order repair parts. • Operates and inspects machines or equipment to diagnose defects. • Examines parts for damage or excessive wear • Tests repaired equipment to ensure operating efficiency before being released to work. • Must consistently keep area clean & organized to promote professionalism, safety, and efficiency. • Must have urgency to make safety the main priority while working on equipment and ensuring all equipment released to the field meets or exceeds all DOT standards. • Work at our shop in Victor IA in the winter months to prepare trucks and equipment for the following construction season. Benefits Medical Insurance Dental Insurance Vision Insurance Life Insurance Vehicle Provided • Wage based on experience • Must be able to pass a pre-employment drug screen. FULL-TIME · $25 - $29 / HOUR · VICTOR, IOWA Field Mechanic Apply now", "grouping_count": 0}, {"id": 703818444746224, "advertiser_name": "Iowa Civil Contracting", "status": "Active", "date": "01/04/2023", "ad_url": [], "image_save_path": ["703818444746224_00.jpg"], "ad_text": "Iowa Civil Contracting Sponsored The Paving Superintendent is responsible for all concrete paving and field operations including scheduling, safety, production, and work quality. Key Responsibilities & Duties: Superintendent • Works with project management regarding project schedules, equipment needs, and personnel needs. • Execution (build) of the job delivering a quality project on time and on budget • Oversee, motivate, direct, and train employees on all aspects of the assigned job. • Maintain company confidentiality. • Responsible for the crew’s overall fleet of equipment including maintenance, repairs, security, and cleanliness. • Perform minor diagnostics and repairs. • Superintendents require whatever work hours are necessary to fulfill his or her responsibilities. • Manage foremen and crew members o Communication daily o Ensure employee training (safety, EEO, equipment operation) is completed and documented as required. o Ensure daily timecards and field production reports are completed timely and accurately o Record daily activities throughout the duration of the project. o Hold accountable for delivering quality project on time and on budget o Assist in hiring of crew members • Establishing a culture of safety first o Conduct weekly “toolbox safety meetings.” o Address Safety concerns with Project and Company Management • Meeting with city, county, or state (owner of the project) to manage and maintain a positive relationship • Assists the project manager in directing and coordinating the work of all subcontractors. • Assists the project manager in ordering and securing all construction materials. • Ensure all MSDS and HAZMAT compliance documentation is properly maintained. Additional Tasks • Understand and enforce company policies and safety procedures as outlined in the Iowa Civil Contracting Safety and Employee Guide. • Winter Maintenance Support of equipment • Take on additional tasks as needed Skills Required: • Demonstrated success in leading people • Demonstrated motivation to produce safe, quality work. • Demonstrated process improvement skills • Excellent written and verbal communication skills • Excellent teamwork skills • Proven ability to hold teams accountable • Must be able to travel 100% of the time Education / Experience / Certificates Required: • Preferred 10 years of experience in the industry • Maintain a valid Driver’s License and acceptable driving record. • Construction education beneficial FULL-TIME · $70,000 - $100,000 / YEAR · VICTOR, IOWA Paving Superintendent Apply now", "grouping_count": 0}]