[{"id": 1839044706482193, "advertiser_name": "Medilodge of Alpena", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.MediLodgeofAlpena.com%2FCareers&h=AT0HSLtPS2A7cW1X92pxGZjve-sMi2tAd2wpLOG64hPtajk6FUVhn8QJq_gRJEmaMTtQIL2U__PGMak7Bbrcx_QY7ebsR_6_tSmnwDe8ViMWwS6arR66g9qFbCisXpbq2wrepKMkVwTR4pjCW5NEsUx5gR5HT-7knlHiDhDTukY"], "image_save_path": ["1839044706482193_00.jpg"], "ad_text": "Medilodge of Alpena Sponsored MediLodge of Alpena is NOW HIRING! Start the New Year 2023 in a New Career! Are you looking for longevity and career growth? Well look no further! We are proud to be part of a large MediLodge portfolio of 50 facilities that provide unlimited growth opportunities, also making us a leading healthcare provider in Michigan! MediLodge of Alpena is looking for compassionate and caring Registered Nurse Unit Manager or Licensed Practical Nurse Unit Manager to join our team! We are offering leading market wages and a generous sign on bonus! At MediLodge of Alpena we are proud of our tenured staff and greatly appreciate their years of service and commitment to our residents. We are a small community who loves to serve our residents and staff. Click Here to Apply (through your Chrome or Firefox browser) – www.MediLodgeofAlpena.com/Careers Send Your Resume to Cheryl: collila@MediLodge.com #Hiring #Fulltime #RN #RegisteredNurse #LPN #RNUnitManager #LPNUnitManager #ChargeNurse #NurseSupervisor #Medilodge #Alpena #Michigan", "grouping_count": 0}, {"id": 865720204681294, "advertiser_name": "Medilodge of Alpena", "status": "Active", "date": "01/17/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.MediLodgeofAlpena.com%2FCareers&h=AT2fguK2x5IhGnT6_UcNoJUfUBXWHMp49nMPY8UqkvPJKHytZn76hheXRxTo1pS0VvYIbGaQOkUcnDWgtCKvCKT479IJj6fJ1jnnbRA1PhyeyqhqVRPL8RuJgtF5-SGSPafor7Y2vvrZ-x03XyB2PjmZCjs6Q8PgRyIIQ0U2vcY"], "image_save_path": ["865720204681294_00.jpg"], "ad_text": "Medilodge of Alpena Sponsored MediLodge of Alpena is NOW HIRING! Start the New Year 2023 in a New Career! Are you looking for longevity and career growth? Well look no further! We are proud to be part of a large MediLodge portfolio of 50 facilities that provide unlimited growth opportunities, also making us a leading healthcare provider in Michigan! MediLodge of Alpena is looking for compassionate and caring Full-Time Registered Nurses (RN), Licensed Practical Nurses (LPN), and Certified Nursing Assistants (CNA), such as you, to join our team! We are offering leading market wages and GENEROUS sign on bonuses! At MediLodge of Alpena we are proud of our tenured staff and greatly appreciate their years of service and commitment to our residents. We are a small community who loves to serve our residents and staff. Click Here to Apply (through your Chrome or Firefox browser) – www.MediLodgeofAlpena.com/Careers Send Your Resume to Cheryl: collila@MediLodge.com #Hiring #Fulltime #RN #RegisteredNurse #LPN #LicensedPracticalNurse #CNA #CertifiedNursingAssistant #Medilodge #Alpena #Michigan", "grouping_count": 0}]