[{"id": 574995197481415, "advertiser_name": "TruFit Staffing", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["574995197481415_00.jpg"], "ad_text": "TruFit Staffing Sponsored We need Forklift/ Electric Pallet Jack Operators to start as soon as possible! You will be a key player in assisting the Warehouse team maintain delivery times, tracking inventory, and the overall function and organization of the warehouse. Looking for immediate availability! This is a contract to hire position Shift: Day Tuesday-Saturday 8:00a-4:30pm Location: Tacoma, WA Comp: $20 per hour, increases and benefits available upon conversion! Responsibilities: -Operate forklift and other hand truck / electric pallet jack applications *Double Stack Forklift experience a plus! -Use wireless RF scanning equipment to ensure accuracy of inventory -Adhere to quality standards as directed by management -Pick, wrap, and stage orders to be shipped -Inspect and identify hazards on the forklift -Working SAFELY is a priority, ability to recognize and fix safety hazards necessary -Experience using a lift gate -Load/ Unload without using a dock -Ability to maneuver pallets in a circle without damaging products. Qualifications: - 3 to 4 years experience operating an electric pallet jack/ sit down forklift. -Forklift certification preferred -Strong understanding of OSHA regulations -Successful completion of Drug Screening & Background Check TruFit Staffing is an equal opportunity employer and does not unlawfully discriminate on the basis of race, sex, age, color, religion, national origin, marital status, veteran status, sexual orientation, or any other basis prohibited by federal, state, or local law. FULL-TIME · $19 - $20 / HOUR · FIFE, WASHINGTON Forklift Operator Apply now", "grouping_count": 0}, {"id": 473078548177456, "advertiser_name": "TruFit Staffing", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["473078548177456_00.jpg"], "ad_text": "TruFit Staffing Sponsored We are hiring general warehouse associates for several clients! Ideal candidates will have experience receiving and staging freight, picking and packing orders (RF), the ability to lift 50- 70 lbs routinely, excellent and verifiable attendance at past employment, reliable transportation, willing to work over-time / positive and cooperative attitude. Location: Fife, WA /Tacoma, WA/Sumner, WA Shift: Varies. Day/Swing available Compensation: $17-20 to start Primary responsibilities will be in the warehouse staging freight, pulling orders and helping load trucks using material handling equipment such as standard forklifts, electric pallet jacks, etc. Comfortable working on a conveyor processing items, lifting and manipulating 30-50lbs on a regular basis. Safety toed shoes required on site. TruFit Staffing is an equal opportunity employer and does not unlawfully discriminate on the basis of race, sex, age, color, religion, national origin, marital status, veteran status, sexual orientation, or any other basis prohibited by federal, state, or local law. FULL-TIME · $17 - $20 / HOUR · FIFE, WASHINGTON Warehouse Worker Apply now", "grouping_count": 0}]