[{"id": 1363692134366132, "advertiser_name": "Nursetel", "status": "Active", "date": "01/27/2023", "ad_url": [], "image_save_path": ["1363692134366132_00.jpg"], "ad_text": "Nursetel Sponsored Job Located in Panama City Pay 14 - 16 per hour with at least five years agency experience and a dependable work record nursetel serves to assist clients in gaining their independence. Join the best in home care. As the most valuable part of nursetel you will serve as life-changing and angel to our clients and their families,. You provide JOY everyday. nursetel serves patients from the comfort of their own homes and improves the lives of our beautiful clients on a daily basis. If you are ready to change lives call Shelia in recruiting at 850 252 4312 Job ID Panama City Job Location: Panama City Category: Home Health Aide Date Posted: Today PAY RATE: 14 - 16 per hour NURSETEL Home Health Care is currently seeking an experienced Home Health Aide, HHA or Nurses Aide, CNA for a full time or part time opportunity to complete home care visits to clients located throughout Florida YOU CHOOSE WHERE YOU WORK ALWAYS If you are ready to change lives call Shelia in recruiting at 850 252 4312 NURSETEL offers: * The most competitive salaries for home care within the state. * Flexible scheduling to fit your lifestyle You have total choice in where you work * Short commute times – we try to match you to opportunities near your home * Travel positions are also available * Positive work environment -We accept zero negativity * A stable working environment 24 / 7 on call manager support * PPE provided at your local office If you are ready to change lives call Shelia in recruiting at 850 252 4312 As an accredited, regulated, certified, and licensed home care provider, NURSETEL Global Health complies with all state/local mandates. NURSETEL Global Health is an Equal Opportunity Employer. We Believe the heart does not lie and look for anyone who is qualified and has the necessary experience to care for others. All employment decisions are made on a non-discriminatory basis without regard to sex, race, color, age, disability, pregnancy or maternity, sexual orientation, gender identity, citizenship status, military status, or any other similarly protected status in accordance with federal, state and local laws. Hence, we strongly encourage applications from people with these identities or who are members of other marginalized communities. Your Heart and experience is all that matters If you are ready to change lives call Shelia in recruiting at 850 252 4312 START TOMORROW CALL US TODAY FULL-TIME · $14 - $16 / HOUR · PANAMA CITY BEACH, FLORIDA Caregiver Panama City & Surrounding areas Apply now", "grouping_count": 0}, {"id": 678027490770668, "advertiser_name": "Nursetel", "status": "Active", "date": "01/27/2023", "ad_url": [], "image_save_path": ["678027490770668_00.jpg"], "ad_text": "Nursetel Sponsored Pay 14 - 16 per hour with at least five years agency experience and a dependable work record Part Time Position in Pensacola Florida nursetel serves to assist clients in gaining their independence. Join the best in home care. As the most valuable part of nursetel you will serve as life-changing and angel to our clients and their families,. You provide JOY everyday. nursetel serves patients from the comfort of their own homes and improves the lives of our beautiful clients on a daily basis. If you are ready to change lives call Shelia in recruiting at 850 252 4312 Job ID Pensacola Florida Category: Home Health Aide Date Posted: Today PAY RATE: 14 - 16 per hour Pensacola Florida NURSETEL Home Health Care is currently seeking an experienced Home Health Aide, HHA or Nurses Aide, CNA for a full time or part time opportunity to complete home care visits to clients located throughout Florida YOU CHOOSE WHERE YOU WORK ALWAYS If you are ready to change lives call Shelia in recruiting at 850 252 4312 NURSETEL offers: * The most competitive salaries for home care within the state. * Flexible scheduling to fit your lifestyle You have total choice in where you work * Short commute times – we try to match you to opportunities near your home * Travel positions are also available * Positive work environment -We accept zero negativity * A stable working environment 24 / 7 on call manager support * PPE provided at your local office If you are ready to change lives call Shelia in recruiting at 850 252 4312 As an accredited, regulated, certified, and licensed home care provider, NURSETEL Global Health complies with all state/local mandates. NURSETEL Global Health is an Equal Opportunity Employer. We Believe the heart does not lie and look for anyone who is qualified and has the necessary experience to care for others. All employment decisions are made on a non-discriminatory basis without regard to sex, race, color, age, disability, pregnancy or maternity, sexual orientation, gender identity, citizenship status, military status, or any other similarly protected status in accordance with federal, state and local laws. Hence, we strongly encourage applications from people with these identities or who are members of other marginalized communities. Your Heart and experience is all that matters If you are ready to change lives call Shelia in recruiting at 850 252 4312 START TOMORROW CALL US TODAY PART-TIME · $14 - $16 / HOUR · PENSACOLA, FLORIDA Caregiver & Housekeeper PENSACOLA Apply now", "grouping_count": 0}]