[{"id": 1121401251864217, "advertiser_name": "HCA Gulf Coast Division Careers", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fcareerevents.hcahealthcare.com%2Fjobs%2F11904428-the-womans-hospital-of-texas-hiring-event-february-7-10am%3Fcampaign_id%3DzLNTF9c02KiqvbPwYfQBNg%26bid%3D2830&h=AT1RRWMvoyISVc-QweVY8YqxcWPFyOw2PfIfkEjudtEWoqKnkqzQObCMpLrdVmCX3QmD7fXyteCuXjsOTgF6H0XiX5P3_Hdj1lXOtfqewBVyWrdIUeAn9Uwts9zBt3Y4BNyU81ifeQYC-0OM5sh65g5QZaOrT4bD8lxp4Z39gII"], "image_save_path": ["1121401251864217_00.jpg"], "ad_text": "HCA Gulf Coast Division Careers Sponsored Are you ready to bring your healthcare career dreams to life? The Woman's Hospital of Texas is hiring and we would love to meet you! Experienced and new graduate registered nurses, licensed vocational nurses, registered respiratory therapists, ultrasound technologists, MRI technologists, CT technologists, medical laboratory techs, surgical techs, and pharmacy techs are invited to learn more about the opportunities, benefits and career pathways available when you join our team. We're looking forward to meeting candidates at all stages of their careers from entry-level through leadership at our upcoming hiring event on Tuesday, February 7, from 10 a.m. to 2 p.m. Register today to discover the opportunities we have waiting for you! #HCAcareers #UnlockPossibilities #HiringEvent CAREEREVENTS.HCAHEALTHCARE.COM The Woman's Hospital of Texas Hiring Event | February 7 - 10am in Houston, Texas, United States The Woman's Hospital of Texas Hiring Event | February 7 - 10am in Houston, Texas, United States Sign up", "grouping_count": 0}, {"id": 435127248750014, "advertiser_name": "HCA Gulf Coast Division Careers", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fcareerevents.hcahealthcare.com%2Fjobs%2F11827332-hca-houston-healthcare-clear-lake-hiring-event-february-2-10am%3Fcampaign_id%3Dgaa4CM2YjjjSaKG3AlA5QQ%26bid%3D2830&h=AT1RRWMvoyISVc-QweVY8YqxcWPFyOw2PfIfkEjudtEWoqKnkqzQObCMpLrdVmCX3QmD7fXyteCuXjsOTgF6H0XiX5P3_Hdj1lXOtfqewBVyWrdIUeAn9Uwts9zBt3Y4BNyU81ifeQYC-0OM5sh65g5QZaOrT4bD8lxp4Z39gII"], "image_save_path": ["435127248750014_00.jpg"], "ad_text": "HCA Gulf Coast Division Careers Sponsored Ready to make a change in your career? It's a great time to join HCA Houston Healthcare Clear Lake! Experienced and new graduate registered nurses, physical therapists, speech language pathologists (PRN), medical technologists, pharmacists, pharmacy techs, CT techs and surgical techs are invited to learn more about the opportunities, benefits and career pathways available when you join our team. We're looking forward to meeting candidates at all stages of their careers from entry-level through leadership. Join us at our hiring event on February 2 to meet with our hiring managers and talent acquisition team. RSVP now! CAREEREVENTS.HCAHEALTHCARE.COM Join Our Team at HCA Houston Clear Lake HCA Houston Healthcare Clear Lake Hiring Event | February 2 - 10am in Webster, Texas, United States Sign up", "grouping_count": 0}, {"id": 573804450864812, "advertiser_name": "HCA Gulf Coast Division Careers", "status": "Active", "date": "01/12/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fcareerevents.hcahealthcare.com%2Fjobs%2F11754483-hca-houston-healthcare-starn-hiring-meet-and-greet-february-1-5pm%3Fcampaign_id%3D0TcjrG8JU6StTygK8SxbMA%26bid%3D2830&h=AT1RRWMvoyISVc-QweVY8YqxcWPFyOw2PfIfkEjudtEWoqKnkqzQObCMpLrdVmCX3QmD7fXyteCuXjsOTgF6H0XiX5P3_Hdj1lXOtfqewBVyWrdIUeAn9Uwts9zBt3Y4BNyU81ifeQYC-0OM5sh65g5QZaOrT4bD8lxp4Z39gII"], "image_save_path": ["573804450864812_00.jpg"], "ad_text": "HCA Gulf Coast Division Careers Sponsored HCA Houston Healthcare is hosting a Meet and Greet on Wednesday, February 1, from 5 p.m. to 8 p.m. at The Springs Event Venue. We are inviting new graduate registered nurses to join our nurse hiring managers and talent acquisition team to learn more about the opportunities, benefits and career pathways available to new nurse residents across a variety of specialties in our North Houston area hospitals. We will be interviewing for open positions at the following locations: HCA Houston Healthcare Northwest HCA Houston Healthcare North Cypress HCA Houston Healthcare Kingwood HCA Houston Healthcare Conroe HCA Houston Healthcare Tomball Registration is required for this event. RSVP today! CAREEREVENTS.HCAHEALTHCARE.COM HCA Houston Healthcare North Houston Quadrant StaRN Hiring Meet & Greet | February 1 - 5pm in Houston, Texas, United States HCA Houston Healthcare North Houston Quadrant StaRN Hiring Meet & Greet | February 1 - 5pm in Houston, Texas, United States Sign up", "grouping_count": 0}]