[{"id": 564916878884608, "advertiser_name": "Randy's Auto Care", "status": "Active", "date": "01/24/2023", "ad_url": ["#", "https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.indeedjobs.com%2Frandys-autocare%2F_hl%2Fen_US%3Fcpref%3DJXWAtnzf3XW5aRnY2g_zos_1WAXHb5RLVUfbozPS89M&h=AT1XQEI0GSSuqi0SiOWqPZzHq38da0pMiANJVJqPuo_1W-0KBgvCexnxYdWegW-ohobZzXSfjoe3co352JG-OE2r2JykcJ0_eomjLAgwNKvEXSHmqEnFtktKkQoS1yoMJue-CzZ4WWesqIJOu0DuKkh3H2ELVTwAoKcbs1jcOJ8"], "image_save_path": ["564916878884608_00.jpg"], "ad_text": "Randy's Auto Care Sponsored Looking for a home, not just a job? Looking for a brand new opportunity at a busy shop with a family atmosphere and lots of opportunity for growth? Then… THIS OPPORTUNITY IS FOR YOU! - We Believe in Trust - We Believe in Professionalism and Quality - We Believe in Quality of Life - We Believe in a positive work environment (BE PART OF A TEAM – NOT JUST A NUMBER IN A BIG COMPANY) Randy’s Auto Care is a family-owned and operated full-service general repair shop providing expert auto and light truck repair and maintenance services to customers of the Littleton, CO area. We are looking for the right Lube Technician to add to our family. We are currently looking for a skilled LUBE TECHNICIAN who takes pride in their work. We are looking for techs that know what it takes to succeed in our fast-paced industry. If you have what it takes to win and are looking for a good shop, send us your resume today, let’s talk. JOB REQUIREMENTS: ✓ Perform oil changes ✓ Perform vehicle safety inspections ✓ Under the hood – check the belts, hoses, air filters, etc. ✓ Under the vehicle – check for leaks, check brakes, suspension and the rest of the vehicle ✓ Have an individual and teamwork ethic ✓ Have a valid driver’s license and own vehicle WE OFFER: ✓ Health insurance (50% paid after 90 days) ✓ A great working environment ✓ A Monday - Friday work schedule with weekends off ✓ Lots of variety in the types of work we run into ✓ Family owned and family atmosphere where you are appreciated, not just a number At Randy’s Auto Care, we love people and you’ve have found a HOME, not a job. If you are interested in applying, visit our career page on https://www.indeedjobs.com/randys-autocare/_hl/en_US?cpref=JXWAtnzf3XW5aRnY2g_zos_1WAXHb5RLVUfbozPS89M Or email your resume to randysautocare5@aol.com #AutoRepair#CarRepair#Mechanic#Diagnostics#Technician#Cars#Jobs#AutoMechanic #AutoTechnician #LubeTech FULL-TIME · LITTLETON, COLORADO Automotive Lube Technician for Family-Owned Shop (New Opportunity!) Apply now", "grouping_count": 0}]