[{"id": 754400442913111, "advertiser_name": "Capacity Transport", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["754400442913111_00.jpg"], "ad_text": "Capacity Transport Sponsored We are a flatbed heavy haul trucking company based in Dearborn, Michigan seeking a heavy duty truck/trailer mechanic to do maintenance work on trucks and trailers. Starting pay is up to $28 providing you meet the qualifications with certification and chauffeur's license or CDL-A. This is a full time hourly position with top hourly pay (based on experience), health insurance, dental insurance, optical insurance, paid vacation, work uniforms, with Aflac Insurance and 401K available. Applicant must have some experience in mutil-axle truck/trailer repair and their own tools. Applicants should apply through FB email with resume attached. 1. Based in Dearborn, Mi. 2. Full time hourly position 40 hours per week minimum. 3. Blue Cross Health Insurance with employee co-pay (after 60 days). 4. Delta Dental Insurance with employee co-pay (after 60 days). 5. Optical Insurance with employee co-pay (after 60 days). 6. 7-Paid Holidays. 7. Paid Vacation. 8. Direct Deposit. 9. Work Uniforms (upfront cost paid by company). 10. Aflac Insurance available. 11. 401K available. Applicants should apply through Facebook with resume attached. FULL-TIME · MELVINDALE, MICHIGAN Hiring Truck-Trailer Mechanic For Trucking Company Up To $28 PH Apply now", "grouping_count": 0}, {"id": 898944854860314, "advertiser_name": "Capacity Transport", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["898944854860314_00.jpg"], "ad_text": "Capacity Transport Sponsored Come join a winning team! Capacity Logistics of Jeffersonville Indiana is looking for a few flat bed company drivers with CDL-Class A license or owner operators with acceptable driving record to haul steel coil products on flat bed multi 6 axle trailers and tandem spread trailers. We have late model equipment and sliding tarp system on trailers. The images above is typical of what our units look like. We will train new drivers. Capacity Logistics is a very well established flatbed heavy haul steel carrier based in Melvindale Michigan for over 6 decades and launched our new terminal in Jeffersonville Indiana October 1, 2015 serving many local customers in the Indiana area. This is a full time position with top driver pay, full health insurance benefit package, direct deposit weekly, usually no lay overs and home every night. 1. Top Driver Percentage Pay 2. Based In Jeffersonville Indiana 3. Full Time Driving Position With In House Truck Maintenance Facility 4. Blue Cross Blue Shield Health Insurance (after 60 days with employee co-pay) 5. Blue Cross Blue Shield Optical Insurance (after 60 days with employee co-pay 6. Delta Dental (after 60 days with employee co-pay) 7. 7 Paid Holidays 8. 1 or 2 Weeks Paid Vacation (varies by hire date) 9. 401K Available 10. Driver Uniforms (upfront costs paid by the company) 11. Cell Phone Allowance 12. CDL-A Required With Good Driving Record 13. Home Most Nights With Usually No Layovers 14. Weekly Direct Deposit 15. Modern Equipment With Sliding Tarp Systems FULL-TIME · CLARKSVILLE Hiring Clarksville, IN Based CDL-A Flatbed Drivers For Steel Hauling Apply now", "grouping_count": 0}, {"id": 940504197125037, "advertiser_name": "Capacity Transport", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["940504197125037_00.jpg"], "ad_text": "Capacity Transport Sponsored Are you fresh out of driving school or driving a stake truck? We offer paid training and can teach you a career in hauling flatbed products. We are a flatbed heavy haul steel carrier based in Dearborn Michigan looking for drivers for new graduates from driving school or stake truck drivers. Must have CDL-A and acceptable driving record. We haul various steel commodities specializing on steel coils, steel skids, and blanks through out Michigan. This is a full time position with top driver percentage pay with a premium benefit package listed below. Our drivers are home most nights with no layovers or weekends. We have all modern equipment and all 8 axle trailers have sliding tarp systems with no side kits. You can earn $60,000 to $78,000 per year with a full premium benefit package as outlined below once you complete our paid training program. Applicants should apply through with resume attached. 1. Top driver percentage pay 2. Blue Cross PPO health insurance (after 60 days with co-pay) 3. Blue Cross PPO optical insurance (after 60 days with co-pay) 4. Delta Dental Insurance (after 60 days with co-pay) 5. 7 Paid holidays 6. 1 or 2 weeks paid vacation (varies by hire date) 7. Driver uniforms (upfront costs paid by the company) 8. Monthly cell phone allowance 9. Direct deposit 10. 401K available 11. Aflac insurance available 12. Driver referral bonus 13. Home nights/weekend Applicants should apply with resume attached. FULL-TIME · MELVINDALE, MICHIGAN Hiring CDL-A Flatbed Drivers-No Experience We Offer Paid Training Apply now", "grouping_count": 0}]