[{"id": 848392186468395, "advertiser_name": "Orr Truck Center of Yell County", "status": "Active", "date": "01/20/2023", "ad_url": [], "image_save_path": ["848392186468395_00.jpg"], "ad_text": "Orr Truck Center of Yell County Sponsored Make $40,000 up to...the sky is the limit!! Promotions into Management from within!! Accelerate your income in 2020! Sell Chrysler, Dodge, Jeep & Ram trucks, Hyundai & Nissan-the TOP SELLING brands in the Arkansas River Valley area! Orr Chrysler, Dodge, Jeep, Ram, Hyundai & Nissan, 3215 E Main Street, Russellville, Arkansas 72802 NEEDS YOU NOW!! Get in on the ground floor of Orr Auto Mall ...selling the most exciting automotive brands and working for a family owned, family friendly owner with its automotive heritage beginning in the 1920's! If you’ve ever considered selling automobiles but don't have experience...this is a rare opportunity to be professionally trained for free! The automotive sales business is on fire...it's a record setting year that just continues to get better and we need to hire a select number of highly motivated individuals to handle our outstanding floor and internet traffic! No experience required-we will professionally train you for success! Orr Chrysler, Dodge, Jeep, Ram, Hyundai & Nissan, 3215 E. Main Street, Russellville, Arkansas 72802 needs to hire the BEST OF THE BEST! Massive year over year sales growth dictates an expansion of our professional sales team immediately! Our business is booming- APPLY NOW! NO EXPERINCE REQUIRED We offer virtual and in-store training. Our strong, experienced management staff will coach and train you to go to the top-no more living paycheck to paycheck! It all starts with you! We hire and promote from within, with the guarantee if you work hard you will earn the opportunity to move up! Work in a fast paced, “fun to come to work” sales environment on the HIGH TRAFFIC, HIGH VOLUME corridor on Main Street in Russellville, Arkansas. Do you thrive on the latest technology? Are you goal driven and enjoy being rewarded for a job well done? Are you results oriented, self-starting and enjoy a fast-paced environment with the opportunity to grow within the company? We offer numerous opportunities for skilled candidates that share our passion to commitment, service, and quality. If you’re a motivated person who believes in being at the top of their game and contributing to the overall success of the organization, we want to meet you! Top performers in these positions earn $100,000 plus annually… 5-day work week NO SUNDAYS! This is a FULL-TIME position NOT part-time. Responsibilities: Sales Consultants/Associates/Professionals take the customers through a thorough buying process supported by established selling steps, policies and procedures Develop and relay a high level of product knowledge around vehicle features Demonstrate operation of vehicle in showroom and via test drive Provide new vehicle to customer through established delivery process, ensuring that the customer understands the vehicle's operating features, warranty and paperwork Maintain an owner follow-up system that encourages repeat and referral business and contributes to customer satisfaction, loyalty and long-term clientele Develop a prospecting system, making calls and sending emails to potential customers to set appointments Close Deals! Qualifications: Minimum high school diploma or GED equivalent required 2-5 years sales and customer service experience preferred, but not required Automotive sales background preferred Excellent customer service, organizational and negotiation skills Self-motivated, goal-oriented and enthusiastic presence in a team environment Strong written and communication skills Working knowledge of Microsoft Office Consistent and stable work history Valid driver’s license required and clean driving record Professional appearance and work ethic All potential employees must pass pre-employment testing including a background check and drug screen. Benefits: We believe in building a long-term relationship with all our employees We promote to management from within based on sales & customer satisfaction performance New hire orientation Paid training & development Career growth opportunities Medical and dental coverage available after waiting period Paid vacation Schedule your confidential interview NOW! Scheduled interviews only…NO WALK-INS please. Interviews will be held in the Interviews will be held Wenesday-Friday, February 5th, 6th, and 7th. You must DRESS for SUCCESS! COLLEGE GRADS WELCOME! Bi-Lingual is a PLUS! NO STUDENTS (unless you are taking online classes) This is a full-time job– NOT a PART-TIME JOB Professionally dress for your interview… NO JEANS! FULL-TIME · RUSSELLVILLE, ARKANSAS Sales Professional Apply now", "grouping_count": 0}]