[{"id": 579007273702080, "advertiser_name": "Navy Recruiter Smith", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Finstagram.com%2Fnavyrecruitersmith&h=AT29qbjM2yzgDmRv_7MM9KnyIy8eu1ei24JqX1ioQQ8CbMMPfrOC89AkGs0QF8KrLYxH1M4nfxtfUseKVToecRvKYsg6Z4t3g2H9E3yKUijrVesxZvYIOIjYUnU-otY8UUsP_Y5XizODOcZ23DBQHxvCbZelnqHIuKGDbrlZ4mk"], "image_save_path": ["579007273702080_00.jpg"], "ad_text": "Navy Recruiter Smith Sponsored For questions and information on how to join the Navy, I'm available at 562-207-7352. Give me a call! . . . . #NavyRecruiterSmith #USNavy #FuturePlanning #MilitaryLife #USMilitary #Montebello #Hiring #careergoals INSTAGRAM.COM Navy Recruiter Smith Send message", "grouping_count": 0}, {"id": 1177071716530423, "advertiser_name": "Navy Recruiter Smith", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Finstagram.com%2Fnavyrecruitersmith&h=AT29qbjM2yzgDmRv_7MM9KnyIy8eu1ei24JqX1ioQQ8CbMMPfrOC89AkGs0QF8KrLYxH1M4nfxtfUseKVToecRvKYsg6Z4t3g2H9E3yKUijrVesxZvYIOIjYUnU-otY8UUsP_Y5XizODOcZ23DBQHxvCbZelnqHIuKGDbrlZ4mk"], "image_save_path": ["1177071716530423_00.jpg"], "ad_text": "Navy Recruiter Smith Sponsored Interested in the medical field? Send me a DM to learn more. Hospital Corpsmen assist health care professionals in providing medical care to Navy personnel and their families. They may function as clinical or specialty technicians, medical administrative personnel and healthcare providers at medical treatment facilities. Specifically, Hospital Corpsmen may be called upon to: ✔️Perform emergency medical treatment on SEALs, Seabees, Marines and other military personnel injured in the field, as well as on Sailors aboard ships or aircraft ✔️Perform emergency dental treatment as well as construct dental crowns and bridges, process dental X-rays and operate X-ray equipment Serve as an operating room technician for general and specialized surgery ✔️Help administer a wide range of preventive care and medications, including immunizations and intravenous fluids ✔️Conduct physical examinations and assisting in the treatment of diseases and injuries Supervise sanitation and safety conditions in the workplace ✔️Maintain patient treatment records, conduct research and perform clinical tests ✔️Assist Navy Physicians and Nurses in a variety of medical fields, including, but not limited to: radiology, physical therapy, phlebotomy, dental, surgery, family medicine, pathology, women’s health and more. Ask about our bonuses. Click the link in my bio and let's chat today. INSTAGRAM.COM Navy Recruiter Smith Send message", "grouping_count": 0}]