[{"id": 859826801802463, "advertiser_name": "CoMo Premium Exteriors", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["859826801802463_00.jpg"], "ad_text": "CoMo Premium Exteriors Sponsored Experienced Window Installer Needed – No Overnight Travel Required. Aggressive pay, flexible time, truck, gas and insurance provided. If you are an expert when it comes to measuring and installing windows then it is time you get paid what your worth. CoMo Premium Exteriors is growing rapidly in all areas, but especially in the area of windows. We have a full time, year-round position for the right person to help us manage our window installation experience for our customers. This position will be responsible for measuring windows that have been sold, communicating with the customer to arrange the installation schedule, and performing the window installation (with support as needed). As we continue to grow our window sales this position will grow with it and eventually be responsible for managing other installation crews in the future. Why Work for CoMo? Our pay structure is very aggressive, and we provide the truck, gas, insurance, trailer, and phone. You provide the experience and the hustle. Since we are the leading exterior renovation company in Mid-Missouri, we have consistent work, year-round. However, experienced installers will find they can make full time money working 4 days a week. We have a great team focused on continual improvement, professionalism, and personal accountability. We work hard, but we also have fun together. We strive to create a great experience for our customer – and that comes from having great people representing us. Project Types The majority of our projects are residential homes, 2 stories or less, and most are located in Columbia or within 30 minutes of Columbia. We sell only a select few quality window and door brands that we know have consistent performance. Who Should Apply Anyone who is reliable and wants to build a career at a stable growing company. We believe in teamwork and we want you to succeed and be a long-term member of our team. Job Requirements · Must have valid Driver’s License · Must be able to work typical hours of 7:00 am to 3:30 pm, Monday through Friday · Must arrive on time for work · Must have proven experience installing windows and doors Job Benefits • Company vehicle (gas and insurance covered) • Company cell phone (plan covered) • Simple IRA retirement plan with company match • Paid every Friday • Monthly reimbursement of qualified Health insurance premiums (for qualified plans) • Company Logo Apparel • Bonuses based on performance • Great people to work with and more! About the Company CoMo Premium Exteriors is the leading residential and commercial exterior restoration and renovation company in Mid-Missouri. Founded in 2010, the company grew from humble beginnings by focusing on customer service and by building a knowledgeable team that is appreciated and valued. Today, as the local market leader, we have 20 employees and 4 locations with a focus on continued expansion. Equal Employment Opportunity Policy CoMo Premium Exteriors provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, marital status, veteran status, sexual orientation, political affiliation, national origin, age, disability or genetics. In addition to federal law requirements, CoMo Premium Exteriors complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, leaves of absence, compensation and training. FULL-TIME · $55,000 - $75,000 / YEAR · COLUMBIA, MISSOURI Window Installer / Window Dept. Manager Apply now", "grouping_count": 0}]