[{"id": 557762416403879, "advertiser_name": "Tennessee Cancer Specialists", "status": "Active", "date": "01/21/2023", "ad_url": [], "image_save_path": ["557762416403879_00.jpg"], "ad_text": "Tennessee Cancer Specialists Sponsored We can’t do it without YOU! Do you want to apply your experience, skills and education in a way that makes a meaningful and lasting difference in the lives of our patients and their families? At Tennessee Cancer Specialists, it is the privilege of our employees to walk with our patients and their families as they move along the journey of fighting cancer. Whether you are working directly with patients in one of our clinics or in a support role, you are an important part of our mission to deliver the highest quality, compassionate care. Our 200+ employees make up the teams at our 15 different East Tennessee locations and have helped us achieve the Top Workplaces award two years running for the greater Knoxville area! As a member of the Charge Entry team, you will assist the central billing office with entering office and hospital charges as part of the revenue cycle process for Tennessee Cancer Specialists. Here's what might happen on a typical day… You are entrusted with a great deal of responsibility in this role. You and your team members oversee reviewing all daily charges for completeness and accuracy. The revenue cycle process depends on the consistent and timely completion of your job duties. Experiences that matter… • Your attention to detail allows you to effectively review and identify charge form errors making necessary system corrections as needed through obtaining complete information from appropriate team members. • In conversations with patients, coworkers, and other professionals, you provide exceptional customer service through communicating respectfully, thoroughly listening to all shared details and asking any appropriate questions. • Your in-depth knowledge of coding guidelines allows you to identify inconsistencies during daily review of charges and audit of encounters against scheduled patients. You also understand the importance of communicating any inconsistencies upline. • Meeting deadlines is a priority for you. You are able to accurately post charges within 24 hours of charted encounter. • Your go-getter work ethic will have you ready to jump in and help out with any additional tasks. For your safety, keep this in mind: • The position will require sitting for long periods of time with occasional stooping, bending, and stretching for supplies. • Any lifting should be limited to 30 pounds or less. • You will need sufficient manual dexterity for operating office equipment (keyboard, telephone, copier, etc.), and vision and hearing must be adequate for viewing computer screens for prolonged periods of time and hearing customers during in-person and telephone conversations. We feel this position requires these basics: • A high school diploma or equivalent is required, but an associate’s degree in a business-related field would be even better! • Your proficiency with computer systems and Microsoft Office (Outlook, Word, Excel, etc.) is a must. • Lastly, we feel that you will be most successful with at least one year of prior experience in a similar position and a Certified Professional Coder (CPC) certification from AAPC or AHIMA to provide you with the background needed for this position. Prior experience with specialty billing is strongly preferred. EOE/M/F/D/V/SO. We are a Drug-free Workplace. FULL-TIME · KNOXVILLE, TENNESSEE Charge Entry Specialist Apply now", "grouping_count": 0}, {"id": 704840037912093, "advertiser_name": "Tennessee Cancer Specialists", "status": "Active", "date": "01/21/2023", "ad_url": [], "image_save_path": ["704840037912093_00.jpg"], "ad_text": "Tennessee Cancer Specialists Sponsored We can’t do it without YOU! Do you want to apply your experience, skills, and education to make a meaningful and lasting difference in the lives of our patients and their families? At Tennessee Cancer Specialists, it is the privilege of our employees to walk with our patients and their families as they move along the journey of fighting cancer. Whether you are working directly with patients in one of our clinics or a support role, you are an essential part of our mission to deliver the highest quality, compassionate care. Our 200+ employees make up the teams at our 16 different East Tennessee locations and have helped us achieve the Top Workplaces award two years running for the greater Knoxville area! As a Pre-Certification Specialist, you will assist our providers with obtaining prior authorization from various insurance carriers for ordered medications and treatments. Here’s what might happen on a typical day… In this Monday – Friday role, you use your expertise to obtain authorization for patient treatments and break down barriers that might prevent that authorization. Your customer service skills will allow you to respectfully communicate with our payors, ensuring there is no delay in the patient’s treatment plan. You will work alongside a team of dedicated individuals who will help you troubleshoot issues. As a point of contact for our clinic teams, you are responsible for fielding questions or assisting with additional needs. While it can be challenging to balance the persistence needed to work with various payors and the empathy required for our patients, your professionalism allows you to do just that! Experiences that matter… • Your knowledge of chemotherapy, immunotherapy, or other infusion treatment authorization requirements for all types of payors helps you stay ahead of the game when completing the pre-certification process • In conversations with patients, coworkers, and other providers, you provide exceptional customer service through communicating respectfully, thoroughly listening to all shared details, and asking any appropriate questions. • You can communicate and provide prompt feedback to physicians, management, and other clinical staff members regarding restrictions, special requirements, and other possible payor issues related to specific insurance plans • Maintaining a patient-focused mindset allows you to dig in and research alternative solutions to obtaining authorizations and recognize trends with specific treatments and payors • Your go-getter work ethic will have you ready to jump in and help out with any additional tasks. For your safety, keep this in mind: • The position will require sitting for long periods with occasional stooping, bending, and stretching for supplies in a business office setting. • Any lifting should be limited to 10 pounds or less. • You will need sufficient manual dexterity for operating office equipment (keyboard, telephone, copier, etc.). Vision and hearing must be adequate for viewing computer screens for prolonged periods and hearing in-person and phone conversations. We feel this position requires these basics: • A high school diploma or equivalent is required, but an associate’s degree in a business-related field would be even better! • Prior experience as a medical assistant or LPN will give you an edge. • Your proficiency with electronic health records, payor portals, and Microsoft Office (Outlook, Word, Excel, etc.) is a must. • Lastly, we feel that you will be most successful with at least one year of direct experience in a similar position (pre-certification, benefit financial counseling, benefits verification, referral specialist, medical assistant, LPN) to provide you with the background needed for this position. EOE/M/F/D/V/SO. We are a Drug-free Workplace. FULL-TIME · KNOXVILLE, TENNESSEE Pre-Certification Specialist Apply now", "grouping_count": 0}, {"id": 731860401642175, "advertiser_name": "Tennessee Cancer Specialists", "status": "Active", "date": "01/21/2023", "ad_url": [], "image_save_path": ["731860401642175_00.jpg"], "ad_text": "Tennessee Cancer Specialists Sponsored We can’t do it without YOU! Do you want to apply your experience, skills and education in a way that makes a meaningful and lasting difference in the lives of our patients and their families? At Tennessee Cancer Specialists, it is the privilege of our employees to walk with our patients and their families as they move along the journey of fighting cancer. Whether you are working directly with patients in one of our clinics or in a support role, you are an important part of our mission to deliver the highest quality, compassionate care. Our 200+ employees make up the teams at our 15 different East Tennessee locations and have helped us achieve the Top Workplaces award two years running for the greater Knoxville area! As an Admixture Technician, you will mix and provide our nursing staff with the sterile IV infusion treatments for our patients who are being treated in our outpatient infusion clinic. Here's what might happen on a typical day… This role is unique because it requires the special skillset of being able to mix sterile IV infusions according to all applicable safety and quality standards. Your mixing skills combined with your patient focused mindset make you an important member of the outpatient infusion team. While guidance of our chemotherapy nurses as well as our Pharmacists is always available, you will work fairly independently. Being proactive in keeping up with all applicable quality and medication standards will allow you to be a successful Admixture Technician. You know when to ask questions, and we highly encourage you to do so. Your meticulous attention to detail is vital to our patients. Experiences that matter… • You have a pharmacy knowledge that allows you to quickly learn compounding and mixing to accurately admix drugs in a timely manner as ordered by a physician. • When checking orders and calculating correct dosage volumes, your attention to detail will be a major asset. • You will use your organization skills to properly log and date inventory, maintain proper control documents, and ensure drug supplies are in adequate supply. • Experience with navigating Electronic Medical Record (EMR) systems and knowledge of USP 800 standards will allow you to quickly adapt to the workflow of this position. • Your go-getter work ethic will have you ready to jump in and help out with any additional tasks. For your safety, keep this in mind: • This position will require standing and walking for extended periods of time. • Any lifting should be limited to 40 pounds or less. • You will need manual dexterity, proper hand-eye coordination, full range of motion to possibly assist with lifting patients, and corrected vision and hearing to normal range. We feel this position requires these basics: • A high school diploma or equivalent is required along with a Certified Pharmacy Technician certification and/or State Pharmacy Board licensure. (Tack on an IV certification for bonus points!) • You will have at least one year of Pharmacy Technician experience. • IV mixing is a plus but can be taught to a candidate with your initiative. EOE/M/F/D/V/SO. We are a Drug-free Workplace. FULL-TIME · KNOXVILLE Pharmacy/Admixture Technician Apply now", "grouping_count": 0}]