[{"id": 528739649098106, "advertiser_name": "Hutch & Co. Business and Employment Services", "status": "Active", "date": "11/09/2022", "ad_url": [], "image_save_path": ["528739649098106_00.jpg"], "ad_text": "Hutch & Co. Business and Employment Services Sponsored Delivery Driver / Warehouse Associate - (JC-22-11) Bangor Local Company - Full Time Call / Apply Today! Contact us at (207) 762-8198 and employment@hutchandco.com (Days) - Monday thru Friday w/ unlimited Overtime and optional Saturdays Overview: Hutch & Co. BES is searching for a friendly, positive, and dynamic candidate for our client in the Bangor Area whom is excited to work in a fun environment and with a great team! Job Summary: The Delivery Driver shall provide excellent customer service through the safe and efficient delivery of company purchased products to their residential and commercial customers using a company provided vehicle (box truck - two axle) working in tandem with another team member. The candidate will also be responsible for the cleanliness of their delivery vehicle, as well as observing company safety driving procedures. The candidate will ensure efficient deliveries along with another team member, by quality checking orders that ultimately gets the clients' products to the customer. Qualifications: - A valid / active driver's license - Excellent customer service skills - Ability to thrive in a busy, fast-paced retail environment - Must be able to lift 50-75 pounds - Must be reliable This Delivery Driver / Warehouse Associate position available is full-time and with proven performance can lead to quick raises. Shift Hours: Monday thru Friday (Optional Saturdays - Unlimited OT) 7:30 am to 5:00 pm (With Overtime opportunities Every week) Compensation: - This is a entry level position - Starting pay of $18.00 per hour (With Potential extra $60 weekly bonuses!) More Information: - The applicant will work in a professional manner both with clients' customers and with current team employees. - The applicant will work in a safe manner and maintain a safe working area at all times. - The applicant, at times may be asked to perform other general tasks as assigned by a supervisor/owner. - The applicant shall possess suitable communication and customer service skills to create a positive experience with customers, employees and management. Hutch & Co. Business and Employment Services Business, Business, Financial Service Send message", "grouping_count": 0}]