[{"id": 818711792551059, "advertiser_name": "Truck Driver Jobs in America", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fsyscobenefits.com%2Fcareers&h=AT2msQyQE6856MgL3UamM7jjvUdhR6bminaN_TAbBlxnbj4kQSuwbSA5Q0loQiGYip63pAsOAZFxpGe5tkb07utX82OTXEFdRJ-QFCRYY9BgtW5x0o2bb-tVckc2vbEpqT_nJJHKCJPqHQMYWumwA9fO_hufFDxXU3ql398KwHQ", "https://l.facebook.com/l.php?u=https%3A%2F%2Ffb.com%2Fmessenger_doc%2F&h=AT1W7iNW9jXzc7bBtP7xAHVzTxmlpGLLh-psGye4BUzDIMZ8KMy9NyrtKk2wDETQdzKVKKSxv_ZFObk66JAiXKquQHF4ivcn808cJ9aZ5QZgRYg2nr2CRci2tnDkqcZoG-lxZBKEiCs12hdXN6xRKaMWNW8zDDb60bStMiHMhzc"], "image_save_path": ["818711792551059_00.jpg"], "ad_text": "Truck Driver Jobs in America Sponsored CDL A Local Delivery Truck Driver More than the road: Start your delivery partner career with Sysco TODAY! $15,000 Sign-On Bonus! Make up to $90,000/year including base, overtime, and incentives! Benefits: Date of Hire benefits enrollment eligibility* Recent driving school graduates welcome Competitive pay with attractive productivity incentives Industry-leading total rewards package Hands-on career growth & leadership development Exciting employee rewards including exclusive discount programs Most routes are daily (home nightly) Paid vacations and holidays Paid company uniforms Tuition reimbursement Unlimited opportunities to grow your career! RELOCATION ASSISTANCE AVAILABLE JOB SUMMARY Are you ready for a rewarding career as a Sysco delivery partner? Sysco has immediate job openings for CDL A local delivery truck drivers who have a passion for delivering outstanding customer service and bringing a smile to the faces of restaurant customers in your community. Whether you are an experienced CDL A truck driver looking for a career change or a new CDL A truck driver just getting started - we are excited to offer you the opportunity to join our dedicated team of Sysco delivery partners! Drivers will safely operate a tractor-trailer and manually unload and deliver essential restaurant supply products to valued Sysco customers. Qualified candidates will enjoy competitive pay and other benefits such as career growth opportunities, a retention bonus, and other AMAZING incentives to set you up for career success! Qualifications Include: Valid Class A Commercial Driver License (CDL) Ability to lift, push or move freight that weighs an average of 40-60 pounds and as much as 100 pounds Flexibility to work overtime, occasional weekends, and holidays as necessary. Must be at least 21 years of age. Must pass a pre-employment screening, including DOT drug test Applicant must be authorized to work in the United States. If you are ready to discover amazing opportunities to grow your career, join our team today! APPLY NOW! *Exclusions/Exceptions may apply. BENEFITS INFORMATION: Candidates who start work in the months of May, June, July, August and September 2021 may be eligible for medical and prescription drug plan coverage effective on their date of hire*. Standard eligibility rules and timelines apply to all other Sysco benefits, including additional healthcare benefits options, retirement benefits, vacation, and paid sick leave. Please visit https://syscobenefits.com/careers to view additional benefits information. *Exceptions/exclusions may apply HERE WE PROTECT OUR ASSOCIATES COVID-19 Precaution(s): Personal protective equipment and masks provided Temperature screenings Social distancing guidelines in place Sanitizing, disinfecting, and cleaning procedures in place OVERVIEW: Sysco is the global leader in foodservice distribution. With over 57,000 associates and a fleet of over 13,000 vehicles, Sysco operates approximately 326 distribution facilities worldwide and serves more than 625,000 customer locations. We offer our associates the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization, and to serve others in a manner that exceeds their expectations. We’re looking for talented, hard-working individuals to join our team. Come grow with us and let us show you why Sysco is at the heart of food and service. AFFIRMATIVE ACTION STATEMENT: Applicants must be currently authorized to work in the United States. We are proud to be an Equal Opportunity and Affirmative Action employer, and consider qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law. This opportunity is available through Sysco Corporation, its subsidiaries and affiliates. FB.COM CDL A Local Delivery Truck Driver Needed Sign up", "grouping_count": 0}, {"id": 845457496497659, "advertiser_name": "Truck Driver Jobs in America", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2FSyscoBenefits.com%2F&h=AT1W7iNW9jXzc7bBtP7xAHVzTxmlpGLLh-psGye4BUzDIMZ8KMy9NyrtKk2wDETQdzKVKKSxv_ZFObk66JAiXKquQHF4ivcn808cJ9aZ5QZgRYg2nr2CRci2tnDkqcZoG-lxZBKEiCs12hdXN6xRKaMWNW8zDDb60bStMiHMhzc", "https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT1W7iNW9jXzc7bBtP7xAHVzTxmlpGLLh-psGye4BUzDIMZ8KMy9NyrtKk2wDETQdzKVKKSxv_ZFObk66JAiXKquQHF4ivcn808cJ9aZ5QZgRYg2nr2CRci2tnDkqcZoG-lxZBKEiCs12hdXN6xRKaMWNW8zDDb60bStMiHMhzc"], "image_save_path": ["845457496497659_00.jpg"], "ad_text": "Truck Driver Jobs in America Sponsored CDL A Driver Needed, Up To $15,000 Sign-On Bonus! Make Up To $100,000/Year Including Base, Overtime, And Incentives! CDL A Local Delivery Truck Driver More than the road: Start your delivery partner career with Sysco TODAY! Up to $15,000 Sign-On Bonus! Make up to $100,000/year including base, overtime, and incentives! JOB SUMMARY Sysco has immediate job openings for dependable local CDL A Delivery Truck Drivers to safely and efficiently operate a tractor-trailer and manually unload/deliver various products (meats, produce, frozen foods, groceries, dry goods, supplies, etc.) to customer locations on an assigned route schedule. Our truck drivers build relationships with each customer using their positive, friendly attitude and become familiar with their operations to meet needs and expectations. QUALIFICATIONS Requirements Recent driving school graduates welcome 21+ years of age. Must submit to a pre-employment drug screen. License to drive - valid Class A Commercial Driver License (CDL) with a clean driving record. Ability to read, write and communicate in English. Touch freight – may need to lift, push or move product weighing an average of 40-60 pounds and as much as 100 pounds. Flexibility – overtime as required, occasional weekends and holiday. Sysco is more than just a place to work. Our passion for food and our customers has made us the industry leader. To remain on top, we will continue to think bigger, work harder and never give up. It takes a special kind of CDL A Delivery Truck Driver to work for Sysco. Are you ready to drive success? Click on the hyperlink to watch A Day in the Life of a Sysco Driver. BENEFITS INFORMATION: For information on Sysco’s Benefits, please visit https://SyscoBenefits.com HOW WE PROTECT OUR ASSOCIATES COVID-19 Precaution(s): Personal protective equipment and masks provided Temperature screenings Social distancing guidelines in place Sanitizing, disinfecting, and cleaning procedures in place OVERVIEW: Sysco is the global leader in foodservice distribution. With over 57,000 associates and a fleet of over 13,000 vehicles, Sysco operates approximately 326 distribution facilities worldwide and serves more than 625,000 customer locations. We offer our associates the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization, and to serve others in a manner that exceeds their expectations. We’re looking for talented, hard-working individuals to join our team. Come grow with us and let us show you why Sysco is at the heart of food and service. AFFIRMATIVE ACTION STATEMENT: Applicants must be currently authorized to work in the United States. We are proud to be an Equal Opportunity and Affirmative Action employer, and consider qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law. This opportunity is available through Sysco Corporation, its subsidiaries and affiliates. BENEFITS Excellent pay, including productivity incentives. Most CDL A Delivery Truck Drivers have daily routes and are home nightly. Paid vacation and holidays. Relocation Assistance Available - Certain Restrictions Ongoing job skills and leadership development training. Career growth opportunities – we promote from within! New hires are eligible first day of the month following or coinciding with 31 days from date of hire Comprehensive healthcare benefits. Generous retirement benefits. Employee discount programs. Service recognition and employee rewards. Discounts on Sysco stock (SYY). Referral programs. Safety programs. Tuition reimbursement. Uniforms. More benefits, too many to name. 312-915-5074 CDL A Truck Drivers Great Pay +Benefits Apply Now", "grouping_count": 0}, {"id": 411558691190122, "advertiser_name": "Truck Driver Jobs in America", "status": "Active", "date": "11/04/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT1W7iNW9jXzc7bBtP7xAHVzTxmlpGLLh-psGye4BUzDIMZ8KMy9NyrtKk2wDETQdzKVKKSxv_ZFObk66JAiXKquQHF4ivcn808cJ9aZ5QZgRYg2nr2CRci2tnDkqcZoG-lxZBKEiCs12hdXN6xRKaMWNW8zDDb60bStMiHMhzc"], "image_save_path": ["411558691190122_00.jpg"], "ad_text": "Truck Driver Jobs in America Sponsored CDL A Drivers Real Earnings Averaging $80,000 a year. Easy-to-Complete 6-12 Month Leases. 2015 or 2016 Freightliners in excellent condition. CDL-A Lease Purchase Company Drivers No Money Down. No Credit Check. No Maintenance Expenses! Don’t Wait, Call Now! Speak With A Recruiter: 1-866-543-4945 REAL Earnings Averaging $80,000 a year. That’s REAL money what you’ll actually keep after lease payments AND all truck-related expenses like tires and fuel. Other leases leave you guessing what you’ll make. We’re keeping it REAL. Never Worry About Maintenance. It’s one of the biggest unknowns for owner-operators but not you because it’s all included. Who else does that? Easy-to-Complete 6-12 Month Leases. First time leasing? Our new short-term leases are a quick and easy way to find out what it’s like to be your own boss. We know you’re going to love it. $1,500 Cash Completion Bonus. That’s right, the leases are not only easy to finish, you’ll even get a nice bonus. Great Equipment. All of our trucks are 2015 or 2016 Freightliners in excellent condition. So no worries there, either. Health Insurance Savings. Need help finding insurance? Our insurance partners can help you choose a plan and save you money. Benefits: Average $80,000 a year! $1,500 Cash Completion Bonus 2015 Freightliner Cascadias- All Fuel Saver Automatic Transmission Fuel Surcharge No Credit Check, No Money Down, Walk Away Lease NO Maintenance expenses Qualifications: 21 Years or Older and Must have CDL-A for Company Driver opportunities CDL A and 6 months OTR Experience for Walkaway Lease Walkaway lease means no additional penalties upon termination. Not available in CA, IL, NJ and NY. Call for details. Experienced CDL A Truck Drivers EARN More! Apply Now", "grouping_count": 0}]