[{"id": 862777115009133, "advertiser_name": "Grand Avenue Produce Company", "status": "Active", "date": "01/27/2023", "ad_url": [], "image_save_path": ["862777115009133_00.jpg"], "ad_text": "Grand Avenue Produce Company Sponsored We are hiring Operations Team Members Qualifications: Organization/Time Management Critical thinker Self-Motivated Highschool Diploma/GED Strong interpersonal skills to cultivate long-term relationships with customers and vendors. CSR, purchasing, or sales experience a plus. *Bilingual is a huge plus. (English and Spanish preferred) Responsibilites Customer service, sales, and purchasing to help facilitate day to day operations. Pay & Benefits Starting pay $25 an hour We offer Medical, vision, and dental insurance in compliance with ACA regulations. Schedule: 5 days Monday through Friday. 7:00 AM to 4:00 PM To apply for this position Please submit your resume to Recruiting@grandavenueproduce.com", "grouping_count": 2}, {"id": 713177280260423, "advertiser_name": "Grand Avenue Produce Company", "status": "Active", "date": "01/21/2023", "ad_url": [], "image_save_path": ["713177280260423_00.jpg"], "ad_text": "Grand Avenue Produce Company Sponsored NEW YEAR...NEW OPPORTUNITIES! We are hiring Local Delivery Drivers (Regular License) Qualifications: • Valid Az State License & DOT card • At least 6 months of experience driving box trucks • Ability to lift 50lb packages • Clean Current MVR (Within 7 days) • Pass Pre-employment Drug Screen **Perfect Attendance and Punctuality is a must Responsibilities: • Deliver products to established customers throughout the Phoenix area • Unload and store product per customers standards and protocols • Inspect and monitor the delivery vehicle per AZDOT guidelines • Maintain accurate inventory of packages and materials • Maintain and operate with the highest work safety, and food safety protocols Delivery vehicles include: • Straight Box Truck Pay & Benefits • Starting pay $20 an hour We offer Medical, Vision and Dental insurance as well as 401k **Must have the following before we can interview for this position: DOT card, current MVR, Az drivers license. Text 602-931-9615 to schedule an interview. **Must have the following before we can interview for this position: DOT card, current MVR, and AZ drivers license. FULL-TIME · $20 / HOUR · PEORIA, ARIZONA Local Truck Driver Apply now", "grouping_count": 0}]