[{"id": 1192867248043341, "advertiser_name": "T and T Produce", "status": "Active", "date": "01/27/2023", "ad_url": [], "image_save_path": ["1192867248043341_00.jpg"], "ad_text": "T and T Produce Sponsored We are seeking to add a local route delivery drivers to our team! You will be an essential part of delivering the best produce and dairy to our partners within a 200-mile radius of Chattanooga, TN. Interested in joining? Apply now! Shift: • Full-Time • 4/12 hour days/week Qualifications: • Non-CDL • Straight-Truck Drivers • Be able to lift 50lbs. • 250 lbs. with a two-wheel dolly • Clean driving record • First-shift Compensation: • Health and Medical Insurance • One week of paid vacation after one year • Insurance offered after 60 days of employment Why T&T? T&T Produce is a produce company strategically located to serve fresh fruits, vegetables, dairy, and eggs for restaurants, schools, healthcare, lodging, cafeterias, and government institutions in Georgia, Tennessee, Alabama, Kentucky // Chattanooga, Knoxville, Nashville, Birmingham, and Huntsville. We thrive to exceed our customers expectations in quality, service & cost. Through continuous improvements and customer interactions, while resulting in opportunities for internal & external stakeholders. Address: 124 Park Industrial Blvd, Ringgold, GA 30736 (Across from NY Flea Market in Ringgold. Off of Cloud Springs Rd.) FULL-TIME · FORT OGLETHORPE, GEORGIA Delivery Driver Apply now", "grouping_count": 0}, {"id": 1017488362544921, "advertiser_name": "T and T Produce", "status": "Active", "date": "01/27/2023", "ad_url": [], "image_save_path": ["1017488362544921_00.jpg"], "ad_text": "T and T Produce Sponsored We are seeking a Third Shift Warehouse Loader. Their main responsibilities will include pulling and preparing cases of produce for shipment, accurately selecting product according to the customer’s order specifications, loading product onto delivery vehicles with occasional use of a forklift, and ensuring that the exact quantity and type of produce are loaded and shipped. You will be an essential part of loading the best produce and dairy to our partners within our service area. Interested in joining? Apply now! Shift: • Full-time • Rotating schedule. Sunday, Tuesday, Thursday 8pm-6am. Monday, Wednesday, Friday 10pm-3am (optional) Qualifications: • Must be able to lift 45 pounds and push 250 pounds • Must pass a drug test • Complete safety training • Bring a positive attitude! • Supportive team player Compensation: • $13-15/hr • Flexible scheduling • Health and Medical Insurance • One week of paid vacation after one year Why T&T Produce? T&T Produce is a produce company strategically located to serve fresh fruits, vegetables, dairy, & eggs for restaurants, schools, healthcare, lodging, cafeterias, and government institutions in Georgia, Tennessee, Alabama, Kentucky // Chattanooga, Knoxville, Nashville, Birmingham, and Huntsville. We thrive to exceed our customers expectations in quality, service & cost. Through continuous improvements and customer interactions, while resulting in opportunities for internal & external stakeholders. Address: 124 Park Industrial Blvd, Ringgold, GA 30736 (Across from NY Flea Market in Ringgold. Off of Cloud Springs Rd.) FULL-TIME · FORT OGLETHORPE, GEORGIA Third Shift Warehouse Loader Apply now", "grouping_count": 0}]