[{"id": 1033094510940276, "advertiser_name": "Home Sweet Home Care Hawaii", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fhshchawaii.com%2Fsocial&h=AT0IOmmupWshqT_l28EWs3cbF8eZHq7UBxTx3R_ZS3RR581kkLvIF1b8Q0j_50-VPQROPZTvaEr0ZeAFP9Y2gCw9gqNVwSfKLYvS1UFV8bCPndgLHx-VverhVTS5_1NCoUIoQx3JaDttwg7A_izyxiXax3iVg6cO8o2vXDSlKDA"], "image_save_path": ["1033094510940276_00.jpg"], "ad_text": "Home Sweet Home Care Hawaii Sponsored Are you seeking new opportunities this year? Have you always wondered if being a care provider is for you? Providing one on one assistance to seniors in their homes may be a profession you truly enjoy. If you are a Certified Nurses Aide your expertise is needed with seniors throughout Oahu everyday. At Home Sweet Home Care Hawaii we are looking for fun, kind, and genuine people that want to support the needs of kupuna and families in the community. Apply today to join our team. Here is what some of our families are saying about home care services… “Your services are so helpful I don’t know how I would manage by myself” -Jean “I’m not sure how I would have kept this up without your help”-Mike “Thank you, Thank you I have so much on my plate having a caregiver coming into help is such a relief” -Amy “I am so grateful for home care services, I don’t know how to do this I’m scared and anxious about doing this alone” -Jessica Clink the link on this post to apply today Some of your responsibilities will be… -Medication reminders -Assist clients with mobility -Help clients dress, bathe, eat etc. -Encourage exercise -Cook meals -Shopping -Light housekeeping -Provide emotional support -Escort to appointments Be proud to provide professional solutions for seniors and families! To learn more about us check us out on our facebook page you can also go to hshchawaii.com/social FULL-TIME · $17 / HOUR · HONOLULU, HAWAII Certified Nursing Assistant Apply now", "grouping_count": 0}]