[{"id": 1170592810249144, "advertiser_name": "Staff Sense", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["1170592810249144_00.jpg"], "ad_text": "Staff Sense Sponsored Shipping Lead $16-$16.50 AN HOUR 1st SHIFT 5:30AM-2PM M-F MUST HAVE TEAM LEADERSHIP SKILLS KNOW HOW TO OPERATE A SITDOWN FORKLIFT DUE TO LOADING AND UNLOADING MATERIAL BE EXPEREINCE WORKING IN A MANUFACTURING COMPANY. STAGING COMPUTER LITERATE MUST GO TO WORK ON TIME AND BE RELIABLE. PLEASE CALL SO WE CAN GET YOU IN FOR AN APPLICATION: 972-495-7070 FULL-TIME · $16 - $16.50 / HOUR · DALLAS, TEXAS Shipping Apply now", "grouping_count": 0}, {"id": 1418129375688304, "advertiser_name": "Staff Sense", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["1418129375688304_00.jpg"], "ad_text": "Staff Sense Sponsored I AM LOOKING FOR MACHINE OPERATORS HERE IN THE GARLAND AREA. Stamper Operator $17-$19 1st SHIFT 5:30AM-2PM OPEN TO PAY MORE BOE MUST HAVE STEEL TOE SHOES MECHANICALLY INCLINED PREFERS SOMEONE WITH 3-5 YEARS EXPERIENCE WITH PRESS BRAKE. EXCELLENT MATH AND MEASUREMENT SKILLS. EXPERIENCE WITH MICROMETERS CALIPERS REQUIRED TO LIFE UP TO 50 LBS STANDING FOR LONG PERIODS REPETITIVE WORK ENVIRONMENT ABILITY WO WORK IN NON-CLIMATE CONTROLLED FACILITY. PLEASE GIVE US A CALL SO WE CAN GET YOU IN FOR AN IN-PERSON APPLICATION 🙂 972-495-7070 FULL-TIME · $17 - $19 / HOUR · DALLAS, TEXAS Machine Operator Apply now", "grouping_count": 0}, {"id": 3408452379471499, "advertiser_name": "Staff Sense", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["3408452379471499_00.jpg"], "ad_text": "Staff Sense Sponsored I have 2 Forklift Positions that need to be filled ASAP. Sit down Forklift Driver (Garland,TX) $17 an HR , WEEKLY PAY, TEMP TO PERM, 8AM -4:30PM (WHEN FIINISHED ) M-F MATERIAL HANDLERS W/ SITDOWN RECIECING EXPERIENCE A MUST, COUNTING PALLETS, COUNTS BOXES BY HAND (NO RF SCANNER), STAGING, ABILITY TOO MULTITASK AND STAY ON TASK. WILL BE DEALING WITH MULTIPLE TRUCKS AND DELIVERIES AT ONE TIME. REACH TRUCK FORKLIFT POSITION (PLANO,TX) Reach Truck Mon-Fri 2pm-10:30pm Pay rate $17.00 Plus 10% differential pay (NEED TO BE VACCINATED) PLEASE COME IN AND APPLY TODAY 8:30AM-11AM OR 1:30PM-3:00PM 972-495-7070 PLEASE CALL US FOR MORE INFORMATION. FULL-TIME · $17 / HOUR · DALLAS, TEXAS Forklift Operator Apply now", "grouping_count": 0}]