[{"id": 735845524399230, "advertiser_name": "MHCE", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["735845524399230_00.jpg"], "ad_text": "MHCE Sponsored When you joined the military, you dedicated your life to serving our country. At Centurion Health, we dedicate our lives to transforming the health of the communities we serve one patient at a time. CONTINUE YOUR MISSION OF SERVICE WITH A TRANSITION INTO CORRECTIONAL HEALTHCARE. Centurion is actively recruiting throughout the US the following positions… Registered Nurses LPNs Mental Health Professionals Psychologists Psychiatrists Primary Care Physicians Dentists and additional healthcare disciplines. BENEFITS: • Controlled environment with a team approach • Clinically diverse population • Structured and systematic approach to processes and procedures • No RVU’s, no billin, and no insurance hassles • Competitive, guaranteed salaries and comprehensive benefits • Company PAIC malpractice insurance FULL-TIME · OCALA, FLORIDA Centurion is Actively Recruiting Healthcare Professionals Throughout the US Apply now", "grouping_count": 0}, {"id": 737468767944221, "advertiser_name": "MHCE", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["737468767944221_00.jpg"], "ad_text": "MHCE Sponsored Join One of the Nation’s Top 1% Hospitals It takes great physicians committed to providing the highest quality healthcare that meets the most stringent patient guidelines to rank a hospital in the top 1% of hospitals nationwide (source: Healthgrades). Reading Hospital – the flagship of Tower Health – is a recipient of Healthgrades® America’s 50 Best Hospitals Award.™ Tower Health is comprised of four hospitals that span three counties and service almost 2.5 million people in Southeastern PA, just 90 minutes from Philadelphia. Ready to explore these outstanding opportunities? Forward your CV for immediate and confidential review to medicalstaffrecruitment@towerhealth.org FULL-TIME · PHILADELPHIA, PENNSYLVANIA TOWER HEALTH IS HIRING PHYSICIANS AND ADVANCED PRACTITIONERS Apply now", "grouping_count": 0}, {"id": 938043250940408, "advertiser_name": "MHCE", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["938043250940408_00.jpg"], "ad_text": "MHCE Sponsored More than ever we appreciate and value your compassion and loyal care to our community. Position: Registered Nurse • 79 Bed • Baby-friendly • Trauma III Designated Hospital bordering the Navajo Nation in Gallup, NM We Offer: • Competitive Salaries • Relocation • Recruitment / Retention Incentives • Loan Repayment FULL-TIME · GALLUP, NEW MEXICO Gallup Indian Medical Center is Looking for Nurses Apply now", "grouping_count": 0}, {"id": 1164698211084335, "advertiser_name": "MHCE", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.USAJOBS.gov%2F&h=AT2qt-n0MNQymfsVP0vVVBpkJWQiWwQ7Pwg0tqHlvn8_aVJZj2CF0xxLj-vb2cRQs1EfMqO-HRk8I5QrGjtHHySl-rb3TwFqVNF2yHSNMnlVwNitZOoHlOP967ebEdbuATiPIj7KhoC6V-1Cf6XmeDYhi-JrrWCsbtEvTH0LLqk"], "image_save_path": ["1164698211084335_00.jpg"], "ad_text": "MHCE Sponsored VA St. Louis Healthcare System is looking for: • RNs and CNAs – Med/Surg • CNAs – PCU • RNs and CNAs – Ext. Care & Rehab Services • RNs and CNAs – Spinal Cord Inj. Please apply on www.USAJOBS.gov. Contact our nurse recruiter Greg Burian at greg.burian@va.gov, or 314-289-6479 if you have any questions. FULL-TIME · ST. LOUIS, MISSOURI US Department of Veterans Affairs is hiring RNs and CNAs in St. Louis, Missouri Apply now", "grouping_count": 0}, {"id": 581907413750774, "advertiser_name": "MHCE", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["581907413750774_00.jpg"], "ad_text": "MHCE Sponsored Wind River Family & Community Health Care is a non-profit Tribal health organization providing ambulatory health care services to the unique health needs of the Northern Arapaho Tribe, Eastern Shoshone Tribe and other federally recognized Tribes living in or near the Wind River Indian Reservation. Positions Available: • Family Medicine Physicians • Family Nurse Practitioners • Internal Medicine Physicians • Pediatric Nurse Practitioners • Pediatric Physicians • Physician Assistants • Physicians (option for inpatient / outpatient practice) • Licensed Psychologists • Optometrists • Dentists • Clinical Nurses • Dialysis Nurses Benefits: • Competitive Wages (no state or local tax) • 18 different medical insurance packages • Dental and vision insurance • Life insurance • Retirement plan with 4% match • Sign-on bonus • Up to $25,000 per year student loan repayment program • CME allowances • Relocation allowances FULL-TIME · RIVERTON, WYOMING Wind River Family & Community Healthcare is Currently Looking for Nurses and Physicians Apply now", "grouping_count": 0}, {"id": 1210423762902974, "advertiser_name": "MHCE", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.chasebrexton.org%2F&h=AT2ajjaPZcpcHbF6Iv425INKhKhkxI52XB7x5EYJcY2E794CzLkpVTbtUUEjTZODEBlg3ZqDC026rbvl8bqHs2F8KbIXssVkb0BaDfjxMZvMFM33I03dMVq4pxxNxo_67PtTgDANX049mDsvKIq0zdDphmDQbnCpqp9zyDG6pBg"], "image_save_path": ["1210423762902974_00.jpg"], "ad_text": "MHCE Sponsored We offer Competitive Salary with a $5,000 Sign On Bonus with a two year commitment and a Comprehensive Benefit package. Chase Brexton seeks the following- Positions Throughout Maryland Nurse Care Coordinators MA's - Certified Pharmacy Techs - Certified Behavioral Health Therapists - LCSW Substance Use Therapist - LCPC Nurse Practitioners Social Workers - MSW Staff Physician Endocrinologists Midwife Nurse Psychologists Physicians Apply online by visiting our website - go to www.chasebrexton.org and can also email Janie Allen - Corporate Recruiter - [Email hidden]. We look forward to assisting you with your next career move. FULL-TIME · BALTIMORE, MARYLAND Chase Brexton is Actively Looking for Nurses, NP's, Social Workers, and Psychologists for Our organization Apply now", "grouping_count": 0}, {"id": 2023279171200997, "advertiser_name": "MHCE", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["2023279171200997_00.jpg"], "ad_text": "MHCE Sponsored Join Jordan Valley’s ever-growing network of providers as a • Full-time General Dentist • Full-time Pediatric Dentist • Part-time General Dentist Compensation and benefits include: • Strong base salary for General Dentists: starting at $135,000 - $200,000 based on experience. Pediatric Dentist have a strong base salary starting at $275,000 based on experience. • Part-time General Dentist starting salary is $100.00 an hour. • Incentive options of up to $70,000 possible per year based on performance and contract commitment. • Sign on Bonus available for full time positions only. • Our providers have a high success rate when applying for the State or Federal loan repayment/loan forgiveness programs • HPSA score of 26 for all dental locations. • CME Allowance • Paid malpractice insurance • Retirement plan (with employer match) • Minimal call rotation General Dentist salary starting at: $135,000 - $200,000 based on experience Contact Beth Miller, Provider Relations Specialist for more information. Call 417.350.9255/Email Beth Miller at [Email hidden] FULL-TIME · SPRINGFIELD, MISSOURI Jordan Valley Community Health Center in Missouri is Looking for Dentist & Nurses Apply now", "grouping_count": 0}, {"id": 1294270861117198, "advertiser_name": "MHCE", "status": "Active", "date": "01/18/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.bop.gov%2F&h=AT3Qyb8C6-eDDCfnFq0iVabOngrjCBhcw7Y2p7BdZsx2uyfAp4_oQaCpoxqrNRMbSx3vd_4v_txSj0TiKBy9icHPjgDJOoyI8T3H0Ci3d1AjUGFgBXO2H-WyO1M7RRigSlh3pfWVoseaoGLgUb2hL-PhiaHCRu0NLnsTAGdtmG0"], "image_save_path": ["1294270861117198_00.jpg"], "ad_text": "MHCE Sponsored Discover what life is like working for the BOP. Join the Leader in Correctional Healthcare—The Federal Bureau of Prisons is seeking Forensic Psychologists, Physicians, Psychiatrists, Pharmacists, Mid-level Practitioners, Nurses and Nursing Assistants. The benefits: • Competitive Federal Government Salary, geographic flexibility and mal-practice coverage. • Paid Leave including vacation, sick leave, and paid holidays. • License mobility; you can work at any federal facility across the US if you have a valid license to practice in any state. • Comprehensive Health Insurance and benefits. • A supportive, safe and secure environment with opportunity for growth and advancement. • Have a meaningful career with an agency that values its employees. Visit https://www.bop.gov/ for more information #registerednurse #rn #nursing #nurses #nurse #healthcarejobs #pharmacists #jobs #healthcare #homecare #work #growth #environment #career #opportunity #hiring #hr #humanresources #physicians #psychologists #pharmacist #cnajobs FULL-TIME · SPRINGFIELD, MISSOURI The Federal Bureau of Prisons is currently seeking Physicians, Nurses and more Apply now", "grouping_count": 0}, {"id": 849074802984134, "advertiser_name": "MHCE", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["849074802984134_00.jpg"], "ad_text": "MHCE Sponsored ADVANCE YOUR CAREER WITH CORE CIVIC! At CoreCivic, we do more than manage inmates, we care for people. CoreCivic is currently seeking Registered Nurses who have a passion for providing the highest quality care in an institutional setting. The Registered Nurse (RN) plans and provides comprehensive nursing care including, but not limited to, executing Licensed Independent Provider’s orders, dispensing and administering medications, and assisting Licensed Independent Provider in examinations and treatment of patients. Applies nursing and supervisory techniques required in the care, treatment, and referrals of inmates/residents. Performs all technical/clinical procedures within the scope of his/her education and licensure. The successful candidate should be able to perform ALL of the following functions at a pace and level of performance consistent with the actual job performance requirements. - Apply appropriate nursing skills in the area and treatment of inmates/residents. - Attend sick call with the physician to see inmates/residents; prepare a list of inmates/residents to be examined; prepare examining room and equipment - Examine and assess new inmates/residents with illnesses or injuries or inmates/residents who become ill or injured; refer inmates/residents to the emergency room or other appropriate healthcare facilities as required by their condition. - Perform emergency procedures as needed and notify Licensed Independent Provider for treatment orders. - Provide guidance, supervise and monitor nursing care provided by licensed vocational/practical nursing staff and non-licensed medical staff. More about CoreCivic! Headquartered in Nashville, Tennessee with over 70 facilities nationwide, CoreCivic is the leader in partnership corrections with a growing presence in: - CoreCivic Safety, We operate safe, secure facilities that provide high-quality services and effective reentry programs that enhance public safety; - CoreCivic Properties, We offer innovative and flexible real estate solutions that provide value to the government and the people they serve; - CoreCivic Community, We deliver proven and innovative practices in settings that help people obtain employment, successfully reintegrate into society and keep communities safe. With opportunities in correctional security, education, and healthcare, CoreCivic has a position that's perfect for you. Each CoreCivic facility is like a small town. Our correctional facilities feature kitchens, dining halls, places of worship, classrooms, vocational training centers, health care clinics, recreational areas, housing units, administrative offices and more. Working together, we provide hundreds of services and perform countless tasks every day. Teamwork is a way of life for CoreCivic employees and how we are able to provide the industry's highest quality safety and security around the clock. CoreCivic offers a comprehensive benefits package that includes Health, Dental, Vision, Life, PTO, Paid Holidays, 401(k) with company match and paid training! Available opportunities in the following areas as well: • Nicholls, GA • Estancia, NM • Milan, NM • Florence, AZ • Conneaut, OH • Tutwiler, MS • Cushing, OK • Olney Springs, CO • Holdenville, OK • Indianapolis, IN • Alamo, GA • Lumpkin, GA • Millen, GA • Sandersville, GA • Allendale, GA • Statesboro, GA • Waycross, GA • Waynesboro, GA • Waynesboro, TN • Savannah, TN • Youngstown, OH • Las Animas, CO • Whiteville, TN • Mason, TN • Clifton, TN • Lexington, TN • Leavensworth, KS FULL-TIME · PHOENIX, ARIZONA Nurses Wanted! CoreCivic is Hiring Nurses and LPNs in Arizona, Texas, Nevada, Montana, Mississippi, Tennessee and West Virginia Apply now", "grouping_count": 0}, {"id": 1048980446504373, "advertiser_name": "MHCE", "status": "Active", "date": "01/18/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.kpcph.com%2Fcareers&h=AT12ocNacwyKMVM6QzC6y0jIlW-tbXZc0997r4AD1AZREaxk1eCxTd3egp33uiFRvuesqP9AJNmYt3349IP5USD7_n-Ov_dS_DF0VqQ4JaZfKROEJS45nQXKxuNDlFI7DLUlwgC2xr1Hw86B_F-P9GHloomHUJGvcQoam65ndn0"], "image_save_path": ["1048980446504373_00.jpg"], "ad_text": "MHCE Sponsored KPC Promise Healthcare is looking for amazing healthcare professionals to join their team. Currently offering sign-on bonuses to qualifying positions. Opportunities available at: • Baton Rouge, LA • Dallas, TX • Phoenix, AZ • Salt Lake, UT • Wichita Falls, TX • Vicksburg, MS • Overland Park, KS Lean more at http://www.kpcph.com/careers FULL-TIME · DALLAS, TEXAS Looking for Nurses! Join our Team at KPC Promise Healthcare Apply now", "grouping_count": 0}, {"id": 533630608548461, "advertiser_name": "MHCE", "status": "Active", "date": "01/18/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.tonhc.org%2F&h=AT0VWh7unjOYW2pCMx9Wtf9aFWuv9eFm1_7j_PPILJy5C7FC5--A0Q7cy5Vqp9haqtFIyuyyRMcwUAKWR8Lp6WlTih0e4S5Dz9toQWAVUl0xyxQkB98spJTkEm1YISR_T_dNPjAHvVc4jE-ZKDG5FuSP78ukfgLLvVPJHYvtpno"], "image_save_path": ["533630608548461_00.jpg"], "ad_text": "MHCE Sponsored Tohono O'Odham Nation Healthcare is now recruiting healthcare professionals. Many opportunities available from Nurses to Physician Assistant. Visit www.tonhc.org for more information or contact human resources at (520)547-8197 or (520)383-6540. #healthcare #nhs #nurses #rn #nursing #nurse #registerednurse #doctor #medical #medicine #hospitals #jobs #healthcarejobs #recruiting #humanresources #opportunities FULL-TIME · SELLS, ARIZONA Tohono O'Odham Nation Healthcare is Currently Recruiting Nurses, Physicians and Dentists Apply now", "grouping_count": 0}]