[{"id": 853364865723490, "advertiser_name": "Cardinal Hayes Home for Children", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["853364865723490_00.jpg"], "ad_text": "Cardinal Hayes Home for Children Sponsored The role of a Direct Support Professional is integral in the lives of our individuals…and it is challenging work! As an agency, we are committed to providing you with the training, support, and resources you need to help you accomplish your goals and feel rewarded for your effort! No Experience Required! *After Applying, Contact Human Resources for an Interview* TEXT: 845-702-5026 CALL: 845-677-6363 ext. 1122 THE DETAILS: *Where You’ll Be (and When):* We have locations throughout Dutchess County, NY: >Amenia >Lagrangeville >Millbrook >Pleasant Valley >Red Hook >Salt Point Multiple shifts available: Morning | Afternoon | Overnight | Per-Diem *What You’ll Make:* $15.05 - $ 17.55 / hour, depending on experience *Increase of $1.00 after medication certification *What You’ll Get:*: >Stay Bonus: $1000 ($250 after six months, $750 after twelve) >Referral Bonus: Up to $550 after six months >Comprehensive Insurance Coverage: Health, vision, dental, and more >403(b) Savings Plan with company contributions >Paid days off including vacation, holidays, and sick days >Career Ladder: Ongoing training, development, and advancement opportunities >Employee Discount Program: Discounts on travel, events, movie tickets, tours, and theme parks…and more! >Tuition Discounts: Offered through Marist College *Plenty of opportunities to:* Showcase your talents, passions, and abilities | Develop new skills | Give back to your community | Help and support others | Achieve personal & professional growth Face new challenges | Gain new perspectives | Make money | Have fun! *What You’ll Do as a Direct Support Professional:* >Build transformative relationships with our individuals >Support their daily needs >Encourage their interests >Empower them to achieve their goals *What You’ll Bring to the role:* >A desire for a person-centered, supportive, and team-oriented culture >A positive attitude and caring spirit >An ability to create enriching and meaningful experiences *Equal Opportunity Employer.* Diversity is the spice of life! We value and embrace difference and encourage people from all backgrounds to apply. FULL-TIME · $15.05 - $17.55 / HOUR · MILLBROOK, NEW YORK Direct Support Professional (DSP)-$1000 Bonus! Apply now", "grouping_count": 0}, {"id": 579320480343305, "advertiser_name": "Cardinal Hayes Home for Children", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["579320480343305_00.jpg"], "ad_text": "Cardinal Hayes Home for Children Sponsored Opportunities in Millbrook, NY and surrounding areas! Tired of working hospital shifts or pandemic hours? Come join our team of dedicated Nurses at Cardinal Hayes Home, a not-for-profit agency serving individuals with intellectual and developmental disabilities. We are a 119-bed facility with 13 sites, each with its own assigned Registered or Practical Nurse and 8- 11 residents. We are seeking a Registered Nurse (RN) to cover two (2) of our Intermediate Care Facilities (ICF) in Millbrook, NY and surrounding areas. In this role, you will supervise the medical care of our residents and train staff to follow each resident’s care plan, as well as collaborate with our on-site physicians in a home-like environment. Schedule: Monday - Friday, daytime hours! Perks & Benefits: In addition to a rewarding and meaningful career, employee benefits include: $5,000 Stay Bonus! Flexible schedule and minimal off-shift/weekend work Affordable & comprehensive health, vision, and dental insurance 403(b) retirement plan Life and disability insurance Paid Time Off (PTO) Employee Assistance Program (EAP) And more! What you’ll do as a Registered Nurse: Participate in treatment for teams to develop a total plan of care for residents Administer medications and treatment plans Collaborate directly with on-site Physicians Provide care for any change in medical condition, emergencies, or injuries of residents Supervise and train Licensed Practical Nurse (LPN) and Direct Support Professionals (DSPs) in medication administration, medically related tasks, and overall care of residents Additional tasks as requested by Director of Nursing What's required of you; Current NYS Registered Nurse License At least two (2) years of nursing experience is preferred Experience working with individuals with intellectual/developmental disabilities in an ICF, IRA or related field, preferred Experience in behavioral health a plus Valid driver's license Pay: $36.61 - $38.79 per hour, based on experience; plus $350 per week when on-call and additional pay when called in. APPLY NOW for immediate consideration! Join us in transforming lives and helping individuals achieve their greatest potential in a caring, supportive, and team-oriented environment. Equal Opportunity Employer FULL-TIME · $36.61 - $38.79 / HOUR · MILLBROOK, NEW YORK Registered Nurse (RN) $5,000 Bonus ! Apply now", "grouping_count": 0}]