[{"id": 1109942299609628, "advertiser_name": "Sunshine Home Health Services of New Jersey", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["1109942299609628_00.jpg"], "ad_text": "Sunshine Home Health Services of New Jersey Sponsored Sunshine Home Health Services is seeking PER-DIEM & PART-TIME RNs to care for our patients and supervise our CHHAs (Certified Home Health Aides). You will be responsible for educating them and their families on prevention and healthy habits. The ideal candidate will be a responsible and well-trained professional able to give the best nursing care with little supervision. You will be compassionate and cool-tempered. You will be able to follow health and safety guidelines faithfully and consistently. The goal is to promote patient’s well-being by providing high quality nursing care. Responsibilities Monitor patient’s condition and assess their needs to provide the best possible care and advice. Observe and interpret patient’s symptoms and communicate them required party/parties. Collaborate with nurses to devise individualized care plans for patients. Perform routine procedures (blood pressure measurements, etc.) Act to maintain excellent hygiene and safety. Supervise and train Certified Home Health Aides Foster a supportive and compassionate environment to care for patients and their families. Skills Proven experience as a registered nurse Excellent knowledge of nursing care methods and procedures In-depth knowledge of health and safety guidelines and procedures A team player with excellent communication and interpersonal skills Responsible and compassionate Outstanding organizational and multi-tasking skills Patient with excellent problem-solving skills BS or other diploma from a nursing program CPR Certification preferred but will pay for right candidate to obtain this certificate as needed. Valid nursing license in State of NJ Sunshine Offers: Competitive hiring package & will meet the right candidate's needs. It benefits depend on if RN is P/T or per-diem. Job Types: Part-time, Per diem Salary: From $35.00 per hour PART-TIME · $35 / HOUR · RIDGEWOOD, NEW JERSEY Home Health RN Apply now", "grouping_count": 0}]