[{"id": 952790296105227, "advertiser_name": "Driscoll Foods", "status": "Active", "date": "01/13/2023", "ad_url": [], "image_save_path": ["952790296105227_00.jpg"], "ad_text": "Driscoll Foods Sponsored CDL Class A and Class B Drivers CDL Class A and B Driver Job Description Non-exempt Transportation Position Summary: A CDL Driver that is responsible for switching trucks during the night shift. In order to be considered for the position: candidate must have a VALID CLASS A OR B COMMERCIAL DRIVER'S LICENSE. Why join us? PTO after 3 months of employment 401k with employer match Medical, Dental, Vision, Life Insurance Description of Essential Job Functions: Ø Able to work a flexible schedule nigh shift schedule (3:30 PM until work in complete) Ø Able to work overnight Sunday - Thursday Ø Must be willing to work in all weather conditions Ø Must be willing and able to fulfill physical aspects of job, lots of walking Ø Safe operation of all company equipment Ø Must have a clean driving record Ø Maintain a current Class A OR B CDL Ø Perform other duties as assigned. Skills & Experience: Possess and maintain a valid Class A or B Commercial driver's license. Safe driving record and history. Pass DOT drug test and have no prior positive tests or refusals. Up to date Medical Certificate. Compensation: Competitive salary Paid Vacation and Holidays Benefits Package (Medical, Dental, Vision, Life 401K) NOTICE: The above statements are intended to describe the general nature of the environment and level of work being performed by this job. This job description in no way states or implies that the duties and responsibilities listed are the only tasks to be performed by the associate in this job. The associate will be required to follow any other instructions and to perform any other job related duties requested by his or her supervisor. Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions. This job description supersedes prior job descriptions. When duties and responsibilities change and develop, the job description will be reviewed and is subject to changes of business necessity. Applicants must be currently authorized to work in the United States. As an EQUAL OPPORTUNITY/AFFIRMATIVE ACTION EMPLOYER, Driscoll Foods and its affiliates do not discriminate against applicants or employees because of their race, color citizenship status, national origin, ancestry, gender (except where gender is a bonafide occupational qualification), sexual orientation, age, religion, creed, marital status, veteran status, domestic violence victim status, political affiliation or any other factor protected by federal, state or local law. Furthermore, Driscoll Foods will not discriminate against any applicant or employee because he or she is mentally or physically disabled, a disabled veteran, or veteran of the Vietnam era, provided he or she is qualified and meets the requirements established by Driscoll Foods for the job. FULL-TIME · $22 - $25 / HOUR · WAYNE, NEW JERSEY Night Truck Switcher/Yard Jockey Apply now", "grouping_count": 0}]