[{"id": 1085876602808309, "advertiser_name": "Elite HR Logistics", "status": "Active", "date": "01/27/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fbit.ly%2F3hZ47P4&h=AT1stvEz8IOkX7GMTXpVTcrmBFk3h_cOSCA83gQNRfrzTyFo40NWLQobRE8b1WKcWrOdPPqR11yayTZIuW2TsDj7i88D5U_ofW_epAHVjFg3TM6FjcHXHzgxLZE1Ny_TZsa1WMrQIyqRgHcbpAuPeJKQFxo"], "image_save_path": ["1085876602808309_00.jpg"], "ad_text": "Elite HR Logistics Sponsored Are you looking for flexible, temporary work? Something more permanent? Regardless of your career preferences, Elite HR Logistics has the experience and tools you need to succeed! We are looking for self-motivated and organized #delivery #drivers to join us. We hire the best people and create a superior environment for them to thrive with financial stability. Apply now on https://bit.ly/3hZ47P4 or get in touch at 1 (800) 892-3250 for more information. Elite HR Logistics Business Send message", "grouping_count": 0}, {"id": 1051244479611538, "advertiser_name": "Elite HR Logistics", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fbit.ly%2F3hZ47P4&h=AT1_1BdTjjnl3oY0ONsm_0iL3jQA6o4Hj_tVTeig2ZIUd0CfU6FQql-CBpBVgiUyE-0C0sj_hS3AhR7Be_AsuQzd7ODHCshf0Pi95G6eswCeazaR6zhm1Bd3CQoxSU97V-BY4YkhokjUfX8pjGq_b05Ijj8"], "image_save_path": ["1051244479611538_00.jpg"], "ad_text": "Elite HR Logistics Sponsored Why do truck drivers like their job? Let’s find out. ✅ Lots of travel opportunities If you enjoy traveling, you’re much more likely to love life as a #TruckDriver, spending your days driving the open highways. ✅ Earning potential Money can't buy happiness, of course, but it definitely can provide a whole lot of freedom and other benefits. If you're looking for financial security and a career with room to grow, truck driving is a great option. ✅ #Trucking benefits As a professional truck driver, you’re likely to receive paid vacations and holidays, as well as health and dental insurance. ✅ Training options We offer training programs to help support individuals interested in pursuing this industry for their careers. ✅ Flexible schedule The good news is that most #trucking professionals have a flexible schedule. At Elite HR Logistics Logistics, we have plenty of opportunities for those looking to get into the trucking industry. We have an excellent reputation and provide our drivers with amazing training and plenty of benefits. To learn more about our #jobs, visit our website https://bit.ly/3hZ47P4 or call us at 1 (800) 892-3250. We are happy to answer any questions you have about this career path. Elite HR Logistics Business Send message", "grouping_count": 0}, {"id": 699022571621996, "advertiser_name": "Elite HR Logistics", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fbit.ly%2F3hZ47P4&h=AT34vkEwleMWXUz6a0pfQUV4CfOFZXoyGZt9djOdzl3HBGDq8-MCTTW5OW7yE6vQ14jkHBa7LVIjfTCDWSPXM0FklkuZXpiT7YSKDIG7w2QAiiw7a71IB3S_nyxIL3XcOGxMTwjELrMxEFHpc70cCGvgeBI"], "image_save_path": ["699022571621996_00.jpg"], "ad_text": "Elite HR Logistics Sponsored Your dream job awaits you. We are hiring for counter sales position. Don't miss out on these opportunities! Call us today at 1 (800) 892-3250 or apply online on https://bit.ly/3hZ47P4 . Elite HR Logistics Business Send message", "grouping_count": 0}]