[{"id": 732339551742733, "advertiser_name": "SCRUB, LLC.", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["732339551742733_00.jpg"], "ad_text": "SCRUB, LLC. Sponsored Come join Scrub, LLC as an Airport Janitor at ORD Airport! Starting Pay of $17/hr, flight benefits and more! Janitors clean, dust, and wipe down all types of surfaces and furniture; Service, clean, disinfect restrooms and restock toilet paper, soap, paper dispensers, etc and other related duties as assigned. Pay rate starting at $17/hour for day shifts & $18/hour for night shifts. We hire on-the-spot at same day interviews! Just bring 3 forms of ID! Full-time and part-time positions available. For more info call: 773-631-0400 OFFICE & HOURS: 6033 N MILWAUKEE AVE CHICAGO, IL 60646 Monday - Friday 8:30 AM-3:00 PM *Open House also held every Tuesday & Thursday* Scrub, LLC Employee Benefits: flight benefits, health insurance (medical, dental, vision), competitive + yearly pay increases, PTO, and 401K Savings Plans! FULL-TIME · $17 / HOUR · CHICAGO, ILLINOIS Airport Janitor Apply now", "grouping_count": 0}, {"id": 1127737041230917, "advertiser_name": "SCRUB, LLC.", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["1127737041230917_00.jpg"], "ad_text": "SCRUB, LLC. Sponsored We are hiring High-Lift Truck drivers to work at O'Hare Airport! Receive benefits and more! High lift driver responsible to unload supplies to and from aircraft; truck is filled with all supplies to provision an aircraft and other related duties as assigned. **No CDL license required** Pay rate starting at $22/hr. We hire on-the-spot at same day interviews! Just bring 3 forms of ID! Full-time and part-time positions available. For more info call: 773-631-0400 OFFICE & HOURS: 6033 N MILWAUKEE AVE CHICAGO, IL 60646 Monday - Friday 8:30 AM-3:00 PM *Open House also held every Tuesday & Thursday* Join Scrub LLC and receive great employee benefits including flight benefits, health insurance (medical, dental, vision), competitive + yearly pay increases, PTO, and 401K Savings Plans! FULL-TIME · $22 / HOUR · CHICAGO, ILLINOIS High-Lift Truck Drivers Apply now", "grouping_count": 0}, {"id": 1161427937870213, "advertiser_name": "SCRUB, LLC.", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["1161427937870213_00.jpg"], "ad_text": "SCRUB, LLC. Sponsored Come join Scrub, LLC as 3rd Shift Aircraft Cleaner at ORD Airport! Starting Pay of $18/hr, $1,500 welcome bonus eligibility, flight benefits and more! Airplane Cleaners ensure all passengers enjoy an on-time departure via a thorough cleaning of all interior areas of an aircraft and related duties as assigned. Our Cabin Cleaners are focused on safety, quality cleaning, and attention to detail with pride in their work. Pay rate starting at $18/hour for night shifts. We hire on-the-spot at same day interviews! Just bring 3 forms of ID! Full-time and part-time positions available. For more info call: 773-631-0400 OFFICE & HOURS: 6033 N MILWAUKEE AVE CHICAGO, IL 60646 Monday - Friday 8:30 AM-3:00 PM *Open House also held every Tuesday & Thursday* Scrub, LLC Employee Benefits: flight benefits, health insurance (medical, dental, vision), competitive + yearly pay increases, PTO, and 401K Savings Plans! FULL-TIME · $18 / HOUR · CHICAGO Aircraft Cabin Cleaner - 3rd Shift Apply now", "grouping_count": 0}, {"id": 564393508916533, "advertiser_name": "SCRUB, LLC.", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["564393508916533_00.jpg"], "ad_text": "SCRUB, LLC. Sponsored Come join Scrub, LLC as an Aircraft Cleaner at ORD Airport! Airplane Cleaners ensure all passengers enjoy an on-time departure via a thorough cleaning of all interior areas of an aircraft. Our Cabin Cleaners are focused on safety, quality cleaning, and attention to detail with pride in their work. ➢ Cleaning of aircraft interiors, including cabin, cockpit, galleys, and lavatories ➢ Checking, handling, removing, and installing supplies according to list specifications and cleaning ➢ Ensure all areas are completely free of dirt, debris, marks, fingerprints, etc. ➢ Other related duties as assigned within the appropriate skill and experience capabilities expected for this position ➢Pay rate starting at $17/hour for day shifts & $18/hour for night shifts Join Scrub LLC and receive great employee benefits including flight benefits, health insurance (medical, dental, vision), competitive + yearly pay increases, PTO, and 401K Savings Plans! We hire on-the-spot for same day interviews! Just bring 3 forms of ID! Full-time and Part-time positions available! ➢OFFICE & HOURS: 6033 N MILWAUKEE AVE CHICAGO, IL 60646 Monday - Friday 8:30 AM-3:00 PM *Open House also held every Tuesday & Thursday at 6033 N Milwaukee Ave, Chicago, IL* For more info call: 773-631-0400 FULL-TIME · $17 / HOUR · CHICAGO Aircraft Cleaners Apply now", "grouping_count": 0}]