[{"id": 1394649628030003, "advertiser_name": "Sonwil Transportation", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT2anKpgibzwAo1_8ScVmoBM0Y3PeX_V4eqS4a3WGEHjrbfMu9hIYSVUAkRfA1kczDhw3UngDAlkVkHYXGwTjQ_ChhbbqnneNbB6mln2jeyOfSlclUf2NYRYN69nZApDr3VntZoP6TyftziSUS7uWYmOVrNv1zpH1RHUp1GU0l0"], "image_save_path": ["1394649628030003_00.jpg"], "ad_text": "Sonwil Transportation Sponsored DRIVING CAREERS Your career in overdrive with Sonwil. Communities rely on the dedication of our professional truck drivers. Families across America need you to deliver our everyday items, and we want you to join the Sonwil family. We understand the importance of fair compensation and equally supporting our teams both behind the wheel and in the office. That is why, in this highly competitive industry, we offer our drivers with a 401(k) and profit-sharing. Apply Now", "grouping_count": 0}, {"id": 901851924181455, "advertiser_name": "Sonwil Transportation", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT2anKpgibzwAo1_8ScVmoBM0Y3PeX_V4eqS4a3WGEHjrbfMu9hIYSVUAkRfA1kczDhw3UngDAlkVkHYXGwTjQ_ChhbbqnneNbB6mln2jeyOfSlclUf2NYRYN69nZApDr3VntZoP6TyftziSUS7uWYmOVrNv1zpH1RHUp1GU0l0"], "image_save_path": ["901851924181455_00.jpg"], "ad_text": "Sonwil Transportation Sponsored Customer Success Rep As a Customer Success Representative at Sonwil Logistics, you will focus on the brokerage aspect of our business, helping customers move their inventory in the most cost-effective way by identifying and providing logistics solutions. You will act in a supporting role for our portfolio of accounts while working in a team environment. You will be working directly with our customers: addressing concerns, implementing solutions, and upholding Sonwil Logistics’ commitment to top-tier service. Apply Now", "grouping_count": 0}, {"id": 3790689267824582, "advertiser_name": "Sonwil Transportation", "status": "Active", "date": "11/10/2022", "ad_url": [], "image_save_path": ["3790689267824582_00.jpg"], "ad_text": "Sonwil Transportation Sponsored Communities rely on the dedication of our professional truck drivers. Families across America need you to deliver our everyday items, and we want you to join the Sonwil family. We understand the importance of fair compensation and equally supporting our teams both behind the wheel and in the office. That is why, in this highly competitive industry, we offer our drivers a 401(k) and profit-sharing. When you succeed, we all succeed, and that should be celebrated. Sonwil drivers are paid weekly and enjoy paid time off. Yes, we pay you to take a break! We appreciate a work-life balance and offer flexible scheduling options, including weekends at home-time if desired. Your health, physical and mental, is important to us. We give each of our full-time drivers up to $12,000 each year to be applied to their health insurance premiums. If you choose a plan that costs less, you share in a cash rebate to you from the dollars that aren’t used. Our modern, well-maintained fleet includes newer-model Freightliner Cascadias, and Kenworth T-680s. The tractors are equipped with leading-edge technology, such as forward and rear-facing cameras, for increased safety. At Sonwil our door remains open. We are committed to constructive dialogue with a two-way conversation. As a result, we all grow professionally and provide the best possible service to our clients. LOCAL Sonwil Transportation is looking for drivers with a Class A CDL for local runs out of Buffalo, NY. This position is ideal for those who are seeking part-time or full-time work. You will drive within a 200-mile radius of our head office, so this is also a perfect role for someone who appreciates family time and enjoys being home every night. REGIONAL This position is ideal for someone who loves to travel or simply loves driving. If you want to explore new terrain within the state or just navigate the city, regional driving is for you. This role is suited for someone who appreciates family time, as scheduling can be optimized with plenty of time between shifts. OVER-THE-ROAD If you love to travel and want to explore this beautiful country (and get paid to do it!), over-the-road driving is for you. This role is also ideal for someone who appreciates family time, as scheduling can be optimized with plenty of time between shifts. FULL-TIME · WEST SENECA, NEW YORK Local, Regional, & OTR Driving Careers Apply now", "grouping_count": 0}]