[{"id": 905748510744726, "advertiser_name": "Impact Recruiting Center", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["905748510744726_00.jpg"], "ad_text": "Impact Recruiting Center Sponsored FitzGerald Brothers Transportation has been in business for over 22 years. The local family-owned company runs a mixed fleet of modern luxury vehicles, including limousines, buses and Motor Coaches. Wine Tours, Weddings, Shuttles, Tours, VIP Events, Line Runs Terminals in Geneva, Ithaca and Buffalo. Find out why people who work here, stay here-because you are well taken care of and truly treated like family! Take the first step in your new career and get paid the highest rate in the industry. Call to speak with a friendly recruiter at 417-456-6468 or apply online below to start the application process. Pay & Benefits: $225-$275 per day. $70,000 per year. Paid Travel to Work When Traveling Over 30 Miles at $0.57 CPM. Travel Cars Available. Health and Dental & Disability Insurance. 401(k) With Employer Contributions. Vacation, Sick Time, and Holiday Pay. Flexible Schedules. Paid Training and Orientation. $10,000 Free Whole Life Insurance. Employee discounts and Uniform Assistance. Company Outings and Events. Requirements: Min age 26 years of age. At least 1 year of Class A or B CDL experience. Ability to pass a pre-employment drug screen, background check and DOT physical. Courteous, punctual and professional. Call Us (417) 456-6468 FULL-TIME · $225 - $275 / DAY · GENEVA, NEW YORK Class B CDL Drivers Wanted For FitzGerald Brothers! MC28 Apply now", "grouping_count": 0}, {"id": 723570892633903, "advertiser_name": "Impact Recruiting Center", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["723570892633903_00.jpg"], "ad_text": "Impact Recruiting Center Sponsored $300 Sign On Bonus for employees that stay with the company for at least 4 months. Sky Logistics, an Independent FedEx Ground Contractor is now looking to hire experienced and non-experienced delivery drivers out of the Mount Juliet & Nashville areas. We offer flexible schedules for part time employees. Call our recruiters at c or APPLY ONLINE BELOW! ▶TERMINAL LOCATIONS◀ 1. 3301 Knight Dr. Nashville, TN 37207 2. 100 FedEx Way, Mt. Juliet, TN 37122 ▶SHIFTS AVAILABLE◀ 1. Monday to Friday 2. Tuesday to Saturday 3. Wednesday to Sunday 4. Friday to Sunday 5. Saturday and Sunday ▶PAY & BENEFITS◀ $150.00/Daily while in training. $170.00/Daily after training is completed. $40/Daily Bonus if you finish your route and help another driver. $50 Bonus if you work 6 days. $300 Sign On Bonus broken down in $100 increments for every 30 days worked. Paid Weekly via Direct Deposit. Wednesday-Sunday. Part Time Friday-Sunday. ▶REQUIREMENTS◀ Must be at least 21 years old. Must have a valid drivers license. No CDL required. Must be willing to obtain F endorsement upon hire. Must have a clean MVR. Must be willing to work weekends. Must be able or willing to lift packages up to 150 lbs. Must be able to pass a Drug Test and DOT Medical / Physical Exam (Paid by Employer!) No Felonies / Violent Misdemeanors or Drug-related Misdemeanors in the last 10 years. Have dependable transportation. If you are looking to begin your career as a professional Pickup and Delivery Driver, don't wait! Call or Apply today to get your application process started. Be your own boss! Finish your route and go home. Get paid a flat daily rate regardless how early you get done. Call Us 417-658-4449 FULL-TIME · MOUNT JULIET, TENNESSEE Full Time and Part Time FedEx Ground Delivery Drivers! F256 Apply now", "grouping_count": 0}, {"id": 584498893100828, "advertiser_name": "Impact Recruiting Center", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["584498893100828_00.jpg"], "ad_text": "Impact Recruiting Center Sponsored Gold Line, Inc., a Martz Bus Company, provides fixed-route commuter bus service to/from various locations in southern Maryland to Washington DC under contract with the Maryland Transit Administration (MTA). We also provide transportation for professional sports teams, veteran services, major college athletics, sightseeing, and local schools. We have immediate openings for Class A or B CDL Drivers. If you don't have your CDL, we can help you obtain it! Call our recruiters today at 417-456-6404 or apply online today! Pay & Benefits: $19.46/Hour Health/Dental/Vision Insurance Available 401k with up to 3% Company Match Sign On Bonus Available. Vacation and Sick Time Experience Preferred but NOT Required Paid Training/Orientation Requirements: Class A or B CDL highly preferred but not required (we will help you obtain your license) Will be required to obtain passenger endorsement once licensed. Must have a clean current driver's license for at least the past three years. Must be at least 21 years of age. Must be able to pass pre-employment drug screen, background check, and DOT physical. Call us today to start your application process OR apply online! FULL-TIME · $19.46 / HOUR · HYATTSVILLE, MARYLAND Full Time Motor Coach/Charter Bus Drivers Needed! MC25 Apply now", "grouping_count": 0}]