[{"id": 699781141611514, "advertiser_name": "Country True Value Hardware & Rental", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["699781141611514_00.jpg"], "ad_text": "Country True Value Hardware & Rental Sponsored Ready to jump start your career? Come join the team in one of the fastest growing equipment rental companies in the area. We need qualified and motivated individuals to keep our fleet of rental equipment ready to go. If you have interest in heavy equipment there is no better place to start. Nature of the Work: To maintain and repair all types of rental equipment. Keep entire fleet ready to rent and perform cleaning and servicing on equipment prior to and post rental. Diesel engines, electrical, hydraulics, and welding knowledge is a plus. Request ordering of parts, tools and equipment as necessary. Must be courteous, professional and knowledgeable with customers in regard to safety procedures and rental equipment. Position Tasks & Activities: Analyze equipment malfunctions. Repair power and mechanical equipment. Apply professional troubleshooting techniques to equipment repair. Maintain all decals, safety warnings and company ID stickers. Inform supervisor of warranty situations before repair is begun. Assist in training new mechanics, as requested by supervisor. Inform supervisor of equipment failures. Report all safety violations. Inform supervisor of needed parts. Complete work orders for internal and external repairs. Prepare accurate records on the maintenance, repair and fuel levels of equipment. Maintain an organized shop by returning tools and unused parts to the appropriate storage area. Implement preventative maintenance program. Maintain company vehicles. Check and refill equipment fuel. Clean, inspect, service and test equipment prior to tagging it “Ready to Rent.” Attend update/tech classes. Assist yard, warehouse and delivery personnel as necessary. Report safety violations to supervisor. Adhere to all company policies, procedures, rules and regulations in written or verbal form. Comply with government safety requirements and other regulations and security in store. Attend department, store and safety meetings. Perform other duties as requested. Working Conditions: Must stand for long periods of time. Work will be outdoors and indoors with general warehouse conditions, in which some work areas may not be heated or air conditioned. This job requires interaction with co-workers and with the public. This position requires frequent lifting and a significant degree of walking, bending and transporting objects of various weights and dimensions. May have exposure to chemicals, including but not limited to gasoline, diesel fuel, propane, kerosene and cleaning solvents. Propane is an obvious hazard; hence a sense of smell is required. Schedule is 4 weekdays and one weekend day. Education, Skills & Requirements: Valid Drivers License Must possess general knowledge in the field of mechanics. Prior experience is required Prior experience or knowledge of diesel engines, hydraulic systems, 2 and 4 stroke engines, and electrical systems. Secondary training schools or manufacturer programs preferred but not required. Must own basic set of mechanics tools A high school diploma or equivalent GED is required Welding experience is a plus Vocational education or certification in preferred. Must be able to lift approximately 70 lbs. Must maintain a professional personal appearance. Must use mathematics to solve problems. Must speak English clearly and write legibly. Ability to speak another language is a plus. Must maintain an acceptable attendance record. Must have a full range of motion and dexterity. Must be able to apply principles of rational thinking to solve problems. Must be able to provide, understand and complete instructions furnished in written, oral or scheduled form. Maintain a cooperative working relationship with co-workers. Must be able to maintain a high degree of patience. Reports to: Shop Foreman or Rental Manager 2 Locations: East Greenbush and Troy Benefits: Competitive pay, health and dental plan, employer sponsored 401 (k) plan, paid holidays and vacations (after minimum time is met), flexible hours, small company with family atmosphere. FULL-TIME · $20 - $40 / HOUR · EAST GREENBUSH Rental Heavy Equipment Mechanic / Technician Apply now", "grouping_count": 0}, {"id": 752800592513242, "advertiser_name": "Country True Value Hardware & Rental", "status": "Active", "date": "01/27/2023", "ad_url": [], "image_save_path": ["752800592513242_00.jpg"], "ad_text": "Country True Value Hardware & Rental Sponsored Country True Value Hardware & Rental is looking for a Small Engine Mechanic with thorough knowledge to maintain our fleet of rental equipment at its peak performance. This includes small engines, all STIHL powered 2 cycle equipment, generators, riding mowers (commercial & residential) and all other small engine work from our service center. Looking for 1-3 Full Time Mechanics. RESPONSIBILITIES: Responsible for the maintenance and repair of a variety of small engine rental equipment, riding mowers, push mowers and all 2 cycle engine equipment. Determines needs and orders parts and equipment as necessary. Maintains a safe work area, obeys safety rules, and ensures safety decals are properly displayed. May handle service calls to customer job sites and may make repairs at offsite customer location. Requirements: Must have your own tools. Must be able to lift approximately 70 lbs. Must maintain a professional personal appearance. Maintain a cooperative working relationship with co-workers. Must be able to maintain a high degree of patience. Must have experience with 2-cycle engines and all other small engines. Must possess a valid driver's license and a good driving record. Must be able to work weekends (Saturday). Benefits: At Country True Value, we place enormous value on the welfare and commitment of our employees as well as the superior level of service they provide for our customers. All our employees benefit from extensive on-the-job training which is among the best in the industry. Our advancement opportunities are why many of our staff remain with us throughout their careers. A career with Country True Value Inc. means diversity, teamwork, recognition for exceptional performance, and room to grow! We are proud to offer the following benefits: Health Insurance Dental coverage Company Based 401 K -Fully Match Retirement Plan Paid Holidays and Paid Time Off Paid Training Very Flexible Schedules- Salary based on experience. FULL-TIME · TROY Small Engine Mechanic Apply now", "grouping_count": 0}, {"id": 1381969122656561, "advertiser_name": "Country True Value Hardware & Rental", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["1381969122656561_00.jpg"], "ad_text": "Country True Value Hardware & Rental Sponsored Country True Value Hardware and Rental is the right company for you! We are a team and family-oriented organization that takes exceptional pride in what we do. If you have a passion for diesel engines, hydraulics, and construction equipment, this job is for you! The Rental Equipment mechanic repair, services, and maintains construction equipment onsite and occasionally at a customer location. Key Job Responsibilities This position requires the ability to work on various types of construction equipment, aerial lifts, and heavy equipment and small engines. Education and Experience Requirements • High School or equivalent, 3+ years of hands-on experience with diesel engines and hydraulics • Experience in the latest electronically controlled machinery and heavy equipment • Able to fully comprehend hydraulic and electrical schematics with a history of successful troubleshooting and technical experience • Experience with diagnostic software • 1 to 3 years of mechanic experience with diesel equipment, heavy construction equipment, and/or specialty lines equipment • Must be able to communicate verbally and written in a service-oriented manner to fellow team members, vendors, and manufacturers for questions and support • Perform work in a safe and responsible manner Job's Physical Demands and Work Environment: • Occasionally lifting up to 50 lbs. and infrequently lifting up to 75 lbs. • Ability to climb over and into heavy equipment occasionally. FULL-TIME · TROY Rental Equipment Mechanic Apply now", "grouping_count": 0}, {"id": 869791580813253, "advertiser_name": "Country True Value Hardware & Rental", "status": "Active", "date": "01/11/2023", "ad_url": [], "image_save_path": ["869791580813253_00.jpg"], "ad_text": "Country True Value Hardware & Rental Sponsored Essential Duties and Responsibilities: Drive single vehicles with a gross vehicle weight rating (GVWR) of 26,000 pounds or more; the operator may tow a vehicle with a GVWR of 9,999 pounds or more. Deliver general rental/high reach equipment, load chain and bind equipment to truck, verify order paperwork for completeness and accuracy, perform pre and post-trip inspections, communicate with dispatch to ensure equipment is delivered as efficiently as possible. Provide customers basic training upon delivery and record and report any damage to the equipment. Some minor vehicle maintenance and other duties assigned by management as required. Benefits: Competitive pay, paid vacations and holidays, Simple IRA retirement program with match. Following 90 days of employment candidate is eligible for medical and dental benefits. Some overtime is allowed and no OTR trucking, you will be home every night. Job Type: Full-time Experience: Heavy Equipment Hauling w/ binding & chaining: 1 year (Required) Class A Driving: 1 year (Required) License: Class A CDL (Required) FULL-TIME · $20 - $40 / HOUR · EAST GREENBUSH Class A CDL Truck Driver Apply now", "grouping_count": 0}]