[{"id": 5738047392911592, "advertiser_name": "Topline Trailer and Equipment Sales", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["5738047392911592_00.jpg"], "ad_text": "Topline Trailer and Equipment Sales Sponsored Established in 1993 as the third branch of Weagant Farm Supplies Ltd (est. 1953), Topline Trailer and Equipment quickly grew to become a leading sales and service provider of personal and commercial trailers and Kubota equipment to the areas of SD&G and rural Ottawa. We are looking for a Delivery Driver (full or part-time) with an eye for detail, who embodies our values by playing a vital role in representing the company well to customers and protecting the equipment and our fleet vehicles. Responsibilities: Load equipment and materials, including but not limited to tractors, blowers, mowers and agricultural components for delivery to customers. Complete required MTO and company inspections before departure. Pick up equipment from customers, as per direction from the Service Manager/Advisor. Operate vehicles, trailers and equipment in a safe manner. Perform and/or make Service Manager aware of preventative maintenance issues. Complete truck/mileage logs with accuracy. Ensure vehicles are cleaned regularly Customer product/safety demonstrations as required (training provided) how to start, run and turn off a lawn tractor, etc. All other duties as assigned Requirements: - Ontario Valid Driver’s A Class license (AR) - Clean driver and CVOR abstract - Able to work in Canada and available immediately - Forklift license or willingness to obtain - Positive attitude and willingness to learn - An understanding of, and experience in, providing excellent customer service - Willingness to work as part of a team - Punctuality is a must Join us because we are: A stable 70-year-old business committed to offering full time secure employment with benefits, RRSP matching program and Employee Assistance Program Continually growing and offer opportunities for advancement. Locally owned and family run. An owner is in the business every day of the work week Hours of Work: 8:00am - 5:00pm, Monday through Friday and 8:00am - 12:00pm, every other Saturday (as needed) Compensation: hourly wage plus health benefits, employee assistance program, RRSP matching program. Job Type: Full-time or Part-time Benefits: Employee assistance program Extended health care RRSP match FULL-TIME · WINCHESTER, ONTARIO Delivery Driver Apply now", "grouping_count": 0}]