[{"id": 1548740665539819, "advertiser_name": "Quality Patient Centered Services", "status": "Active", "date": "01/09/2023", "ad_url": [], "image_save_path": ["1548740665539819_00.jpg"], "ad_text": "Quality Patient Centered Services Sponsored NEEDED AT Laurel Highlands State Correctional Institution IMMEDIATE NEED!! RN's (1) SECOND SHIFT 1400-2230 FULL TIME W/ EVERY OTHER WEEKEND AND EVERY OTHER HOLIDAY (1) THIRD SHIFT 2200-0630 FULL TIME W/ EVERY OTHER WEEKEND AND EVERY OTHER HOLIDAY 8 hour shifts RN Rate: $65/hour flat rate MUST BE AVAILABLE FOR EVERY OTHER WEEKEND AND EVERY OTHER HOLIDAY THE POSITION Meet new challenges and make a significant difference in a unique and diverse population! Quality Patient Centered Services and The Pennsylvania Department of Corrections is actively seeking dedicated and conscientious Registered Nurses (RNs). This facility primarily houses inmates who have special needs including long term personal medical care, inmates who are on dialysis or bound to a wheelchair, and geriatric offenders. DESCRIPTION OF WORK As an independent contractor with Quality Patient Centered Services (QPCS), and the Pennsylvania Department of Corrections’ Health Care Team, you will assist in providing quality care to the Commonwealth of Pennsylvania Offender Population. RNs will apply clinical nursing skills, hands-on assessments, and will assist practitioners. RNs will assist with initial screenings, medication administration, health care emergencies, and physical health assessments. RNs shall maintain department compliance for inspections, participate in in-service training, and may provide health related education to staff and Offenders. REQUIRED EXPERIENCE, TRAINING & ELIGIBILITY Qualifications: Necessary Special Requirements - Possession of a current Pennsylvania license as a Registered Nurse issued by the Pennsylvania State Board of Nursing; or possession of a non-renewable temporary practice permit issued by the Pennsylvania State Board of Nursing. Legal Requirements: A required submission of criminal history reports. You must pass a background investigation. You must provide complete and accurate information or you may be disqualified. SCHEDULE: Full time hours 2nd shift (1400-2230) Full time hours 3rd shift (2200-0630) 8 hour shift Every other holiday a MUST RN Rate: $65/hour flat rate This is an incredible opportunity to showcase your skills to the facility which gives you a spotlight when applying for a full-time opportunity. Yes, some agencies may offer Health insurance, however, know what it is you’re paying for. Most staffing agencies offer indemnity plan which is not your major medical and if they do offer major medical you are paying full cost anyway. So, why not pick your own major medical benefit plan through the marketplace and control your own health insurance plan. We encourage you to check out the E Marketplace and what type of health insurance plans are available. They are very reasonable cost to individuals and families and offer great plans. This posting is for an hourly contract position and is non-benefits eligible This position does not offer benefits, paid time off, or overtime pay. It does not qualify for worker’s compensation or unemployment benefits. DESIRABLE EXPERIENCE: Experience as a Licensed Practical Nurse in a Correctional Facility or Emergency Room Experience involving mental or chemical health assessments Prior experience using Electronic Health Records (EMR) Core Competencies and professional traits necessary to perform this job. Promote a diverse, culturally competent, and respectful workplace Demonstrates knowledge of nursing practices, the practice of triage, nursing assessment, skilled nursing tasks, use of diagnostic instruments and apply independent nursing judgment Demonstrates a strong ability to make accurate and safe assessments of medical situations Demonstrates skills in assessing and creating care plans for inmate health care needs Demonstrates efficiency using electronic medical records Demonstrates ability to work with physicians, correctional nursing staff members, representatives of other agencies and correctional facility personnel Demonstrates ability to as part of a medical team an Demonstrates ability to handle difficult and behaviorally challenged persons and remain calm in tense or potentially threatening situations. FULL-TIME · $65 / HOUR · SOMERSET $65/hr RN - Corrections - SCI Laurel Highlands Apply now", "grouping_count": 0}, {"id": 910672040106155, "advertiser_name": "Quality Patient Centered Services", "status": "Active", "date": "01/09/2023", "ad_url": [], "image_save_path": ["910672040106155_00.jpg"], "ad_text": "Quality Patient Centered Services Sponsored NEEDED AT Laurel Highlands State Correctional Institution IMMEDIATE NEED!! LPN's (2) SECOND SHIFT 1400-2230 FULL TIME W/ EVERY OTHER WEEKEND AND EVERY OTHER HOLIDAY (3) THIRD SHIFT 2200-0630 FULL TIME W/ EVERY OTHER WEEKEND AND EVERY OTHER HOLIDAY 8 hour shifts LPN Rate: $45/hour flat rate NO PRN OR PART TIME MUST BE AVAILABLE FOR EVERY OTHER WEEKEND AND EVERY OTHER HOLIDAY THE POSITION Meet new challenges and make a significant difference in a unique and diverse population! Quality Patient Centered Services and The Pennsylvania Department of Corrections is actively seeking dedicated and conscientious Licensed Practical Nurses (LPNs). DESCRIPTION OF WORK As an independent contractor with Quality Patient Centered Services (QPCS), and the Pennsylvania Department of Corrections’ Health Care Team, you will assist in providing quality care to the Commonwealth of Pennsylvania Offender Population. LPNs will apply clinical nursing skills, hands-on assessments, and will assist practitioners and RNs on a daily basis. LPNs will assist with initial screenings, medication administration, health care emergencies, and physical health assessments. LPNs shall maintain department compliance for inspections, participate in in-service training, and may provide health related education to staff and Offenders. REQUIRED EXPERIENCE, TRAINING & ELIGIBILITY Qualifications: Necessary Special Requirements - Possession of a current Pennsylvania license as a Registered Nurse issued by the Pennsylvania State Board of Nursing; or possession of a non-renewable temporary practice permit issued by the Pennsylvania State Board of Nursing. Legal Requirements: A required submission of criminal history reports. You must pass a background investigation. You must provide complete and accurate information or you may be disqualified. SCHEDULE: Full time hours 2nd shift (1400-2230) Full time hours 3rd shift (2200-0630) 8 hour shift Every other holiday a MUST LPN Rate: $45/hour flat rate This is an incredible opportunity to showcase your skills to the facility which gives you a spotlight when applying for a full-time opportunity. Yes, some agencies may offer Health insurance, however, know what it is you’re paying for. Most staffing agencies offer indemnity plan which is not your major medical and if they do offer major medical you are paying full cost anyway. So, why not pick your own major medical benefit plan through the marketplace and control your own health insurance plan. We encourage you to check out the E Marketplace and what type of health insurance plans are available. They are very reasonable cost to individuals and families and offer great plans. This posting is for an hourly contract position and is non-benefits eligible This position does not offer benefits, paid time off, or overtime pay. It does not qualify for worker’s compensation or unemployment benefits. DESIRABLE EXPERIENCE: Experience as a Licensed Practical Nurse in a Correctional Facility or Emergency Room Experience involving mental or chemical health assessments Prior experience using Electronic Health Records (EMR) Core Competencies and professional traits necessary to perform this job. Promote a diverse, culturally competent, and respectful workplace Demonstrates knowledge of nursing practices, the practice of triage, nursing assessment, skilled nursing tasks, use of diagnostic instruments and apply independent nursing judgment Demonstrates a strong ability to make accurate and safe assessments of medical situations Demonstrates skills in assessing and creating care plans for inmate health care needs Demonstrates efficiency using electronic medical records Demonstrates ability to work with physicians, correctional nursing staff members, representatives of other agencies and correctional facility personnel Demonstrates ability to as part of a medical team an Demonstrates ability to handle difficult and behaviorally challenged persons and remain calm in tense or potentially threatening situations. FULL-TIME · $45 / HOUR · SOMERSET $45/hr LPN - Corrections - SCI Laurel Highlands Apply now", "grouping_count": 0}, {"id": 746543412993838, "advertiser_name": "Quality Patient Centered Services", "status": "Active", "date": "12/29/2022", "ad_url": [], "image_save_path": ["746543412993838_00.jpg"], "ad_text": "Quality Patient Centered Services Sponsored QPCS is seeking (CAOHC) Certified Hearing Conservationists to provide hearing testing to to the US Military at RHRP Group events across the US. Candidate must hold a current COHC Certification to assist with hearing testing for the Military. This is a very seasonal and per diem opportunity. QCPS can provide audio equipment or you can use your own. The rate of pay is dependent upon using our equipment or your own. Travel to Military Installations and events around the US to provide hearing testing for active-duty service members Perform pure tone threshold hearing testing Candidates must have: CAOHC certification prior to event in order to be eligible 1 year of audiology or hearing testing experience Must be able to travel and work weekend events at various Military installations around the U.S. Rates: The rate for this opportunity is $30 per hour and agrees to be paid as a 1099 independent contractor. Travel rate (greater than 250 miles) is $35 per hour. If you have your own currently CALIBRATED in GOOD working condition equipment the rate is $10 for any audiograms completed and $5 for no shows. Contact us to learn more. Travel expense eligible to be reimbursed and assisted in advance upon negotiation. If you are passionate, dedicated, committed and serious about working with the military, then we invite you to inquire. Time is of the essence and we only want motivated team members that are ready, able and willing that can adapt, be flexible, proactive, problem solvers, what true medical professionals are made of. If your main goal is for financial gains then this is not the right opportunity for you. We understand that everyone needs to make a living. This is a per diem opportunity to serve those who serve us and provide the best possible care to men and women who are willing to make the ultimate sacrifice for us and be paid to do so. We are looking for team members that see this opportunity as a privilege and the earning as a gift to be able to earn while working with the military and as an added bonus. If the financial gains are your primary concern, you are not right for the QPCS team and with you all the very best. Great and unique opportunity to provide the best in health care services to our nation's heroes. For us, this isn’t a job, it’s an honor. At our core is an unwavering dedication to serving the brave men and women who protect and serve this country. No matter the place, the time, or the service, we get the job done. And get it done right. Because our customers’ missions cannot fail. Travel expense eligible to be reimbursed and assisted in advance upon negotiation. Considerations: 1099 Independent contractor agreement. This posting is for an hourly contract position and is non-benefits eligible This position does not offer benefits, paid time off, or overtime pay. It does not qualify for worker’s compensation or unemployment benefits. Online event training required Future events possible Abide by all applicable HIPAA requirements and the 1974 Privacy Act requirements and its amendments. Represent QPCS and our partner in a professional and ethical manner. Dress in appropriate professional attire. Jeans, shorts, and open toe shoes are not acceptable. QPCS seasonally works with the US military; the clinics are such a blast and a great way to give back to those who serve our country, and be paid to do so! CONTRACT · $30 - $35 / HOUR OHC Certified Hearing Screener - US Military Group Event Apply now", "grouping_count": 0}, {"id": 527277222347374, "advertiser_name": "Quality Patient Centered Services", "status": "Active", "date": "05/10/2022", "ad_url": [], "image_save_path": ["527277222347374_00.jpg"], "ad_text": "Quality Patient Centered Services Sponsored Quality Patient Centered Services strives to provide top level clinical services to Our Brave Men and Woman of the United States Military. Now partnering with the Pennsylvania Department of Corrections and other Pennsylvania State Facilities! Quality Patient Centered Services Sign up", "grouping_count": 0}]