[{"id": 486233273670222, "advertiser_name": "Wooldridge Construction Group", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["486233273670222_00.jpg"], "ad_text": "Wooldridge Construction Group Sponsored Are you ready to join a company that will make you feel like family? Wooldridge Transportation Group is currently seeking 1 Class A/B Driver to operate our Roll off Dumpster Truck. As a Leader and trendsetter in the logistics world. Our company is expanding, and we want YOU to be a part of it. The hours are Monday- Friday 6:00 am - 5:00 pm home nights and weekends. $28 an hour 4-day work week Please contact Mark 812-246-1859. Operator Responsibilities: Performing pre/post trip inspections Safe operation of Roll off Dumpster Truck and other equipment as assigned. Hauling dumpsters on and off of customers construction sites Operator Qualifications 1-year Rolloff experience preferred Valid Commercial driver's license Ability to handle physical workload. Strong work ethic Ability to maintain records. Must comply with all DOT rules & regulations. Operator Benefits: 401k with a company match Health Insurance Weekly Pay Paid time off. Quarterly Bonus program FULL-TIME · $28 - $30 / HOUR · SELLERSBURG, INDIANA Roll off Dumpster Driver with 4 day work week! Apply now", "grouping_count": 0}, {"id": 756169132097274, "advertiser_name": "Wooldridge Construction Group", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["756169132097274_00.jpg"], "ad_text": "Wooldridge Construction Group Sponsored Wooldridge is seeking someone to help us expand our existing lines of business and identify paths for new development. We are looking for someone with a strong sales instinct. This role will be responsible for organizing prospects, identifying sales opportunities, setting appointments for customer meetings. Primary Duties and Responsibilities: Develop new business with existing clients. Meet with customers and prospective customers to discuss viable opportunities in an effort to understand their business needs, identify scope, submit a proposal, finalize the contract and win the business. Building and maintaining strong, long-lasting customer relationships Negotiate contract and spot market pricing to maximize profits. Secondary Duties and Responsibilities: Onsite Client Visits Qualifications preferred: Two years of demonstrated success in a sale role. Articulate and professional, enthusiastic attitude and a focus on results are required. Strong communication skills: ability to reach prospects creatively, position solution/products. Excellent phone presence and interpersonal skills Strong verbal, written and time management skills. Benefits: Company Car Medical, Dental, Vision Life Insurance Paid Holidays Paid Vacations 401k Base salary plus commission FULL-TIME · $52,000 - $80,000 / YEAR · SELLERSBURG, INDIANA Business Development Representative Apply now", "grouping_count": 0}]