[{"id": 1349160095896075, "advertiser_name": "SSPI Solutions", "status": "Active", "date": "01/13/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fsspi-solutions.com%2Fcareers&h=AT37BtMz-aQI3j9BxmJKI9YK9nqrZxqbr6dF1RUyOLvKE8G_9WmnrXAQoJ7IgHhusRfGcveFQMAQ-3BWJf7gYEqPC4HfJs4Uvt7TekEiMcpAtSGZxnpDq95383ykmVd6WkPmgYe0kn83FTefBCw2dItX1hCF1qIJmZRKbiZf", "https://l.facebook.com/l.php?u=http%3A%2F%2Fsspi-solutions.com%2Fcareers&h=AT300gz0H2Z6jXL-7gln7p8dxmVrCHbKIxCMNfgD2gD3Zb4T9gXRnug3q9OU39FByfzdNMibgWSEnJ5YYbbfzy2CFS47jhanZnl10xmJJLrZm6u4ZQw9_CDj399WPcbTAcHECjP3ziWMlCMlvwK2xxl5hso"], "image_save_path": ["1349160095896075_00.jpg"], "ad_text": "SSPI Solutions Sponsored NOW HIRING SIGN SERVICE TECHNICIANS - OPEN IMMEDIATELY $50-$60K/yr + Bonuses $200 per day for Base Pay & Per Diem + Regular Bonuses paid per route for benchmark being met + Additional Point Performance bonuses for exceeding benchmark Health Benefits at 90 days 401K at One Year Full Training provided Fantastic Culture Apply at sspi-solutions.com/careers Our main office is located in Waverly (Horton) Iowa and is the starting and ending point of every two week route. Our technicians travel to 23 different states to perform sign and lighting service on exterior corporate locations. We clean, inspect, re-lamp, diagnose wiring issues, take pictures and document damage of signage for our customer. All onsite work information is captured electronically and submitted via an easy to use website. Work is performed from an aerial bucket truck and our technicians typically work independently. Training, Tools, Travel Expenses, and Company Truck provided. Requirements: * Must be able to travel an average of 2 wks at a time (2wks on 1wk off) * Must have some basic electrical experience * Must be a self-starter * Must have an aptitude for troubleshooting and fixing things * Must be able to lift 50lbs on a regular basis * Must be comfortable operating aerial lifts with heights up to 50ft (our lifts have weight restriction of 300lbs) * Must be able to climb into small confined spaces (some signs require maintenance by climbing inside of them - space as small as 13 3/4in x 22 1/4 in) * Must have a valid driver’s license Must have a clean Motor Vehicle Report We are a personable, locally owned business that has been around since 2003. We are more than willing to answer ANY questions you have concerning the position. Message us or apply today! Apply at sspi-solutions.com/careers FULL-TIME · WAVERLY, IOWA Sign Service Technician Apply now", "grouping_count": 0}]