[{"id": 1183018392335689, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "01/03/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fannecarlsen.org%2Fcareers%2F&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["1183018392335689_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Join our Early Intervention team in Devils Lake, ND! Anne Carlsen is hiring for the following positions: 🟪 Early Childhood Education / Special Education / Early Childhood Special Education 🟪 Social Workers 🟪 Nurses 🟪 Occupational Therapists 🟪 Physical Therapists If your skill set would be a good fit for any of these roles, click the link to learn more! Hires for these positions receive competitive pay and benefits, including paid training, 401K with employer match, employee discounts, paid time off (PTO), and great advancement opportunities! Don't miss the opportunity to be a part of an organization whose mission is to make independence a gift to those in your community! *Relocation Assistance Available* ANNECARLSEN.ORG/CAREERS JOIN OUR TEAM IN DEVILS LAKE! Join our Early Intervention team Apply Now", "grouping_count": 0}, {"id": 470277475181156, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "12/14/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fannecarlsen.org%2Fcareers&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["470277475181156_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Are you looking for a rewarding career working with children on the autism spectrum? Anne Carlsen has immediate openings in Fargo, Jamestown, Bismarck & Minot for full and part-time Behavior Technicians to work one-on-one with children ages toddler and up. Anne Carlsen offers a supportive work environment, competitive pay and great benefits including 401k with employer match, and paid training. ANNECARLSEN.ORG Immediate Opening: Behavior Technicians Competitive pay and benefits! Learn More", "grouping_count": 0}, {"id": 905069557529777, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "12/14/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fannecarlsen.org%2Fcareers%2F&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["905069557529777_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Now hiring Direct Support Professionals. Sign-on Bonus of $750! Anne Carlsen DSPs receive competitive pay, benefits, employee discounts, paid time off (PTO), and great advancement opportunities! Opportunities available in: 🟪Jamestown 🟪Bismarck 🟪Fargo 🟪Grand Forks Don’t miss the opportunity to be a part of an organization whose mission is to make independence a gift to those in your community! *Relocation Assistance Available* WWW.ANNECARLSEN.ORG Now Hiring DSPs - $750 Sign-On Bonus! See Available Positions Learn more", "grouping_count": 0}, {"id": 1283261675738093, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "12/07/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fannecarlsen.org%2Fcareers&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["1283261675738093_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Now Hiring: Board Certified Behavior Analyst in Bismarck, ND. Relocation assistance is available. Anne Carlsen is seeking a Board Certified Behavior Analyst to join our rapidly growing and expanding ABA services in North Dakota. A full-time position is now available in Bismarck, ND. Join the Anne Carlsen team whose mission is to make the world a more inclusive place where independence is a gift to all. Anne Carlsen is a beloved non-profit organization providing individuals with developmental disabilities or delays with services and supports for 80 years. Anne Carlsen has positioned itself on the cutting edge of innovation with unique programs, creative therapies and advanced assistive technologies that provide life-changing programming to those we serve. To apply, click the link! ANNECARLSEN.ORG/CAREERS Now Hiring: BCBA in Bismarck Apply Now", "grouping_count": 0}, {"id": 491604782901415, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "10/17/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fannecarlsen.org%2Fcareers&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["491604782901415_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Now hiring: Occupational Therapist in Minot! Part-time or Full time. Are you looking for a meaningful career working with pediatrics and young adults? JOIN OUR TEAM! Anne Carlsen employees receive competitive pay and benefits, including paid training, 401K with employer match, employee discounts, paid time off (PTO), and great advancement opportunities! We're now hiring for an Occupational Therapist in Minot, ND. Don't miss the opportunity to be a part of an organization whose mission is to make independence a gift to those in your community! *Relocation Assistance Available* ANNECARLSEN.ORG/CAREERS OT Needed in Minot We employ over 600 individuals who are committed to make the world a more inclusive place where independence is a gift to all and have a passion for making a difference in the lives of the individuals we serve. Learn more", "grouping_count": 0}, {"id": 3389803047909823, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "07/21/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fannecarlsen.org%2Fcareers%2F&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["3389803047909823_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Join our team in Jamestown, ND! Anne Carlsen is offering sign-on bonuses up to $20,000 for the following roles: 🟪 Speech Language Pathologists 🟪 Occupational Therapists 🟪 Nurses If your skillset would be a good fit for any of these roles, click the link to learn more! Hires for these positions receive competitive pay and benefits, including paid training, 401K with employer match, employee discounts, paid time off (PTO), and great advancement opportunities! Don't miss the opportunity to be a part of an organization whose mission is to make independence a gift to those in your community! *Relocation Assistance Available* ANNECARLSEN.ORG Sign-On Bonuses Up to $20K! Join Our Jamestown Team Learn more", "grouping_count": 0}, {"id": 595180782156841, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "07/21/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fannecarlsen.org%2Fcareers&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["595180782156841_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Now hiring: Occupational Therapists in Valley City! Receive up to a $10,000 Sign-On Bonus! Are you looking for a meaningful career working with pediatrics and young adults? JOIN OUR TEAM! Anne Carlsen occupational therapists receive competitive pay and benefits, including paid training, 401K with employer match, employee discounts, paid time off (PTO), and great advancement opportunities! We're now hiring for the Occupational Therapist role in Valley City, ND. Don't miss the opportunity to be a part of an organization whose mission is to make independence a gift to those in your community! *Relocation Assistance Available* ANNECARLSEN.ORG/CAREERS OTs Needed in Valley City $10,000 sign-on bonus! Learn More", "grouping_count": 0}, {"id": 778420780002310, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "07/21/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fannecarlsen.org%2Fcareers%2F&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["778420780002310_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Sign-on Bonuses up to $15K for Speech Language Pathologists. Join our Early Intervention team in Devils Lake, ND! Anne Carlsen is offering sign-on bonuses up to $15,000. If your skill set would be a good fit for this role, click the link to learn more! Hires for these positions receive competitive pay and benefits, including paid training, 401K with employer match, employee discounts, paid time off (PTO), and great advancement opportunities! Don't miss the opportunity to be a part of an organization whose mission is to make independence a gift to those in your community! *Relocation Assistance Available* ANNECARLSEN.ORG/CAREERS Join Our Team in Devils Lake! Sign-on Bonuses up to $15K Learn More", "grouping_count": 0}, {"id": 1078485709541547, "advertiser_name": "Anne Carlsen Center", "status": "Active", "date": "07/21/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fannecarlsen.org%2Fcareers&h=AT2uzp4KAB39xgWrtdMfuuUPmIyREmpV74J40bzct_i8WfZjTLVudwHhvbYE5Xf7OdV5H8r2woTeLdqisHi1ce4o88SpPljNdjN2-kLt3qHmBA5U3fhLkcuwdz67W0gL_sxKs7_yYBFsfARFeEDH-owM3_Vkb4RvQflZARg2luA"], "image_save_path": ["1078485709541547_00.jpg"], "ad_text": "Anne Carlsen Center Sponsored Now hiring: Occupational Therapist and Speech Language Pathologist in Grand Forks! Relocation assistance available. Are you looking for a meaningful career working with pediatrics and young adults? JOIN OUR TEAM! Anne Carlsen employees receive competitive pay and benefits, including paid training, 401K with employer match, employee discounts, paid time off (PTO), and great advancement opportunities! We're now hiring for both the Occupational Therapist and Speech Language Pathologist roles in Grand Forks, ND. Don't miss the opportunity to be a part of an organization whose mission is to make independence a gift to those in your community! *Relocation Assistance Available* ANNECARLSEN.ORG/CAREERS OTs and SLPs Needed in Grand Forks Learn More", "grouping_count": 0}]