[{"id": 1153942701976469, "advertiser_name": "United Contractors, Inc.", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.unitedcontractors.net%2Femployment&h=AT0XHUEk2g5t-txbnQHHUpLhTsQiiSDis5_mNlNAgL28Aq9CpkwvonDbQugb72iYvJMfiZ9Y8RTa8UDgPzSKePAi_GPQf7HUfNeRsnVDgKiwpSa52Llrs6Dmv4fgE1aTssI8FXKPRAG53JX62EpqE-GhUI0"], "image_save_path": ["1153942701976469_00.jpg"], "ad_text": "United Contractors, Inc. Sponsored Job Description We are currently expanding our business, and seeking hardworking and dependable bridge construction laborers to join our company on a project in Janesville, IA. Successful applicants should have a valid driver's license and be able to use hand tools, effectively work at heights, shovel materials and tie reinforcing steel, drive nails, lift up to 50 pounds regularly, follow safety rules, and work with a positive attitude. Applicants must be willing to travel, as the job requires. BENEFITS Comprehensive insurance includes dental, short-term disability, health, life, prescription, and vision. EMPLOYEE COVERAGE IS FREE after 2 months of service, and families may be added at a low premium. Other benefits include employee stock ownership plan (ESOP), 401k, year-end bonuses, training expenses and on-the-job training, holiday and vacation pay, per diem, military and funeral leave, among other benefits. $1,500 Signing Bonus after 6 months CAREER PATH Typical hires include laborers, carpenters, crane operators, truck drivers, mechanics, project managers, estimators, and field superintendents. We strongly encourage promotion from within our ranks and are therefore keen on providing you the tools for your own personal and professional growth. If interested in joining our team, please apply for immediate consideration. Please visit www.unitedcontractors.net/employment or call Ashley at 515-276-6162 for more information regarding our company. Equal Opportunity Employer, including disabled and veterans. FULL-TIME · $25 / HOUR · JANESVILLE, IOWA Bridge Construction Laborer- Janesville, IA Apply now", "grouping_count": 0}, {"id": 576535407180568, "advertiser_name": "United Contractors, Inc.", "status": "Active", "date": "01/10/2023", "ad_url": [], "image_save_path": ["576535407180568_00.jpg"], "ad_text": "United Contractors, Inc. Sponsored United Contractors is seeking a Truck Driver to haul supplies and equipment to and from bridge construction job sites in Iowa and surrounding states. Must have a Class A CDL. Must have experience pulling high deck and/or lowboy trailers. Must be able to pass a DOT Interstate Non-Excepted physical. Must be able to pass a drug screen. Must be willing to travel overnight as required. Must bring a positive attitude and the ability to work safely and follow safety rules. BENEFITS Insurance: health, dental, short-term disability, life, prescription, and vision. Single coverage is free to employee, and families may be added at a low premium. Other benefits: employee stock ownership plan (ESOP), 401k, year-end bonuses, training expenses and on-the job training, $20/ day per diem when staying out, 1 week vacation, 7 paid holidays, military and funeral leave. $1,500 Signing Bonus after 6 months of employment. $1,500 referral bonus after 6 months of employment by a referred employee. Starting wage is dependent on experience. If interested in joining our team, please apply for immediate consideration or contact Tyler at 515-494-7438. FULL-TIME · JOHNSTON, IOWA Truck Driver Apply now", "grouping_count": 0}, {"id": 1329419761126001, "advertiser_name": "United Contractors, Inc.", "status": "Active", "date": "01/05/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.unitedcontractors.net%2Femployment&h=AT0GNRLkX-epquDkVG2dwfwAIz-1Q0TM3z43WTgQiFVVaEDlY4D9zfqx5g13X-lCyF1zfn3ULRyduejHrvSgxZR-QdYZoYEO5R9kMFaDnEujxSqDoYLH0_vbpswvu5RvIDD4xhsFS16U_m_kjivGfe4vLXo"], "image_save_path": ["1329419761126001_00.jpg"], "ad_text": "United Contractors, Inc. Sponsored We are currently expanding our business, and seeking hardworking and dependable bridge construction laborers to join our company on projects around the Des Moines Metro Area including Johnston and West Des Moines, IA. Successful applicants should have a valid driver's license and be able to use hand tools, effectively work at heights, shovel materials and tie reinforcing steel, drive nails, lift up to 50 pounds regularly, follow safety rules, and work with a positive attitude. Applicants must be willing to travel, as the job requires. BENEFITS Comprehensive insurance includes dental, short-term disability, health, life, prescription, and vision. EMPLOYEE COVERAGE IS FREE after 2 months of service, and families may be added at a low premium. Other benefits include employee stock ownership plan (ESOP), 401k, year-end bonuses, training expenses and on-the-job training, holiday and vacation pay, per diem, military and funeral leave, among other benefits. $1,500 Signing Bonus after 6 months CAREER PATH Typical hires include laborers, carpenters, crane operators, truck drivers, mechanics, project managers, estimators, and field superintendents. We strongly encourage promotion from within our ranks and are therefore keen on providing you the tools for your own personal and professional growth. If interested in joining our team, please apply for immediate consideration. Please visit www.unitedcontractors.net/employment or call Ashley at 515-276-6162 for more information regarding our company. Equal Opportunity Employer, including disabled and veterans. FULL-TIME · $25 / HOUR · DES MOINES, IOWA Bridge Construction Laborer Apply now", "grouping_count": 0}]