[{"id": 1564973730668556, "advertiser_name": "Entegra Energy Solutions", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["1564973730668556_00.jpg"], "ad_text": "Entegra Energy Solutions Sponsored **MUST HAVE A MINIMUM OF 2 YEARS OF CDL DRIVING EXPERIENCE** We operate on a 24/7 basis (including holidays and weekends) within the WV, PA, and OH region. - Applicant must have the ability to safely and successfully preform the essential job functions, be drug free, have reliable transportation to work, hold a valid CDL drivers license with a tanker endorsement, and have an active cell phone for communicating work schedules. FULL-TIME · $26.50 / HOUR · LOST CREEK, WEST VIRGINIA Hydro-Vac Driver / Operator Apply now", "grouping_count": 0}, {"id": 403374031992496, "advertiser_name": "Entegra Energy Solutions", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["403374031992496_00.jpg"], "ad_text": "Entegra Energy Solutions Sponsored We are seeking a dependable and efficient CDL truck driver. Must be organized, detailed oriented, and comfortable working independently. A clean driving record and 2 years of commercial driving experience is a must. Entegra Energy Solutions operates a drug-free environment, and all candidates will be subject to pre-employment drug testing, background and MVR checks, as well as random drug testing. Job Duties Include: - Fully understand how to operate and safely drive your assigned vehicle. - Drive vehicles with a Gross Vehicle Weight (GVW) over 26,000 lbs. - Pick-up and safely transport goods to the intended destination. - Ensure contents are properly secured in a truck, trailer, or flatbed to prevent damage/injury. - Obtain signatures to confirm and complete deliveries. - Stay on a predetermined route and ensure timely transport and delivery. - Communicate with dispatch as needed. - Confirm that the contents of each shipment load match the manifest document. - Perform inspections of your vehicle prior to and following each trip. - Check weather conditions and road reports before departure. - Always ensure your vehicle is kept clean. - Notify managers of any major maintenance or delivery issues encountered. - Adhere to company rules and regulations. - Obey all applicable traffic laws and drive in according to the weather/road conditions. Minimum Requirements: - Must have a valid medical card. - Operate commercial trucks on natural gas drilling and production projects and locations. -Minimum of 2 years of commercial driving experience. Benefits and Perks: - Medical, Dental, and Vision Insurance. - 401k - Paid Time Off - Rotating Work Schedule **Entegra Energy Solutions is an equal opportunity employer. Apply via Facebook ad or in person at: 8391 Mount Clare Rd. Lost Creek, WV 26385 FULL-TIME · $24 / HOUR · LOST CREEK, WEST VIRGINIA CDL Driver (Roll Off Truck) Apply now", "grouping_count": 0}, {"id": 1318972028882787, "advertiser_name": "Entegra Energy Solutions", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["1318972028882787_00.jpg"], "ad_text": "Entegra Energy Solutions Sponsored Work within our utility services division moving small construction equipment (mini's, skid steers) and material from our Lost Creek facility to the job sites. Mainly Monday thru Friday work, with occasional weekend runs when necessary. -Must have had valid CDL for 2 years. -Know how to operate equipment in order to self load / unload. **Not looking for independent hot shot haulers to contract. We have our own units and trailers. FULL-TIME · $19 - $22 / HOUR · LOST CREEK, WEST VIRGINIA Hot Shot Driver (CDL) Apply now", "grouping_count": 0}]