[{"id": 511152707577237, "advertiser_name": "Houston Methodist", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.houstonmethodistcareers.org%2Ffb-2-6&h=AT3JMlkUoK5qW6UhvtgeZwQA9z_ZofIlH0WEI9xAFq4xrj_eIUWosRQ17gWlJUx72bdC0W_kpZsDDqKI6wrorGbIcKnhb0iV2UClEOUiEZ7X8LT73eVznEEshoGlmoX-rDGDuh34o1SjdhGi_RboIIgV64h7T4qffQZB-vDoYOY"], "image_save_path": ["511152707577237_00.jpg"], "ad_text": "Houston Methodist Sponsored Houston Methodist Hospital is hosting an In-Person Hiring Event for Patient Care Assistants on 2/6 from 10am-3pm. Get a sense for our world-class culture, and explore career opportunities across our specialties. Register today! HMH.HOUSTONMETHODISTCAREEREVENTS.COM Patient Care Assistant Hiring Event Register to attend our hiring event and meet with Recruiters and Hiring Managers. Can't attend the event? Please register and apply to any open positions we have posted online. Sign up", "grouping_count": 0}, {"id": 1318567978930270, "advertiser_name": "Houston Methodist", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.houstonmethodistcareers.org%2Ffb-hmh&h=AT3JMlkUoK5qW6UhvtgeZwQA9z_ZofIlH0WEI9xAFq4xrj_eIUWosRQ17gWlJUx72bdC0W_kpZsDDqKI6wrorGbIcKnhb0iV2UClEOUiEZ7X8LT73eVznEEshoGlmoX-rDGDuh34o1SjdhGi_RboIIgV64h7T4qffQZB-vDoYOY"], "image_save_path": ["1318567978930270_00.jpg"], "ad_text": "Houston Methodist Sponsored At Houston Methodist Hospital, the healthcare and support professionals that collaborate within our walls on a daily basis are what continues to allow us to provide care that is second to none. And they can assist the community knowing that Houston Methodist Hospital will care for them in return. Professional development, benefits to support life at work and home, competitive compensation to name a few. But perhaps most importantly - a team that truly cares about you. HOUSTONMETHODISTHOSPITALCAREERS.COM Career Opportunities at Houston Methodist Apply online for Nursing, Allied Health or Support Services jobs at Houston Methodist Hospital - the Number One Employer in Texas. Learn more", "grouping_count": 0}, {"id": 849318166363455, "advertiser_name": "Houston Methodist", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.houstonmethodistcareers.org%2Foom-fb-2023&h=AT3JMlkUoK5qW6UhvtgeZwQA9z_ZofIlH0WEI9xAFq4xrj_eIUWosRQ17gWlJUx72bdC0W_kpZsDDqKI6wrorGbIcKnhb0iV2UClEOUiEZ7X8LT73eVznEEshoGlmoX-rDGDuh34o1SjdhGi_RboIIgV64h7T4qffQZB-vDoYOY"], "image_save_path": ["849318166363455_00.jpg"], "ad_text": "Houston Methodist Sponsored At Houston Methodist, our 30,000 bright minds and warm hearts live their values every day. Here, people come first. We believe in teamwork, respecting each voice, and championing growth in every role. We are Houston Methodist. And we invite you to come lead with us. Explore Nursing careers with up to $10,000 Sign on Bonuses and relocation assistance. NURSING.HOUSTONMETHODISTCAREEREVENTS.COM Nursing Opportunities - Relocate to Houston We’re seeking experienced nurses to relocate to Houston and join our exceptional nursing organization in hospital locations throughout Greater Houston in the following specialties: Learn more", "grouping_count": 0}, {"id": 1219796485579479, "advertiser_name": "Houston Methodist", "status": "Active", "date": "01/18/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.houstonmethodistcareers.org%2Fhmcl-fb-1-31&h=AT3JMlkUoK5qW6UhvtgeZwQA9z_ZofIlH0WEI9xAFq4xrj_eIUWosRQ17gWlJUx72bdC0W_kpZsDDqKI6wrorGbIcKnhb0iV2UClEOUiEZ7X8LT73eVznEEshoGlmoX-rDGDuh34o1SjdhGi_RboIIgV64h7T4qffQZB-vDoYOY"], "image_save_path": ["1219796485579479_00.jpg"], "ad_text": "Houston Methodist Sponsored Houston Methodist Clear Lake Hospital is hiring RNs in our emergency department! We are offering a Sign-On Bonus of up to $10K. Speak with the recruitment team at our upcoming happy hour networking event on 1/31, and learn more about a nursing career with us! Register here: CLEARLAKE-RN.HOUSTONMETHODISTCAREEREVENTS.COM ER RN Networking Event - Houston Methodist Clear Lake Houston Methodist Clear Lake Hospital, voted the number one employer and best hospital in Texas by Forbes Magazine, has exceptional opportunities to join our team as we continue to grow. Located on the shores of Clear Lake across from the Johnson Space Center, the facility offers advanced medical an... Sign up", "grouping_count": 0}, {"id": 2848470081952394, "advertiser_name": "Houston Methodist", "status": "Active", "date": "01/17/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.houstonmethodistcareers.org%2Ffb-1-31&h=AT3JMlkUoK5qW6UhvtgeZwQA9z_ZofIlH0WEI9xAFq4xrj_eIUWosRQ17gWlJUx72bdC0W_kpZsDDqKI6wrorGbIcKnhb0iV2UClEOUiEZ7X8LT73eVznEEshoGlmoX-rDGDuh34o1SjdhGi_RboIIgV64h7T4qffQZB-vDoYOY"], "image_save_path": ["2848470081952394_00.jpg"], "ad_text": "Houston Methodist Sponsored Join Houston Methodist Baytown Hospital at our upcoming hiring event on 1/31! Explore careers across our hospital, with opportunities on our Nursing, Imaging, Lab, Pharmacy, Allied Health, and Support Service teams! Register here: BAYTOWN.HOUSTONMETHODISTCAREEREVENTS.COM Hiring Event at Houston Methodist Baytown Hospital Houston Methodist Baytown Hospital, located 35 miles east of downtown Houston, is the area's only full-service hospital offering specialized medical care for patients at every stage in life. This 230 operating beds hospital with 15 operating rooms and over 1,700 employees brings Medical Center excel... Sign up", "grouping_count": 0}]