[{"id": 856021272328346, "advertiser_name": "JobOdds", "status": "Active", "date": "01/27/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Ficmcf.hirescore.com%2F&h=AT2sbv2G8NzZKgWANeo3pxcNZyr2ABWKvwN9c7KVkgoxnxCdviGBPQzAZagmFemxeSs8UKxVwzMWwFnA_Zo-KlENkuDLtDUxOzgV52aGv1IuMB530772575n_MeVKiZDMOSKMTCIv9RrtoJtNGnXKi0VxOQ1VoMA2BJSDm4-HE8"], "image_save_path": ["856021272328346_00.jpg"], "ad_text": "JobOdds Sponsored CRYSTAL FALLS, MI -- The Iron County Medical Care Facility is hiring full-time and part-time nurses in the following positions. All levels of experience encouraged to apply. •RN: $32.23-$36.37* per hour + choice of $7,500 sign-on bonus or $25,000 loan debt repayment. •LPN: $26.97-$28.69* per hour + choice of $7,500 sign-on bonus or $25,000 loan debt repayment. •CNA: $21.43-22.92* per hour + $2,000 sign-on bonus. *Pay includes direct care worker supplement. •Medical, dental, vision, and life insurance. •Generous retirement plan. •Paid vacation, paid holidays, and paid sick time. •Uniform allowance. If you are a Licensed RN, LPN or CNA in the State of Michigan, consider this caring career choice. To learn more or apply, please visit https://icmcf.hirescore.com/ FULL-TIME · CRYSTAL FALLS, MICHIGAN RNs, LPNs & CNAs: full & part-time available Apply now", "grouping_count": 0}, {"id": 3361928847355844, "advertiser_name": "JobOdds", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fnorthernmutual.hirescore.com%2Fjob%2Fclaims%2F&h=AT1lCSz_EuGQQkl8W6amJPQliEppKSuor-Z8vyVZ0icEPmADDLfHjCgoSeKBOQyp_MtebEpIBeYrbGs9OzBsoJ3UJP0zZ_jaYqs3BXzQMezhJAmE-Y_NwZqt7Q3pwkg3WwQBzF1HfC9X_3j9H1efIxRUCenVGrn362kL-7wpGM4"], "image_save_path": ["3361928847355844_00.jpg"], "ad_text": "JobOdds Sponsored HANCOCK, MI -- Northern Mutual Insurance Company is hiring a full-time Claims Representative to join their Auto Physical Damage team. This is an excellent opportunity for someone with good assessment skills to learn and grow in the insurance industry. The ideal person for this position is someone who has basic knowledge of vehicles, likes to work both inside and outside an office setting, and enjoys solving problems. Previous experience working in auto insurance claims helpful, but not required. We will train someone who has a great work ethic and wants to learn more about our company. WHAT WE OFFER. ·$20.00 or more per hour based on experience. ·Health insurance; long-term disability insurance. ·401(k) retirement plan. ·Paid vacation and paid sick time. ·Opportunity to advance your position and pay in the company. ·Full-time Monday - Friday position generally working 8:00am - 4:30pm. Additional hours may be required to respond to policyholder needs in times of catastrophic events. If you are 18 years of age or older, have a valid driver’s license, and enjoy working in a professional office environment, consider this career opportunity. To learn more or apply, please visit https://northernmutual.hirescore.com/job/claims/ FULL-TIME · $20 / HOUR · HANCOCK, MICHIGAN Claims Representative Apply now", "grouping_count": 0}, {"id": 711774137327127, "advertiser_name": "JobOdds", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fnorthernmutual.hirescore.com%2Fjob%2Fbilling%2F&h=AT0LEDoUrnyIJlt6fmFaFKniNzEwiBY3y-x1mTIqC7hz8kIsE9KbXhK1szaWGSLD7VU7R9tx5pczPzIBNT4BqXh64MrLtkCqWs3QytDzAOZAXbL25aEN2zCV8J3snR7_u7sgLzE4a2RdJRqe60voYK5iX070JnqLxzoRqyepng8"], "image_save_path": ["711774137327127_00.jpg"], "ad_text": "JobOdds Sponsored HANCOCK, MI -- Northern Mutual Insurance Company is hiring a full-time Billing Specialist to join their team. This is an excellent opportunity for someone motivated who wants to work in an office environment learning about the insurance industry. This position will enter and prepare daily cash deposits, complete daily reconciliations, process policy credits, invoices and cancellations. Previous experience working in an insurance office helpful, but not required. We will train someone who has a great work ethic and wants to learn more about our company. WHAT WE OFFER. ·$16.50 or more per hour based on experience. ·Health insurance; long-term disability insurance. ·401(k) retirement plan. ·Paid vacation and paid sick time. ·Opportunity to advance your position and pay in the company. ·Full-time Monday-Friday position generally working 8:00am – 4:30pm. If you are 18 years of age or older and have strong computer skills, this may be a perfect fit for you. Accounting experience with QuickBooks (or other accounting software experience) is helpful, but not required. We will provide training for someone with a great personality, exceptional customer service skills, and who is detailed and accurate in their work. To learn more or apply, please visit https://northernmutual.hirescore.com/job/billing/ FULL-TIME · $16.50 / HOUR · HANCOCK, MICHIGAN Billing Specialist Apply now", "grouping_count": 0}, {"id": 1192469321708552, "advertiser_name": "JobOdds", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fenercon.hirescore.com%2F&h=AT1ioUD4w63-jMv0hcX_xpfS714OfwOVo_DefpdaXczxipf6qLtC5l-_KcEbQA6pOChUKdwFQwOVQeS4JKsiQO9W2SDNP3FXWMFLnJzuNDuvgzfN9W97Ab1oxHAPEl0HwPLVNlbFFxCK7FZTkjRzsIRViiRC1IS88hz4DClapJ4"], "image_save_path": ["1192469321708552_00.jpg"], "ad_text": "JobOdds Sponsored GERMANTOWN, WI -- Enercon Industries Corporation is hiring a Manufacturing Manager. Enercon is expanding and expects to finalize a new headquarter facility in Germantown, Wisconsin by the end of 2023. During this phase, time will be spent between both Menomonee Falls and Germantown. This position is both a leadership and hands-on position responsible for manufacturing activities beginning with staged materials through packaged final product with focus on creating capacity and capability within the organization to support sales demand. The ideal candidate is results-driven with a broad manufacturing and industrial engineering skillset able to ensure achievement of production goals. WHAT WE OFFER. •Excellent starting salary based on experience. •Bonus plan. •Medical, dental, vision, life, and disability insurance; health reimbursement account. •Paid time off and paid holidays. •401(k) retirement plan with a profit-sharing employer contribution. •Supportive team members committed to each other’s success. If you thrive on finding ways to improve processes, are a positive example of servant leadership, and able to hold others accountable, this may be a perfect fit for you. To learn more or apply, please visit http://enercon.hirescore.com/ JobOdds Website, Business Send message", "grouping_count": 0}, {"id": 693353208919583, "advertiser_name": "JobOdds", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fenercon.hirescore.com%2Fjob%2Fdirector-quality%2F&h=AT2JOk0ONNwV7ChdnAn4UL0Ep9AY-T1hJg-vqfHGH-s2TCnbX2lP-3mJYRHSjHEzgbGf56JMLycrR_xiOCM2QvTFo9tFXJWqspvrNV85PxSHNQvQrAtV80gSDbai_gdA7t6fSOfIG0UDMm0dB3FEBty20McWiPnrbDNDlmDcPR96dvRl7CTuK59Q"], "image_save_path": ["693353208919583_00.jpg"], "ad_text": "JobOdds Sponsored MENOMONEE FALLS, WI -- Enercon Industries is hiring an experienced Director of Quality and Continuous Improvement to join their team. Enercon is expanding and expects to finalize a new headquarter facility in Germantown, Wisconsin by the end of 2023. During this phase, time will be spent between both Menomonee Falls and Germantown. This position is responsible for defining and implementing quality and continuous improvement across the organization. WHAT WE OFFER. ·Excellent starting salary based on experience. ·Bonus plan. ·Medical, dental, vision, life, and disability insurance; health reimbursement account. ·Paid time off and paid holidays. ·401(k) retirement plan with a profit-sharing employer contribution. ·Fast paced, dynamic environment serving multiple niche industrial markets. ·Supportive team members committed to each other’s success. If you have industry experience operating in and managing quality management systems and a degree in a relatable engineering or manufacturing discipline, consider this career opportunity. To learn more or apply, please visit https://enercon.hirescore.com/job/director-quality/ FULL-TIME · MENOMONEE FALLS, WISCONSIN Director of Quality & Continuous Improvement Apply now", "grouping_count": 0}, {"id": 742541440289905, "advertiser_name": "JobOdds", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fuppco.hirescore.com%2F&h=AT0WzuwsLfsiW1rrKil-xA18H3vSLyyt2j0FIAUzYT081LndeEQxsD1cQHLqBxfLvPABcfJ20DYcpSJybGBrq8c8gd6pZ70HQkkiy0AYlzBaztsrEDVdtFd5JVkH19_rXI3NzOKgHppwUkzJmLjc-SRXT-bn2Um0FxIKmWOqD2Y"], "image_save_path": ["742541440289905_00.jpg"], "ad_text": "JobOdds Sponsored ESCANABA, MI -- UPPCO is hiring a Maintenance Generation Specialist to join their team at the Escanaba Hydroelectric Dam site. This position ensures safe and reliable generation of electricity by operating, inspecting, and maintaining turbines, generators, auxiliary equipment, buildings, grounds, and dams associated with various types of generating facilities. WHAT WE OFFER. •$30.40 – $44.00 per hour based on experience. •Comprehensive health and benefit package. If you have at least 3 years in an industrial, military, electric generation or utility environment operating and maintaining mechanical and/or electrical equipment, this may be a perfect fit for you. Preference given to candidates with hydroelectric generating facility experience. To learn more or apply, please visit https://uppco.hirescore.com/ FULL-TIME · $30.40 - $44 / HOUR · ESCANABA, MICHIGAN Maintenance Generation Specialist Apply now", "grouping_count": 0}, {"id": 876012070110551, "advertiser_name": "JobOdds", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fdvs.hirescore.com%2F&h=AT1W8yr8KlKqOA5UTiK9fxWGKf4o71dCRYKaEBTfgwwzQ03rDznO1XG5_ixsHh3kaooPAfVzNbVijpqrd87d1X0NndgMulpBXT2hp8ArKrxd8F4DeP7Ke5gNwIBn1lCYhpAbaMLIeDs15p9Jd9rb9Em6KH-30fxcEFKDFbiNurY"], "image_save_path": ["876012070110551_00.jpg"], "ad_text": "JobOdds Sponsored BARAGA, MI -- Davis Village Solutions, a product development and manufacturing company, is hiring full-time and part-time General Laborers. If you're someone flexible to work in a variety of roles from ordering and tracking inventory to organizing the warehouse and assisting with trailer assembly, this may be a perfect fit for you. This is an excellent opportunity to hone your skills in manufacturing, become familiar with our company, and transition into higher levels of responsibility and pay. Previous manufacturing or industrial experience preferred, but not required. We will train someone motivated to learn. •$17.00 per hour starting pay. •Monday–Friday position working 7am–3:30pm. •Schedule flexibility available for part-time positions. •No weekends. If you're 18 years of age or older and mechanically inclined with exceptional attention to detail, consider this opportunity. To learn more or apply, please visit https://dvs.hirescore.com/ DVS is located at 457 N. Superior Avenue, Baraga, Michigan 49908. FULL-TIME · $17 / HOUR · MARQUETTE, MICHIGAN General Laborer: full & part-time positions available Apply now", "grouping_count": 0}]