[{"id": 644977570759112, "advertiser_name": "Flamingo Trucking Inc.", "status": "Active", "date": "01/11/2023", "ad_url": [], "image_save_path": ["644977570759112_00.jpg"], "ad_text": "Flamingo Trucking Inc. Sponsored Service Mechanics needed for full time Employment. Wage range $17.50-$26.00 Day and Night shifts Service Mechanics job functions is to perform DOT level inspections on all fleet tractor trailer equipment on a regular basis. Trouble shoot and identify and correct any defected equipment. Maintaining preventative maintenance on all equipment including regular inspections, grease and lube services, welding, wiring, break/seal services, and fabrication. Qualifications for employment: Applicants must have a Valid Drivers license Class A CDL is not required but preferred, Clean MVR (motor vehicle record) and reliable transportation to and from work. Must have general knowledge of tractor trailer maintenance. Applicants should have own tools and storage. Applicants must have positive attitude and aptitude for learning on the job and be able to take direction from supervisors. Full benefit package after 60 days includes Health or HSA plan, dental, vision, 401k plan (all employees automatically signed up can opt out if desired), accidental insurance (paid by employee) company pays 75% of employee benefits, employee pays all of spouse and children’s benefits. FULL-TIME · $17.50 - $26 / HOUR · OTHELLO, WASHINGTON Tractor Trailer Mechanic Apply now", "grouping_count": 0}, {"id": 885142619488441, "advertiser_name": "Flamingo Trucking Inc.", "status": "Active", "date": "01/11/2023", "ad_url": [], "image_save_path": ["885142619488441_00.jpg"], "ad_text": "Flamingo Trucking Inc. Sponsored Professional Drivers! Join the Flamingo Trucking INC. team today! We are currently looking to hire both Day and Night shifts drivers. $20.00-26.00 per hour pay range experience/shift and safety based. $20.00 per hour starting wage, after 60 day probationary period wages will reviewed. Full benefit package after 60 days includes Health or HSA plan, dental, vision, 401k plan (all employees automatically signed up can opt out if desired), accidental insurance (paid by employee) company pays 75% of employee benefits, employee pays all of spouse and children’s benefits. Safety based monthly incentive program. Overtime after 48Hrs (agriculture regulations) guarantee 50 hours per week unless plant has scheduled maintenance shut down. Once fully staffed we plan on running 10-hour shifts days and nights with scheduled weekends off. Qualifications: 2 years Class A CDL experience or two years farm exempt experience with a probationary period. Class A CDL Required. Clean MVR and must pass Pre-Employment Drug Screening and FMCSA random drug screenings. Other endorsements are a plus but not limited to or required for employment. Newer equipment, home every night unless hauling out of state. Flamingo Trucking INC has 37 years in the transportation industry and is a family run organization and we take pride in treating our employees like family. FTI is primarily a raw produce hauling company specializing in Potato and Onion transport. We also haul reefers, flatbed, tankers, doubles and lowboy Heavy Haul. We are looking for professional drivers who take pride in their craft to grow with our company as we expand into the future. DM us today for more info FULL-TIME · $20 - $26 / HOUR · OTHELLO, WASHINGTON CDL Truck Driver Apply now", "grouping_count": 0}, {"id": 914298779931337, "advertiser_name": "Flamingo Trucking Inc.", "status": "Active", "date": "01/10/2023", "ad_url": [], "image_save_path": ["914298779931337_00.jpg"], "ad_text": "Flamingo Trucking Inc. Sponsored ¡Conductores profesionales! ¡Únase al equipo de Flamingo Trucking INC. hoy! Actualmente estamos buscando contratar conductores de 5 turnos de día y 5 de noche. $ 20.00-26.00 por hora rango de pago experiencia / turno y basado en la seguridad. Se revisarán los salarios de $ 20.00 por hora inicial, después del período de prueba de 60 días . El paquete de beneficios completo después de 60 días incluye plan de salud o HSA, dental, visión, plan 401k (todos los empleados inscritos automáticamente pueden optar por no participar si lo desean), seguro de accidentes (pagado por el empleado) la compañía paga el 75% de los beneficios de los empleados, el empleado paga todos los beneficios del cónyuge y los hijos. Programa de incentivos mensuales basado en la seguridad. Las horas extras después de 48 horas (regulaciones agrícolas) garantizan 50 horas por semana a menos que la planta haya programado el cierre del mantenimiento. Una vez que tengamos todo el personal, planeamos ejecutar turnos de 10 horas días y noches con fines de semana libres programados. Calificaciones: 2 años de experiencia en CDL de clase A o dos años de experiencia exenta de granja con un período de prueba. Se requiere CDL de clase A. Limpie MVR y debe pasar la detección de drogas previa al empleo y las pruebas aleatorias de drogas de la FMCSA. Otros endosos son una ventaja, pero no limitados o requeridos para el empleo. Equipo más nuevo, a casa todas las noches a menos que se transporte fuera del estado. Flamingo Trucking INC tiene 37 años en la industria del transporte y es una organización familiar y nos enorgullecemos de tratar a nuestros empleados como familia. FTI es principalmente una empresa de transporte de productos crudos especializada en el transporte de patatas y cebollas. También transportamos reefers, flatbed, tankers, doubles y lowboy Heavy Haul. Estamos buscando conductores profesionales que se enorgullezcan de su oficio para crecer con nuestra empresa a medida que nos expandimos hacia el futuro. FULL-TIME · $20 - $26 / HOUR · OTHELLO, WASHINGTON Class A CDL Truck Driver Apply now", "grouping_count": 0}]