[{"id": 840010164097554, "advertiser_name": "Phoenix Transportation Services, LLC.", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fl%2Faszh5%3Fls%3D90302&h=AT1ozvifaxjUkV2gBaGSsxbKtxCtEurAN182fX_MieRSXViNmbgIv6L4s5nNufqCEeJD20IyeY9X1QjAe6fwdReXWNIBRg-wJ6-w64ElN26uECM01uZbuSI1pMLQB-E8-s1SAVI6b6JgjSQ8wnpVNV4t5eUt34uDm5o4VEaWRZU", "https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fl%2Faszh5%3Fls%3D90302&h=AT2NLo_zMnfmRDtLiN-lDBDsFC_zQTUJKf3O6jM7NlkRnvPsyRrbhciEvf9FZBAmn2YuCJb_eRQmu8gJSBHyt37hR9omq1GVCX25T1gQ4iue5a4358nQCfTK0kWyncY9li0tyLe9Ncw3TOrDAmT-rBBTyrYP0qVYsqypkfKWQB8"], "image_save_path": ["840010164097554_00.jpg"], "ad_text": "Phoenix Transportation Services, LLC. Sponsored Phoenix Transportation out of Georgetown, is hiring regional drivers to haul customer freight out of Central KY. At Phoenix you are treated with the utmost respect and considered part of our family. Check out the bullet points below for more details! Application - http://www.driver-reach.com/l/aszh5?ls=90302 - Great pay - You're in control of your earnings - We have the freight - Home on weekends - Out longer by your choice - Benefits after 30 days - Health, vision, dental, life, ambulance, etc. - Sign on bonus - $2500 paid out incrementally for new drivers - Safety bonus - Up to $2400 per year - More for clean inspections - Referral bonus - $500 for each driver you refer to us - Dry van or Flatbed - Your choice - Dry van is no touch - Some drop and hook available. Mostly live load/unload - Accumulating vacation - 2 weeks per year. More for tenure. Cash it in! - Free rider program - Pets available with a deposit - Weekly direct deposit or paper check - Student training program If you would like to call yourself a driver for Phoenix Transportation, please copy and paste the link directly below to apply. http://www.driver-reach.com/l/aszh5?ls=90302 FULL-TIME · $1,100 - $1,800 / WEEK · GEORGETOWN, KENTUCKY Regional Truck Driver - Home on Weekends Apply now", "grouping_count": 0}]