[{"id": 885151912606267, "advertiser_name": "MNTowing.com  &  SellAJunker.com", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fsellajunker.com%2Findex.php%2Femployment%2Flight-duty-driver-buyer&h=AT0fCHBDyd1z7xPk7Z8iWR9Lj3ones5jA1BffpvEY7eIAFQD8dyUcaNDlEXsCFIetsFycOSd0bqtWCMdNE0zXbMRis-foeFmsTmgp7m4opUPjEXAt5EelvLHJSeV-AEJa2J_eSpAKXBL4PHDAQ3O82E7k2Ccur_wvESEHxAxq2g", "https://l.facebook.com/l.php?u=https%3A%2F%2Fsellajunker.com%2Findex.php%2Femployment%2Flight-duty-driver-buyer&h=AT28yt-2LrlgvGh7SgXw2y-8_CnFdtdEP0BmwGMZWlbKuUgtNtsXW41qFpZfVzAm68neT-BXAqmRGKZBdM7RgeffeOl0Gt_RB06HmEQQxOT7D4Go72hU-7NrWw6M0-xfpalmjtYrYN2c9-7BeL6VSRuTXDWCUS8O_opBFBwlNQw"], "image_save_path": ["885151912606267_00.jpg"], "ad_text": "MNTowing.com & SellAJunker.com Sponsored MN Towing and Sell A Junker is Hiring for Driver/Buyers! W2, Health, Dental, Vacation, PTO, 401k, Your own truck, $1,400 to $1,600 a week is not uncommon $1250+ is average weekly gross. We have drivers in this position making over 75k! All of our drivers make at least the low 60K's. Best bonuses and promotions in the business! You deserve to have your own truck with your own tools and get paid from the time you walk out your front door! You deserve to be part of a family! MN Towing - Sell a Junker needs you. We have considerably less roadside exposure then most towing companies. We have a very fun atmosphere with lots of promotions and additional benefits. We pay weekly, w2, direct deposit. Our work is steady year around. Our driver shifts are on a 4-week rotation 4/4/5/5. You will be required to work every other weekend and you will have the opposing weekend off as a three-day weekend. Shifts start late morning to early afternoon and typically run 11 to 12 hours. Our light duty tow driver/car buyers are the most important component in our business and we treat them accordingly. We are looking for employees to grow with our organization. We **guarantee** more pay than our competition and if you are go getter, you will make much much more. Health, Dental, 401k, large Christmas bonuses. MN Towing is the place to be! TO APPLY... Visit our website and fill out the application https://sellajunker.com/index.php/employment/light-duty-driver-buyer OR Text JOB to 763-358-2087 SELLAJUNKER.COM Sell a Junker | Sell your car fast! Selling your car is fast and easy. Schedule a pickup today! (612) 326-6687 Sign up", "grouping_count": 0}]