[{"id": 469603742026579, "advertiser_name": "Maine Landcrafters", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["469603742026579_00.jpg"], "ad_text": "Maine Landcrafters Sponsored Join Landcrafters in thinking of Spring and help build our 2023 Mow Crew today as an Entry-Level or Experienced Laborer! Who we are looking for in this role: -Enthusiastic about lawn care -Takes pride in maintaining a high quality of work -Perform routine maintenance of equipment -Experience with zero-turns, push mowers, weed whackers, etc. -Has a clean, valid drivers license -Punctual and reliable Our ideal candidate would have experience with trailers and mowing equipment, be motivated to provide the highest level of lawn care, and have a desire to grow with Landcrafters mowing operations. Landcrafters offers: -Monday through Friday work schedule -Full-time, year-round work (Snow Removal in Winter) -Paid travel in company trucks -401K with 3% match -Health Insurance -Paid Time Off -Holidays Job Type: Full-time Salary: $16.00 - $20.00 per hour Benefits: 401(k) 401(k) matching Health insurance Paid time off Schedule: 8 hour shift Monday to Friday Overtime Mow Crew Landscaping Send message", "grouping_count": 0}, {"id": 1596016497540524, "advertiser_name": "Maine Landcrafters", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["1596016497540524_00.jpg"], "ad_text": "Maine Landcrafters Sponsored While the weather outside is frightful, Landcrafters is thinking Spring! We are looking to build our 2023 Mow Crew with a Working Supervisor. Who we are looking for in this role: -Motivated team leader -Driven to learn and grow -Enthusiastic about lawn care -Takes pride in maintaining a high quality of work -Maintain a regular, efficient mowing schedule -Oversee routine maintenance of equipment -Maintain Landcrafters safety culture -Has a clean, valid drivers license -Punctual and reliable Our ideal candidate would have experience with trailers and mowing equipment, be motivated to provide the highest level of lawn care, and have a desire to grow with Landcrafters mowing operations. Landcrafters offers: -Monday through Friday work schedule -Full-time, year-round work (Snow Removal in Winter) -Paid travel in company trucks -401K with 3% match -Health Insurance -Paid Time Off -Holidays Mow Crew Supervisor Landscaping Send message", "grouping_count": 0}, {"id": 477268524375231, "advertiser_name": "Maine Landcrafters", "status": "Active", "date": "01/13/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.landcraftersofmaine.com%2Fcareers&h=AT3s9nxmdsxJu79cmNKx_rnH_Kd_0Oz40XfSqzVk2m9_kzVfFdcCmOMADnOR-86N5SFWF4QZ2gguFtgz6DrTKfT7kRLvPfZ6b5o0Q0TVinZSs-HysD3cwRe7Er6Zh6ClJ9xrQeGH9B4JRkWPQatl5NGd5wCqy6WXQvcKnxaKoT8"], "image_save_path": ["477268524375231_00.jpg"], "ad_text": "Maine Landcrafters Sponsored Seeking experienced, professional, efficient, safe and mechanically inclined CDL Driver. We are looking for either a Part-Time or Full-Time driver. Work week is Monday-Friday! Applicants must have a Class A CDL, clean driving record, professional references, and at least 3 years of experience driving a dual or triaxle dump truck. While this is primarily a driving role, ideal candidate will be open to helping with tasks around the shop as needed. Ability to perform routine maintenance, diagnostics and repairs is a HUGE PLUS, but not a requirement. Landcrafters offers Health Insurance, Earned Time Off, and 401K! https://www.landcraftersofmaine.com/careers CDL-A Driver Wanted Landscaping Send message", "grouping_count": 0}, {"id": 483353317219248, "advertiser_name": "Maine Landcrafters", "status": "Active", "date": "12/14/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.landcraftersofmaine.com%2Fcareers&h=AT1-9oJuc9JzG7qjp54l3NFJtWpgfm_ZWNQhGnv6K6nPqcinY7HwqHOUh5vB80wUWHWAhug0q86kVeaOVydUGSmGool76_-IRz57HIjMM2iVRDbcB7t_C-jyexPn3drveFE_7Lnw9RCs_4FULuNm6sHztcyUnPNIZFuiXgaG27I"], "image_save_path": ["483353317219248_00.jpg"], "ad_text": "Maine Landcrafters Sponsored Landcrafters, LLC is a full scale landscaping company serving Maine with the highest quality planting, estate maintenance and landscape construction in the area. We are seeking a Site Foreman/Equipment Operator to help us keep up with incoming projects and company growth. Qualified candidates will have a minimum of 5 years of experience in landscape construction and/or sitework excavation/construction, and a minimum of 2 consecutive years at a supervisor's capacity in the industry. Ability to read plans, set grades, prioritize site management, delegate, run equipment, give hands on training and maintain a positive/professional demeanor are paramount. The right candidate will not only be able to manage their site and keep things moving safely and efficiently, but they will be physically and mentally able to pick up a shovel when the need arises. This position is full-time year round with benefits after a probationary period. We are growing and have been doing business in the area for over 40 years, Please check out our website and feel free to contact us with any questions. https://www.landcraftersofmaine.com/careers Job Type: Full-time, year-round Benefits: 401(k) 401(k) matching Health insurance Paid time off Schedule: Monday to Friday Maine Landcrafters Landscaping Send message", "grouping_count": 0}]