[{"id": 495009136130500, "advertiser_name": "Jobs Long Beach", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT3oRJ7CmNKIFuxCM338s8b2LJ9UvWfoDhgQwJBryw5vGv5AQfZnMfEubcgJjqVj92t5phjANPyBNGzn7lXMIbX0FEKlYPvCwz2YY_KJUGbD3dXv9K68H2fV5RR_Mqn-oMPVmkswa_OOzcxLqfrZQv4PnCX_8rpfk4OYd6ulEVk"], "image_save_path": ["495009136130500_00.jpg"], "ad_text": "Jobs Long Beach Sponsored CNC Glass Machine Operator Wanted We are looking for a skilled CNC Glass Machine Operator to join our team at our Long Beach location. The main task will be to cut and polish glass shower doors on our CNC Denver machine. Experience with this specific machine is preferred. The job offers a competitive starting rate of $20-22/hour and great benefits including -Health care, -Sick pay -Vacation pay. Night Shift 5pm-5am This position is Monday to Friday, If you are passionate about working with glass and have experience operating CNC machines, we want to hear from you. Apply today to become a part of our team. Now Hiring CNC Glass Operator $20-22/h Apply Now", "grouping_count": 0}, {"id": 584237199770975, "advertiser_name": "Jobs Long Beach", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT3oRJ7CmNKIFuxCM338s8b2LJ9UvWfoDhgQwJBryw5vGv5AQfZnMfEubcgJjqVj92t5phjANPyBNGzn7lXMIbX0FEKlYPvCwz2YY_KJUGbD3dXv9K68H2fV5RR_Mqn-oMPVmkswa_OOzcxLqfrZQv4PnCX_8rpfk4OYd6ulEVk"], "image_save_path": ["584237199770975_00.jpg"], "ad_text": "Jobs Long Beach Sponsored Reliable Glass Company in Long Beach is now hiring Truck Drivers – No CDL required The driver will be local and deliver to 10-15 different stops. Shifts Mon-Fri 6 AM-4 PM This is a long-term opportunity with a lot of room to grow! So please serious inquires Only! Requirements · Motivated to work and good attitude. · Clean Motor Vehicle Record · Must be able to lift 80-100lb · Applicants must be 21 years of age or older · Must be able to pass a Drug Test and DOT Medical / Physical Exam (Employer reimbursement provided) · Weekly Paycheck - Direct Deposits on Fridays · $800- $1000 Gross per week with opportunity for performance-based bonuses. (this may or may not include overtime.) Experience: · No experience is required but drivers with experience will be considered first. · Regular Class C Driver License To Get Started. Click Apply Now & Fill up Short Form FB.ME !! NOW HIRING Class C Driver Local $800-$1000 Gross weekly Apply now", "grouping_count": 0}]