[{"id": 554772046588501, "advertiser_name": "Blaine Brothers", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fblainebrothers.com%2Fcareer-openings%2F&h=AT1kOvxGhmaFRUZzTJc3FfjX5lTuVyoZ1te91eRaQsvT6p08JRvAWbpq0MpgVHQlvjygMHXKqfcXWLek73ffSz-qMNgFp1_H-Eqbqy4ckuaSZzjDss7Y-DRxN8Iewh_7RN8ugwkCAwY_jTxeZ-MgtfmCm4HpdRxUfdUla6eQzdw"], "image_save_path": ["554772046588501_00.jpg"], "ad_text": "Blaine Brothers Sponsored Now Hiring! Our Blaine Brothers Baldwin location is hiring a 2nd shift experienced technician for our Truck-Trailer Shop and we want you to join us. This position is looking for someone detail-oriented, has a strong mechanical aptitude, job handles the complete repair and maintenance of semi-trailers or heavy-duty trucks (experience as a mechanic is a plus! We are willing to train) and has a strong work ethic. Learn how you can advance within the company and start planning for your future with us. Apply here or click the link below to add your resume and read more detail about this position on our website! But most importantly, we are looking for someone who fits with our company values: • Values people • Gives people with strengths the opportunity to exercise them • Doesn't treat lack of success as failure • Is very affirming and brings out the best in others • Values and gives high quality • Works hard • Sees opportunities and integrates with existing business • Is a good communicator • Is humble • Assumes responsibility for actions and commitments • Attends to details • Attends to operations • Is competitive For a full list of job openings visit https://blainebrothers.com/career-openings/ Blaine Brothers, Inc. is an EEO/AA/Minorities/Women/Vet/Disability Employer. FULL-TIME · BLAINE, MINNESOTA 2nd Shift Diesel Truck Technician Apply now", "grouping_count": 0}, {"id": 1362605114482894, "advertiser_name": "Blaine Brothers", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fblainebrothers.com%2Fcareer-openings%2F&h=AT1K9M18bfy3RF7GwN3js0KMa-XvWNjWe3BCxFk8fDT8X_PkelcDatR1WqyZnqbKjD-71jQ2S--jsf9hxBOQzayiqEW2oASx1NjjIGd9PZBWNGzDOPphZlEJEHBXqPNllRkCbYDan4kQxXfh_x446u0WY-ovFPL2y2x3AuVp5zU"], "image_save_path": ["1362605114482894_00.jpg"], "ad_text": "Blaine Brothers Sponsored If you are looking for a great place to have a career with TOP PAY$$$, let's talk!! We are a Minnesota based family-owned business with our main location in Blaine and an opening for a Tow Truck Driver in our Truck Shop. This position handles heavy duty towing, general knowledge/maintenance on heavy duty diesel preferred. We are looking for someone with mechanical aptitude, detail oriented, willing to jump in and help out where needed, a Class B or Class A CDL license and a strong work ethic. Top PAY$$$, Paid weekly, overtime, room for growth, life insurance policy gifted to all full-time employees, 401k with a company match to help build for your retirement, room for growth and advancements as we are huge on promoting within/internally. Come work with a fun team at Blaine Brothers & our Family of Companies. Willing to train and develop a motivated candidate with the willingness to learn and gain knowledge! Willing to assist with receiving additional endorsements. If you’re looking for a great place to work, APPLY. Schedule is 3rd shift Sunday-Thursday 9pm-7am. We like to work hard, play hard and take pride in everything we do! Apply here or click the link below to add your resume and read more detail about this position on our website! But most importantly, we are looking for someone who fits with our company values: • Values people • Gives people with strengths the opportunity to exercise them • Doesn't treat lack of success as failure • Is very affirming and brings out the best in others • Values and gives high quality • Works hard • Sees opportunities and integrates with existing business • Is a good communicator • Is humble • Assumes responsibility for actions and commitments • Attends to details • Attends to operations • Is competitive For a full list of job openings visit https://blainebrothers.com/career-openings/ Blaine Brothers, Inc. is an EEO/AA/Minorities/Women/Vet/Disability Employer. FULL-TIME · BLAINE, MINNESOTA 3rd Shift Tow Truck Driver with $5000 SIGN ON BONUS Apply now", "grouping_count": 0}, {"id": 682063163654402, "advertiser_name": "Blaine Brothers", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fblainebrothers.com%2Fcareer-openings%2F&h=AT34x0B-O1XNB6H3-WShv_MHfGfRDq1LvyxI7xT4ODpBKat-IaWq0BAWcUHQaBb37TFTHrBGIXCa5senWXsIgR6pv-5XN5YTteylA-ptt81E9G5E3bwESp_MkqPghYij6PdX5KJ_ZkySVjqwrkHfNMmbnUbU7blm6UJBLpBOSaU"], "image_save_path": ["682063163654402_00.jpg"], "ad_text": "Blaine Brothers Sponsored We're Hiring! Blaine Brothers is looking for an Inside Sales Specialist for the Parts Department at the Scanlon location. This position includes supporting our marketplace customers and providing support to our shops. This position is 1st shift Monday through Friday. $2,500 Sign on BONUS, great benefits, vacation rollover package, paid weekly, overtime, room for growth, $10,000 life insurance policy gifted to all full-time employees, 401k with a company match to help build for your retirement. Come work with a fun team at Blaine Brothers & our Family of Companies. We like to work hard, play hard, and take pride in everything we do!! Apply here or click the link below to add your resume and read more details about this position on our website! The essential duties include: Greets walk-in and phone customers in a friendly professional manner providing customer service. Answers customer questions and make suggestions regarding additional or alternative products. Performs duties required to complete orders. Keeps timely and accurate records of product movement and status of customer orders. Plays an active role in inventory management. Maintains inventory and customer display area. Provides assistance to Outside Sales, as needed. Performs other duties as assigned. But most importantly, we are looking for someone who fits with our company values: 1. Values people 2. Gives people with strengths the opportunity to exercise them 3. Doesn't treat lack of success as failure 4. Is very affirming and brings out the best in others 5. Values and gives high quality 6. Works hard 7. Sees opportunities and integrates with existing business 8. Is a good communicator 9. Is humble 10. Assumes responsibility for actions and commitments 11. Attends to details 12. Attends to operations 13. Is competitive For a full list of job openings visit https://blainebrothers.com/career-openings/ Blaine Brothers, Inc. is an EEO/AA/Minorities/Women/Vet/Disability Employer. FULL-TIME · BLAINE, MINNESOTA INSIDE PARTS SPECIALIST $2500 Sign on Bonus Apply now", "grouping_count": 0}]