[{"id": 608174017364852, "advertiser_name": "MGL", "status": "Active", "date": "08/31/2022", "ad_url": [], "image_save_path": [], "ad_text": "MGL Sponsored Become an MGL company driver and make up to $3000+ weekly! Don't miss your chance to get a brand new 2022 Volvo or Freightliner + Brand New Dry Van or Reefer Trailer. MG Logistics (MGL) is a Chicago-based trucking company with more than 400 trucks and 15 years of experience. We are looking for talented CDL A dry van and reefer drivers to run OTR routes and are hiring nationwide. Drivers love working for MGL because we: - Provide competitive pay & consistent miles - Let you choose how to get paid - Run late-model tractors - Have 24/7 dispatch & road support - We treat drivers with respect Compensation: - $2,800 average weekly pay (60% of our company drivers make $3000+ weekly) - Paid weekly direct deposit - Bonuses quarterly safety, breakdown, detention & layover pay Benefits & Perks: - Paid travel expenses - Fast & easy orientation process - 24/7 road support - Rider programs for passengers and pets - Fuel card provided - Cash advance - Take Truck Home or flight home will be covered Join MGL - get the pay and respect that you deserve! MG Logistics (MGL) is a Chicago-based trucking company with more than 400 trucks and 15 years of experience. We are looking for talented CDL A dry van and reefer drivers to run OTR routes and are hiring nationwide. We just received 20 brand new trucks, so don't miss your chance to get a brand new 2022 Volvo or Freightliner + brand new Dry Van or Reefer trailer. Drivers love working for MGL because we: - Provide competitive pay & consistent miles - Let you choose how to get paid (W2 or 1099) - Run late-model tractors - Have 24/7 dispatch & road support - We treat drivers with respect Compensation: - $2,800 average weekly pay (60% of our company drivers make $3000+ weekly) - Unlimited miles - Paid weekly - Bonuses quarterly safety, breakdown, detention & layover pay Benefits & Perks: - Paid travel expenses - Fast & easy orientation process - Consistent miles - 24/7 road support - Financing and lease-to-own program with the low down-payment - Rider programs for passengers and pets - Fuel card provided - Cash advance - Take Truck Home or flights home and back will be covered Home Time, Route, & Schedule - Running all 48 states - Drivers accrue 1.5 home days per week on-road (home every 3 weeks for 3-5 days) - No-touch freight and/or drop and hook Equipment - Late-model Volvo and Freightliner trucks - Trucks include: inverter, refrigerator, and navigation - Automatic transmission - Governed speed: 68 mph Qualifications - Must be at least 24 years of age - Must have CDL A license - Must have a minimum of 1-year verifiable tractor-trailer driving experience with a clean driving record (no more than 3 moving violations in the past 3 years) Hiring Nationwide, excluding California Apply now", "grouping_count": 0}]