[{"id": 742242087529327, "advertiser_name": "Social Media Job Connection", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT2RPcy3Ef555bDy2VEswXxP2LdDmr8RhrLR1S0mf7uHBkS0fC5aOgtmE1EXAB8nAxQrbHDejRfyhUKsZM3bgM6lefKmnBUqwfrvuqVm0QZ1FSQ-Ktq1n6BwOaj-JQkDFfkVhyiqqJmw4dtivvOc-COu6XDWo5pB7hC9rAyGaUs"], "image_save_path": ["742242087529327_00.jpg"], "ad_text": "Social Media Job Connection Sponsored Hiring Delivery Drivers / Appliance Installers in New Haven, IN! $45-$70K/Year. No Special License Required - Apply Now! At Temco Logistics, we are THE fastest-growing appliance delivery and installation company in the country. HIRING ON THE SPOT! Right now, we are seeking motivated individuals to expand our team of Delivery Drivers/Installers in New Haven, IN! Delivery Drivers / Installers with Temco load, deliver, and install appliances such as washers, dryers, dishwashers, refrigerators, ranges, cooktops, and hoods, all while providing great customer service and maintaining an accident-free workplace! We offer our team members a full range of flexible benefits including: • Best in class pay with dense routes - DRIVE LESS, INSTALL MORE! • Company provided Uniforms, Shoes, and PPE • Paid Training – including for apprentices with no industry experience • Opportunities to progress into management positions • 401k program with company match • Health, Dental, Vision and AD&D Insurance • Paid Time Off – Vacation, Sick and Holidays Driver / Master Installation Technician • $55,000.00 - $70,000.00 per year • Valid driver’s license and clean driving record • 2+ years’ experience delivering and/or installing household appliances such as washers, dryers, dishwashers, refrigerators, ranges, cooktops, and hoods. Apprentice Technician • $45,000-$55,000 per year • No experience required – full training provided • Must be able to handle physical workloads, work well in teams, and pass pre-employment screenings • Excellent customer service skills • Familiarity with installation tools and equipment for a variety of household appliances a plus Ready to become part of a dynamic and fast-growing team? Click Apply Now! FB.ME Now Hiring Delivery Drivers / Installers - Apply Now --> Apply now", "grouping_count": 0}, {"id": 3582319775422672, "advertiser_name": "Social Media Job Connection", "status": "Active", "date": "01/09/2023", "ad_url": [], "image_save_path": ["3582319775422672_00.jpg"], "ad_text": "Social Media Job Connection Sponsored Now Hiring Truck Drivers – CDL Class A & B – Hampstead, MD. Newly Licensed Drivers Welcome! Apply Now! With over 45 years in business, L.S. Lee, Inc. is a fourth-generation family-owned contractor specializing in highway guardrail installation and maintenance. We are currently seeking Truck Drivers to join our growing team based out of Hampstead, MD. Truck Drivers are part of our guardrail crews, responsible for the proper loading/unloading of trucks and safe operation of company vehicles. Truck Drivers also assist with guardrail installation labor when not driving. Qualified candidates must be able and willing to travel and stay out of town during the work week (typically Monday to Friday) as required. Company provided lodging and meal stipend is provided for out-of-town work. In return, we offer an attractive total compensation package including excellent health and retirement benefits, paid holidays, and vacation. The nature of the work is on the side of the road, under traffic. We are extremely dedicated to employee safety and provide all required PPE as well as extensive training. Requirements: • Commercial Driver's License - Class A or B • Newly licensed drivers welcome! • High School Diploma or General Education Degree (GED) • Must be able to lift and/or move up to 100 pounds • Must be willing and able to travel L.S. Lee is an Equal Opportunity Employer Interested? Click Apply Now! Hiring Drivers - CDL A & B - New Drivers Welcome! Apply now", "grouping_count": 0}]