[{"id": 442566937991389, "advertiser_name": "Bruns Building and Development", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["442566937991389_00.jpg"], "ad_text": "Bruns Building and Development Sponsored #BuildYourFuture at Bruns Building & Development. We are currently hiring a Mechanic to join our team in St. Henry, Ohio. Please share with someone that might be interested and qualified. Our Mechanic position is for 1st shift, full time, Monday to Friday. About the position: Due to a recent retirement, we are seeking a Mechanic to join our St. Henry team. Responsibilities will include the maintenance and repair of mechanical, electrical, and diesel systems on a variety of fleet vehicles and equipment. Hydraulic knowledge is a plus. Work will be done on work trucks, trailers, gas / diesel heavy equipment (e.g. skid loaders, mini excavators, etc.), forklifts, cranes and other construction equipment. Duties and expectations will be based on the ideal associate's skills and experience. This is a great opportunity for professional and financial advancement! Shop management opportunities available for the right person. Preferred Skills: • Ability to perform tool, truck, trailer, and equipment maintenance • Diagnose and repair truck, trailer and equipment malfunctions • Identify and determine parts required for repair • Teardown, inspect and assemble equipment • Ability to troubleshoot engines • Competence with hand tools associated with the craft • Physically able to lift and carry up to 100 pounds • Self-motivated with high level of integrity • Good communication skills Experience/Requirements: • Diesel mechanic experience is ideal • High school diploma / GED • Valid driver's license • CDL-A is a great benefit but not required Why BBD: Bruns Building & Development, which is a part of Bruns Construction Enterprises, Inc., takes pride in our core values and culture within the company. Faith & Family are at the top of the list. Followed by Integrity & Honesty, Ownership, Works Smart, and Enjoyable. We look for strong associates that relate to these values we believe in as we continue to grow. This company is an Associate Owned Company (ESOP) which is the difference between a job versus an opportunity. BBD Benefits: • ESOP Company (Employee Stock Ownership Plan) • Great wages • Medical Insurance • Paid Vacation and Holidays • 401K • Ability to advance at a growing company For more information send us a message or contact Nick Koesters at (419)305-8212 or email at nkoesters@bruns1951.com EOE and Drug Free Workplace", "grouping_count": 0}]