[{"id": 702869018178575, "advertiser_name": "Albany Med Careers", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Falbanymedcareers.com%2Fadministrative-support-and-daycare-hiring-event%2F&h=AT2_EPiiC48NUHJeE6ShH-FPkPM0AbOgXACWT-pmW0_WQLoNVmzKr0QaYKToUrDSoTL-zcMKPN1qoqs_Zt-a1eVj_rgM3PAl1oVkkAfnjUmx1D1QRZC-D2IzrPq-LnKWvPR9wz-nLwVixWj7hvJbMGmPP5tK6LlkmJQBKazWUmk"], "image_save_path": ["702869018178575_00.jpg"], "ad_text": "Albany Med Careers Sponsored New year, new career! Albany Medical Center is hosting an Administrative Support and Daycare hiring event on Thursday, February 9th from 8 am to 4 pm. Featuring onsite interviews with our hiring managers and on-the-spot offer possibilities! Giveaways and refreshments will be available to all candidates who attend. We are seeking quality candidates for our Clinical Documentation Improvement, Daycare, Health Information Management, Hospital/Physician Billing, Patient Access, and Patient Engagement Center departments. We offer great benefits, competitive salaries, and the opportunity to work with a team of incredibly talented professionals. Jump start your career with Albany Medical Center where we are here with you for everything! ALBANYMEDCAREERS.COM Administrative Support and Daycare Hiring Event Join our team today! Apply Now", "grouping_count": 0}, {"id": 595962155700752, "advertiser_name": "Albany Med Careers", "status": "Active", "date": "01/18/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Falbanymedcareers.com%2Fphysicians-group-outpatient-clinics-hiring-event-2%2F&h=AT2_EPiiC48NUHJeE6ShH-FPkPM0AbOgXACWT-pmW0_WQLoNVmzKr0QaYKToUrDSoTL-zcMKPN1qoqs_Zt-a1eVj_rgM3PAl1oVkkAfnjUmx1D1QRZC-D2IzrPq-LnKWvPR9wz-nLwVixWj7hvJbMGmPP5tK6LlkmJQBKazWUmk"], "image_save_path": ["595962155700752_00.jpg"], "ad_text": "Albany Med Careers Sponsored NOW HIRING! Our Physicians Group Outpatient Clinics are having an in-person Hiring Event on Thursday, February 2nd between 9am-2pm. We are hiring Administrative/Clerical positions, RNs, LPNs, Medical Assistants, Diagnostic Medical Sonographers and Radiologic Techs throughout the Capital Region! Take advantage of our competitive rates and new LPN career ladder! Jump start your career with Albany Med and join our team of outstanding professionals today! ALBANYMEDCAREERS.COM Outpatient Clinic Opportunities Join us for In-Person Interviews! Apply now", "grouping_count": 0}]