[{"id": 496609139281599, "advertiser_name": "Telegraph Herald", "status": "Active", "date": "01/13/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.paycomonline.net%2Fv4%2Fats%2Fweb.php%2Fjobs%2FViewJobDetails%3Fjob%3D78856%26clientkey%3D41E82EC60AAD792EC7018E3AB22DE8D2&h=AT0WvKCCpJiZN7JEe7RZ6Psm0CCVJ8xeX44JXm8Ne8DtrWo_m3SF_24FJpttkC6M9KsikWyYYuZiZ5mcn2lutL5O3xALyMmqBpe3BpdlJQYUdC86l1G6TpNa8gyOgo0cuCiP7nUZA-a-ADAC-La-aXKOajY"], "image_save_path": ["496609139281599_00.jpg"], "ad_text": "Telegraph Herald Sponsored Attention night owls! Due to a promotion, your local news source, the employee-owned Telegraph Herald, has a third-shift opening for an Assistant Distribution Center Manager. This is a hands-on opportunity for an individual looking for a leadership position with growth potential. The Assistant Distribution Center Manager’s main responsibilities are to: •assist the Distribution Center Manager to manage bundle haulers and motor route contracts, organize the flow of the loading dock, and manage truck manifests; •load/unload and organize newspaper publications and inserts; •ensure ongoing communication occurs with distribution and advertising departments; •deliver “down” motor routes when needed. If you are self-driven, dependable and seeking a position with long-term growth potential, this may be just the fit for you! This is a full-time position. Hours are 10:00 pm to approximately 6:00 am, five days per week. Basic requirements are good communication skills, possession of a valid driver’s license and good driving record, the ability to lift 25-50 lbs., a willingness to be flexible for unplanned events, and availability to work on some weekends and holidays. We offer a competitive wage and benefit package. PAYCOMONLINE.NET Asst. Manager Needed! Supervisory Responsibilities: * People: None other than self. * Data: All reports relating to motor route, trucking manifests,... Apply now", "grouping_count": 0}]