[{"id": 481211107547517, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/27/2023", "ad_url": [], "image_save_path": ["481211107547517_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored PT Nursing Supervisor Stockbridge, GA • Join our mission to redefine how families care for their loved ones by providing quality, personalized care at home • Visit with patients for initial assessments & follow-ups • Interact with caregivers & clients • Monitor & update the patient's care plan • Supervise & direct care personnel concerning the patient's care plan • Coordinate inter-agency services to develop a patient's care plan • Keep state records updated & secured • Address all correspondence promptly • Investigate & resolve any complaints concerning staff or the services received • Resolve issues between clients and caregivers in a timely & professional manner • Navigate the behaviors of patients who are cognitively declining • Show concern for the elderly in our community by providing respectful, attentive care Feature Healthcare is hiring a part-time RN (Registered Nurse) as the Nursing Supervisor to help with in-person visits to clients and oversee their care by keeping everyone, from nursing staff to family members, informed on their care. Our vision is to be the highest quality employer & provider of care throughout the Southeast. Our values include taking personal ownership, changing lives, challenging traditions, and upholding our principles. Our Ideal Nursing Supervisor: • Experience: Must be an RN (Registered Nurse). Experience with senior citizens is preferred. Leadership experience is a plus. • Certifications: Must have a current RN license issued by the State of Georgia. • Computer Skills: Basic knowledge of a MAC computer. Ability to navigate G-Suite: Google Sheets, Docs, Google Drive, etc. • Excellent Communication & Interpersonal Skills: Ability to build solid relationships and support the nursing staff while communicating with the family & keeping accurate records. • Compassionate & Empathetic: A heart for older patients & what they're experiencing as they age; possess a high level of sensitivity in navigating family dynamics. • Adaptable: Comfortable with last-minute changes to the schedule; ability to prioritize & problem-solve issues that pop up. • Self-Starter: Able to accomplish tasks without much supervision. What we offer our Nursing Supervisor: • $30-$34 per hour, DOE • Fixed Schedule: 3 days/week, up to 25 hours • Mileage reimbursement • Company laptop To Apply If you are an RN passionate about serving Seniors and have experience in a leadership role, please submit your resume for our Nursing Supervisor position via this job ad. FULL-TIME · $30 - $34 / HOUR · STOCKBRIDGE, GEORGIA PT Nursing Supervisor Apply now", "grouping_count": 0}, {"id": 657744736106005, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/27/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fagricultural-business-development-supervisor%2FDF.63A%3Fcoref%3D1.1.u74_B0D%261674839718808&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["657744736106005_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Westfield Egg Farm is a 4th generation family-owned business that partners with around 50 family farms by sourcing, processing, and distributing wholesome organic & free-range eggs to the market. We are looking for a full-time Agricultural Business Development Supervisor to be the face of our company by networking, projecting our egg harvest, overseeing our flocks, maintaining direct contact with the producers, and keeping all the paperwork in regulation order. COMEET.COM Job opportunity: Agricultural Business Development Supervisor at Team Builder Recruiting Agricultural Business Development Supervisor New Holland, PAStep into a valued role as the company representative to our valued egg farmers &amp; ultimate overseer of our poultry farmsSupervise the integration of new producers into our partnership programWork with producers to optimize production an...", "grouping_count": 0}, {"id": 855004329126199, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fhr-generalist%2F8F.63B%3Fcoref%3D1.1.u74_B0D%261674766407248&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["855004329126199_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Westfield Egg Farm is a 4th generation family-owned business that partners with family farms by sourcing, processing, and distributing wholesome organic & free-range eggs to the market. We are committed to upholding our core values of excellence, integrity, family, stewardship, & eternal perspective in the course of doing business. We are looking for a full-time HR Generalist to help our team grow personally and professionally. COMEET.COM Job opportunity: HR Generalist at Team Builder Recruiting HR GeneralistNew Holland, PAServe our team by coordinating human resources activitiesPerform such tasks as coordinating employee reviews, meeting safety and compliance expectations, employee training, administering benefits, and overseeing the payroll processOversee the recruitment, interview, and o...", "grouping_count": 0}, {"id": 682910820234425, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fvimeo.com%2F548521485&h=AT3OInkSk8cx8oOvnO0X1zhIt70f_32rQwtcyzJKO7RtiPcjhlZZmSyLTIjAxP4P7A4SREgKZcfaLIDFQ_Nah0OAxbTxlezLguanEA8_OtkjjZWiuBuJu_kZHByoEGxXUENGqSEmXjfiYjFSRrsHGvnO5vc", "https://l.facebook.com/l.php?u=https%3A%2F%2Fvimeo.com%2F549390560&h=AT38k2ftU9cenZ-HdisNKUl5_Hu7tJmusErK5TdcBeK4Ci_Enb3wAuuYcSn0WFn8xa0YXhq6ReAaEXSjQZK4WE0R_clYSN0iQedePfCmEkTbffH-dgzuqN8pGVJ8sQ9-WDgiGGJv2fH2RUGiJDSuW6iCrRA", "https://l.facebook.com/l.php?u=https%3A%2F%2Fvimeo.com%2F663453865&h=AT1ClHldhkO8c3v9hNCcqEqHtynOS9V7HbIKZktlVKnZoll2LaNydTiGpuNdka2jW4QtTHD-RExfIg6gPb51j_4hqXq-k24QBZ4dEScdfRbr73erqlantVamadFgoWMo-RlE2nL_jVttncCtVEdJVd6TDqc"], "image_save_path": ["682910820234425_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Home Improvement Craftspeople/Contractors Lancaster/York, PA • Join a company committed to our Craftspeople – allowing you to use your skills while maintaining a healthy balance between work and personal life • Work on various interior and exterior home improvement projects based on your skillset (light plumbing, light electrical, drywall, painting, tile installation, refinishing decks, cleaning gutters, etc.) • Provide superior service and quality work to every customer; no job is too small • Assess the needs at the job site by speaking to the customer and examining the area • Determine the tools and materials you need to complete the project • Pick up the necessary supplies and materials • Communicate clearly with the customer during each step of the process and listen to any other needs they may have, and suggest further solutions for future jobs • Find independence to work your trade with freedom and flexibility while expanding your skills. • Build a career with us – opportunities for growth and advancement for those interested in learning new skills (Apprentice, Craftsperson, Lead Craftsperson, Field Supervisor) • Enjoy excellent work-life balance: FT and PT opportunities, daytime schedule, no late nights, or weekends, able to request time off for your kids after school activities or other family commitments For nearly 20 years, Ace Handyman Services has prided itself in offering the highest quality service to every customer to exceed their expectations. We have built our company to be 100% focused on our Craftspeople so you can take back your life and still have a job that fits your skills and interests while we handle all the hassles of paperwork and scheduling. That’s why we are an excellent fit for previous business owners. We are looking for several experienced Craftspeople with a background in Home Repair and renovation as property maintenance techs, electricians, painters, plumbers, carpenters, landscapers, restoration technicians, installers, or general contractors. Entry-level candidates are encouraged to apply, as well. \"We're all working toward the same goal, and you cannot have success for one if you don't have success for all.\" Our Ideal Home Improvement Craftspeople/Contractor: • Experience: Experienced candidates wanted, at least 18 years old. On-the-job training is provided, but you must have some overall knowledge to do various home improvement tasks. We are looking for those with a background as a property maintenance tech, electrician, painter, plumber, carpenter, landscaping laborer, restoration technician, installer, or general contractor. • Problem-Solver: Must be able to troubleshoot issues experienced by the customer and come up with a creative and reasonable solution to provide excellent customer service. • Communicator: Provide clear and friendly communication before, during, and after home projects. • Friendly: Being personable and engaging positively with our customers helps instill trust while you are in their homes and working on their property. Confidence in discussing other home improvement or maintenance projects with the customer. • Active: Must be able to bend, kneel, reach, climb a ladder, and operate basic hand tools. • Respectable: Professional, presentable, and clean-cut appearance to represent the company well; no obscene or vulgar tattoos or facial piercings. • Must have your own basic hand and power tools. What we offer our Home Improvement Craftspeople /Contractor: • $20-$30/hour, depending on experience • Health, Dental, and Vision Insurance for FT employees • Paid Time Off and Holidays • Part-Time and Full-Time positions available • No nights or Weekends • All local jobs one-hour travel radius • Mileage reimbursement • Consistent year-round work • Flexible workplace with an office team that fully supports our craftspeople. • Independence to work confidently in your trade, your way, because jobs are scheduled to match your specialized skillset • $10 bonus for every 5-star review • Upsell bonus - $5/hour extra on the job even if you don't perform the work To Apply If you are entry-level or have a background as a property maintenance tech, electrician, painter, plumber, carpenter, landscaper, restoration tech, installer, or general contractor, please apply for our Home Improvement Craftsperson/Contractor position. Submit your resume in MS Word or PDF format. It doesn't need to be fancy but should include your contact information, relevant skills & certifications, and work history (employer, dates of employment, job title, and responsibilities). Employee Testimonial Videos: https://vimeo.com/548521485 https://vimeo.com/549390560 https://vimeo.com/663453865 FULL-TIME · $20 - $30 / HOUR · LANCASTER, PENNSYLVANIA Home Improvement Craftspeople/Contractors Apply now", "grouping_count": 0}, {"id": 1024136151877435, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["1024136151877435_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Commercial Roofer Mount Joy, PA • Join a roofing company that takes on prevailing wage jobs • Work on exciting job sites, including schools, government buildings, courthouses, churches, cathedrals, university buildings, etc. • Gain skills in working with a variety of roof surfaces from low slope single-ply roofing materials to steep sloped roofs with slate, cedar, copper, or metal roofing materials • On-the-job training is provided – we are willing to consider entry-level and skilled commercial roofers. • Local crews that are home every night OR the option to join our travel crew Mid-State Roofing & Coating is looking for skilled and entry-level roofers to join our crew. For over 20 years, we have been working in Central PA to replace, repair, and restore commercial, industrial, institutional, and historic roofs. In January 2020, we opened a division in Mt Joy, PA, to expand our services to the eastern regions of Pennsylvania. Why Roof with us? • Very Competitive Pay: Jobs typically pay between $35-$50+/hr. With a matching 401k plan after six months. • On-the-job training: We will provide training for those who are eager to learn & willing to work hard. • Profit Sharing: At the end of the year, we share our profits with our crews. • Safe workplace: We are very committed to and strict about workplace safety. • Positive Work Culture: We value quality – not just in our jobs but in our teams. We want to hear your ideas for improvements. We cultivate teamwork. We care about who you are as a person. • Professional Development: We offer classes and workshops that help you develop advanced roofing skills and personal development classes in finance, budgeting, investments, CPR certification, etc. Our Ideal Commercial Roofer: • Disciplined: Must be reliable, dedicated, and committed to your team to maintain high-quality work at a good pace. On time for work. Efficiency minded. Willing to work hard for everyone's benefit. • Teachable: Whether you are new to roofing or highly skilled – our projects are unique – there will be plenty to master. You must be willing to learn, receive feedback and try new roofing techniques. • Active: This position requires hustle – no slacking on the job. Must be able to work on flat and steep roof surfaces, climb ladders, use hand tools, lift up to 75 lbs., and do the range of activities associated with the roofing trade. • Safety Conscious: We are strict about keeping our crews safe. We do expect you to follow company policies regarding safety precautions and gear. To Apply Please submit your resume to this job ad to be considered for our Commercial Roofing Position. It does not need to be fancy but should include your name, contact information, skills, and work history (employer, dates of employment, job title, and responsibilities). FULL-TIME · MOUNT JOY, PENNSYLVANIA Commercial Roofer Apply now", "grouping_count": 0}, {"id": 1154410422114015, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["1154410422114015_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Equipment Mechanic / Service Technician - $1500 Sign-On Bonus! Gap, PA • Diagnose and repair various material-handling equipment, such as electrical and IC industrial forklifts of any brand, both in-house and at customer locations • Drive our service vehicle to assess and/or perform repairs • Ask questions so you have a clear understanding of the repair issue • Identify the make/model number of the equipment that needs service or repair • Discuss your findings with the Service Manager and the customer • Join a privately owned company where you are a valued member of our team • Enjoy on-the-job training in a rewarding career path for the right person with a teachable attitude Sam's Mechanical provides rentals, sales, & servicing of forklifts and other material-handling equipment of any brand for companies in and around Lancaster County. We are growing and looking to hire an Equipment Mechanic / Service Technician to work with our customers at their locations and on-site. Our Mechanic / Service Technician must accurately identify and repair equipment to keep our customers running. We are interested in talking with experienced Mechanics and entry-level candidates looking for on-the-job training. Our Ideal Equipment Mechanic / Service Technician will be: • Team Player: Humble enough to admit mistakes. Driven to do an excellent job. Great people skills. Positive attitude. • Teachable: Although experience is preferred, we are willing to provide on-the-job training for working with forklifts and related equipment. Background in equipment, automotive, trucking, or similar industries is helpful. Ability to write up work orders. Must enjoy working on equipment. • Relational: Ability to build rapport with customers and the rest of the crew. Must have excellent communication skills. • Mechanical: Solid understanding of how equipment works, including electrical & hydraulic schematics, preferred. • Investigative: Asks excellent questions to get to the heart of what the customer needs. • Detailed: Must be able to identify and determine the cause of a needed repair. • Hard-Working: Does what it takes to get the customer's equipment back up and running, even if it takes longer than expected. What we offer our Equipment Mechanic / Service Technician: • $22+/h based on your experience, plus a $1500 sign-on bonus. We are willing to pay for your expertise! • Health Insurance • Retirement plan with company match • Paid Holidays • Paid Vacation • Mon-Fri schedule with 45-47 hours per week, no evenings or weekends required • Uniforms with laundry service provided • Life Insurance • Short-Term Disability Insurance • Small, stable, growing company that values their employees • Family-friendly, faith-based work environment. To Apply: To be considered for our Equipment Mechanic / Service Technician position, please submit your resume in Microsoft Word or PDF format. FULL-TIME · $22 / HOUR · GAP, PENNSYLVANIA Equipment Mechanic / Service Technician - $1500 Sign-On Bonus! Apply now", "grouping_count": 0}, {"id": 1332799277510699, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Foffice-administrative-assistant%2FED.63C%3Fcoref%3D1.1.u74_B0D%261674588773774&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["1332799277510699_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Since 1950 Brandywine Machine Company has grown into one of the most well-known & trusted stainless steel machining facilities in the United States. We are looking for an Administrative Assistant to focus on typing orders, coordinating shipping orders, providing customer service, and helping the office function smoothly. COMEET.COM Job opportunity: Office Administrative Assistant at Team Builder Recruiting Office Administrative AssistantDowningtown, PA&nbsp;Provide administrative support by answering phones, talking with customers, assisting with bookkeeping, and other office-related tasks.Provide friendly customer service over the phoneEnter data into QuickBooks &amp; pay billsCoordinate shippingEnjo...", "grouping_count": 0}, {"id": 3395530560668677, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["3395530560668677_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Service Technician Oxford, PA • Service & Install automated milking & cooling equipment for customers in the dairy industry • Travel to customer sites to troubleshoot and repair equipment failures & breakdowns • Receive on-the-job training from experienced technicians • Communicate with clients regarding their service needs & repairs • Enter & track work orders in QuickBooks • Join a tight-knit, family-owned business that treats each person with respect, values teamwork, and is passionate about serving the dairy farming community • Work flexible full-time hours with regular overtime & an on-call schedule • Travel within a 50-mile radius for most work; some overnights are possible • Receive a competitive wage and an excellent benefit package Jones Dairy Service is a family-owned & operated business with a reputation for providing the best service in the region. We are dairy farmers who serve farmers by installing and repairing precision dairy equipment. We are looking for a Service Technician who wants to learn to install and service automated equipment. We encourage you to apply for this position if you have a background in mechanical or electrical trades, refrigeration, equipment maintenance, agriculture services, or farming. Our Ideal Service Technician: • Experience: A trade school graduate or someone with HVAC, agricultural, or dairy farming experience is a plus. We are willing to train the right person. • Mechanically Inclined: Solid mechanical aptitude with a desire to work on precision equipment. Some electrical, HVAC, or refrigeration knowledge, including vacuum pumps, conduit bending, electrical panels, PLC Programming, etc., is preferred but not required. • Great Communicator: You will be interacting with customers and manufacturers. Must be courteous & friendly. • Flexible: Able to change priorities and adapt your schedule as new service calls come in. • Computer Savvy: Our farm equipment requires basic computer knowledge to connect to equipment, make adjustments, set parameters for the proper function of milking machines, etc. Knowledge of QuickBooks is helpful. • Passionate: Must love the agricultural community and be excited to serve dairy farmers. Comfortable working in a dairy barn & handling dairy cows. • Active & Hardworking: Ability to perform physical labor, including bending, kneeling, standing for long periods, lifting up to 75 lbs, and climbing ladders. Comfortable working in a dairy barn. • Valid Driver's License: A reasonably clean driving record for 5 years to use the company vehicle during work hours. What we offer our Service Technician: • $26-$33/hour PLUS time & a half for OT hours • Health Insurance • Paid Holidays • Retirement plan with a 3% company match • Profit Sharing • Training by the product manufacturer • Company vehicle • Company phone & laptop • Flexible hours: you can set your schedule as long as the work gets done • Well-established, family-owned business that cares for & retains their employees To Apply Please submit your resume in Microsoft Word or PDF format to be considered for our Service Technician position. FULL-TIME · $26 - $33 / HOUR · OXFORD, PENNSYLVANIA Service Technician Apply now", "grouping_count": 0}, {"id": 1124739368210621, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["1124739368210621_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Service Technician Hagerstown, MD • Service & Install automated milking & cooling equipment for customers in the dairy industry • Travel to customer sites to troubleshoot and repair equipment failures & breakdowns • Receive on-the-job training from experienced technicians • Communicate with clients regarding their service needs & repairs • Enter & track work orders in QuickBooks • Join a tight-knit, family-owned business that treats each person with respect, values teamwork, and is passionate about serving the dairy farming community • Work flexible full-time hours with regular overtime & an on-call schedule • Travel within a 50-mile radius for most work; some overnights are possible • Receive a competitive wage and an excellent benefit package Jones Dairy Service is a family-owned & operated business with a reputation for providing the best service in the region. We are dairy farmers who serve farmers by installing and repairing precision dairy equipment. We are looking for a Service Technician who wants to learn to install and service automated equipment. We encourage you to apply for this position if you have a background in mechanical or electrical trades, refrigeration, equipment maintenance, agriculture services, or farming. Our Ideal Service Technician: • Experience: A trade school graduate or someone with HVAC, agricultural, or dairy farming experience is a plus. We are willing to train the right person. • Mechanically Inclined: Solid mechanical aptitude with a desire to work on precision equipment. Some electrical, HVAC, or refrigeration knowledge, including vacuum pumps, conduit bending, electrical panels, PLC Programming, etc., is preferred but not required. • Great Communicator: You will be interacting with customers and manufacturers. Must be courteous & friendly. • Flexible: Able to change priorities and adapt your schedule as new service calls come in. • Computer Savvy: Our farm equipment requires basic computer knowledge to connect to equipment, make adjustments, set parameters for the proper function of milking machines, etc. Knowledge of QuickBooks is helpful. • Passionate: Must love the agricultural community and be excited to serve dairy farmers. Comfortable working in a dairy barn & handling dairy cows. • Active & Hardworking: Ability to perform physical labor, including bending, kneeling, standing for long periods, lifting up to 75 lbs, and climbing ladders. Comfortable working in a dairy barn. • Valid Driver's License: A reasonably clean driving record for 5 years to use the company vehicle during work hours. What we offer our Service Technician: • $26-$33/hour PLUS time & a half for OT hours • Health Insurance • Paid Holidays • Retirement plan with a 3% company match • Profit Sharing • Training by the product manufacturer • Company vehicle • Company phone & laptop • Flexible hours: you can set your schedule as long as the work gets done • Well-established, family-owned business that cares for & retains their employees To Apply Please submit your resume in Microsoft Word or PDF format to be considered for our Service Technician position. FULL-TIME · $26 - $33 / HOUR · HAGERSTOWN, MARYLAND Service Technician Apply now", "grouping_count": 0}, {"id": 720358459676413, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Finside-sales--customer-service-representative---building-supplies%2FCF.537%3Fcoref%3D1.1.u74_B0D%261674251176465&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["720358459676413_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Homestead Outdoor Products, a fencing, railing, siding, and decking materials supplier, is looking for a Full-Time Inside Sales & Customer Service Representative. Our Inside Sales Representative is critical in building solid relationships with our repeat customers. We are a team who is lighthearted and enjoy our work. COMEET.COM Job opportunity: Inside Sales & Customer Service Representative - Building Supplies at Team Builder Recruiting Inside Sales &amp; Customer Service Representative - Building SuppliesNew Holland, PA&nbsp;Work with construction contractors to process their building supply ordersSpecialize in Decking, Railing, Fencing &amp; SidingMeet with walk-in customers at our showroom and process orders over the phone and v...", "grouping_count": 0}, {"id": 901181334649220, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["901181334649220_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Paving Crew Member/Laborer Gordonville, PA • Work for a friendly, team-oriented paving company with a residential and commercial crew • Receive on-the-job training for those new to the industry • Full benefits and competitive pay • Load and unload equipment • Work as part of the paving crew – prepping, paving, and operating equipment. • Local jobs with Monday-Friday work – Saturday is optional • Overtime pay during busy season (45-60 hours per week) • Growing company with a great team Leacock Paving LLC is looking for experienced and entry-level Crew Members & Drivers. We provide asphalt paving for residential, agricultural, and commercial properties. We are a faith-based company that values our team and our customers. We focus on doing excellent work built to last, prioritizing customer service. Our work provides a sense of satisfaction as you can see the beauty and value you've added to a property. We are a friendly, casual team that enjoys spending time together. Our Ideal Paving Crew Member: • Experienced: On-the-job training available to entry-level laborers, but experience using equipment, driving a pickup truck and trailer, and/or working on a paving crew is a plus! • Safety Minded: Aware of your surroundings as you operate the equipment. • Friendly: Enjoys being part of a team and working with others. • Respectful: We work at homes, farms, and businesses and respect them in our language and actions. We strive for positive and clean-cut work culture. • Dependable: Can be counted on to arrive at work on time and work efficiently throughout the day. • Team Player: Driven to contribute to the team. Good people skills. Humble. • Active: Able to lift up to 75 lbs., operate equipment, and do the physical work associated with paving. Able to pass a drug test and pre-employment physical. What we offer our Paving Crew Member: • Competitive Pay: $20-$27/h, Depending on Experience • 401k with company match • Health Insurance • Paid Time Off • Paid Holidays • Training is provided to help you advance your skills and earning potential. To Apply Please submit your resume if you are looking for local work with a great crew that will invest in your skill development. It doesn't need to be fancy but should include your name, contact information, and work history (employer, dates of employment, job title, and responsibilities.) FULL-TIME · $20 - $27 / HOUR · GORDONVILLE, PENNSYLVANIA Paving Crew Member/Laborer Apply now", "grouping_count": 0}, {"id": 699308135247328, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["699308135247328_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Experienced Asphalt Paver Gordonville, PA • Join a friendly, team-oriented commercial paving crew • Various positions available based on your skills and areas of interest – Roller Operator, Screed Operator, Paver Operator, Luting, Raking, etc. • Opportunity to build your skillset and receive training • Full benefits and competitive pay • Local jobs with Monday-Friday work – Saturday is optional • Overtime pay during busy season (45-60 hours per week) • Growing company with a great team Leacock Paving LLC is looking for an experienced Laborer & Paving Equipment Operator for our commercial crew. We provide asphalt paving for residential, agricultural, and commercial properties. We are a faith-based company that values our team and our customers. We focus on doing excellent work built to last, prioritizing customer service. Our work provides a sense of satisfaction as you can see the beauty and value you've added to a property. We are a friendly, casual team that enjoys spending time together. Our Ideal Asphalt Paver: • Experienced: Looking for skilled pavers, roller operators, screed operators, luters, etc. • Safety Minded: Aware of your surroundings as you operate the equipment. • Friendly: Enjoys being part of a team and working with others. • Respectful: We work at farms & businesses and respect them in our language and actions. We strive for a positive and clean-cut work culture. • Dependable: Can be counted on to arrive at work on time and work efficiently throughout the day. • Team Player: Driven to contribute to the team. Good people skills. Humble. • Active: Able to lift up to 75 lbs., operate equipment, and do the physical work associated with paving. Able to pass a drug test and pre-employment physical. What we offer our Asphalt Paver: • Competitive Pay: $25+/h – Willing to Pay for Experience • 401k with company match • Health Insurance • Paid Time Off • Paid Holidays • Training is provided to help you advance your skills and earning potential. To Apply Please submit your resume if you are looking for local work with a great crew that will invest in your skill development. It doesn't need to be fancy but should include your name, contact information, and work history (employer, dates of employment, job title, and responsibilities.) FULL-TIME · $25 / HOUR · GORDONVILLE, PENNSYLVANIA Experienced Asphalt Paver Apply now", "grouping_count": 0}, {"id": 1096462775086464, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Finside-sales-representative%2F12.639%3Fcoref%3D1.1.u74_B0D%261674140582020&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["1096462775086464_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Refresh LED is hiring an Inside Sales Representative to join our growing team. We are looking for someone who will build relationships with our customers, be committed to providing superior service, and embrace our company mission. COMEET.COM Job opportunity: Inside Sales Representative at Team Builder Recruiting Inside Sales Representative Mechanicsburg, PA&nbsp;Represent a growing, ambitious, faith-based company to churches, universities, &amp; businesses Help organizations evaluate their needs and find the right LED solution for their space.Process inbound leads by listening to their needs &amp; making re...", "grouping_count": 0}, {"id": 842686206837546, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fsolar-sales-consultant%2FEA.63F%3Fcoref%3D1.1.u74_B0D%261674136543990&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["842686206837546_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored A well-established solar installation company is seeking a Solar Sales Consultant to join our team in developing commercial, ag, and residential sales leads. We are looking for someone who is a sales warrior, connects with people, and regularly closes deals. COMEET.COM Job opportunity: Solar Sales Consultant at Team Builder Recruiting Solar Sales ConsultantSalisbury, MD&nbsp;Sell solar solutions for a reputable &amp; well-established company that provides turn-key solar energy systems for businesses, farmers, and homeowners in the Mid-Atlantic region.Launch your career in Solar Sales at a time when ROI is high due to incentives f...", "grouping_count": 0}, {"id": 2077042152486711, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/18/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fbookkeeper%2F7A.635%3Fcoref%3D1.1.u74_B0D%261674076976544&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["2077042152486711_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Century Home Improvements is a well-established local exterior home improvement company looking for an experienced bookkeeper. This position reports to the office manager of a five-person office staff. The bookkeeper will manage the day-to-day company accounting and prepare quarter-end and closing information for an outside CPA firm. COMEET.COM Job opportunity: Bookkeeper at Team Builder Recruiting BookkeeperElizabethtown, PAWork in a small business environment, where you have the option to cross-train and enjoy a variety of responsibilities.Enjoy a light-hearted office atmosphere that works hard AND has fun togetherPrepare and examine financial records for accuracyCertify applicable taxes are...", "grouping_count": 0}, {"id": 1347165112701105, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["1347165112701105_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Foreperson/Solar PV Installer Location: Salisbury MD What we're looking for in a Foreperson/Solar PV Installer: • Leadership: Ability to effectively motivate and direct the work efforts of those you lead. • Skilled: Construction-related experience in an area such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Excellent communicator. Self-motivated. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge and skills with full company support and both online and on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements. An Associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Foreperson/Solar PV Installers: • $26 - $32 per hour, DOE, and pay for travel time to and from all job sites • Travel premium and per diem for meals when traveling overnight, but home on weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short- & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company paid training in-person and online training to help build your career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Lead an installation crew that installs both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including site preparation, installation & both mechanical and electrical work About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team, and we've been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we're the #1 commercial solar installation company in PA. We are an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $26 - $32 / HOUR · SALISBURY, MARYLAND Foreperson/Solar PV Installer Apply now", "grouping_count": 0}, {"id": 639368577947214, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["639368577947214_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Foreperson/Solar PV Installer Location: Paradise PA, What we're looking for in a Foreperson/Solar PV Installer: • Leadership: Ability to effectively motivate and direct the work efforts of those you lead. • Skilled: Construction-related experience in an area such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Excellent communicator. Self-motivated. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge & skills with full company support and both online & on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements. An Associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Foreperson/Solar PV Installers: • $26 - $32 per hour, DOE, and pay for travel time to and from all job sites • Travel premium and per diem for meals when traveling overnight, but home on weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company paid training in-person & online training to help build your career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Lead an installation crew that installs both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including site preparation, installation & both mechanical and electrical work About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team, and we've been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we're the #1 commercial solar installation company in PA. We are an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $26 - $32 / HOUR · PARADISE, PENNSYLVANIA Foreperson/Solar PV Installer Apply now", "grouping_count": 0}, {"id": 892183262228133, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["892183262228133_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Foreperson/Solar PV Installer - $2,000 Sign-On Bonus! Location: Geneva, NY What we're looking for in a Foreperson/Solar PV Installer: • Leadership: Ability to effectively motivate and direct the work efforts of those you lead. • Skilled: Construction-related experience in an area such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Excellent communicator. Self-motivated. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge and skills with full company support and both online and on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements. An Associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Foreperson/Solar PV Installers: • $26 - $32 per hour, DOE, and pay for travel time to and from all job sites PLUS a $2,000 Sign-On Bonus • Travel premium and per diem for meals when traveling overnight, but home on weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company paid training in-person and online training to help build your career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Lead an installation crew that installs both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including site preparation, installation & both mechanical and electrical work About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team, and we've been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we're the #1 commercial solar installation company in PA. We are an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $26 - $32 / HOUR · GENEVA, NEW YORK Foreperson/Solar PV Installer - $2,000 Sign-On Bonus! Apply now", "grouping_count": 0}, {"id": 2960093160952222, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/18/2023", "ad_url": [], "image_save_path": ["2960093160952222_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Foreperson/Solar PV Installer Location: Hagerstown, MD What we're looking for in a Foreperson/Solar PV Installer: • Leadership: Ability to effectively motivate and direct the work efforts of those you lead. • Skilled: Construction-related experience in an area such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Excellent communicator. Self-motivated. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge and skills with full company support and both online and on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements. An Associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Foreperson/Solar PV Installers: • $26 - $32 per hour, DOE, and pay for travel time to and from all job sites • Travel premium and per diem for meals when traveling overnight, but home on weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short- & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company paid training in-person and online training to help build your career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Lead an installation crew that installs both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including site preparation, installation & both mechanical and electrical work About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team, and we've been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we're the #1 commercial solar installation company in PA. We are an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $26 - $32 / HOUR · HAGERSTOWN, MARYLAND Foreperson/Solar PV Installer Apply now", "grouping_count": 0}, {"id": 640824431132445, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/17/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fproduct-training-specialist%2F79.63D%3Fcoref%3D1.1.u74_B0D%261673995213494&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["640824431132445_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Superior Plastic Products Inc., a manufacturer of vinyl & aluminum fencing, railing, and specialty products, is looking for a Product Training Specialist in Indianapolis. You will provide quality interactions and training for railing & fencing dealers, such as hardware and building supply companies, railing & fence installation vendors, and contractors. COMEET.COM Job opportunity: Product Training Specialist at Team Builder Recruiting Product Training SpecialistIndianapolis, INChampion the development of training resources for contractors and dealersGain in-depth knowledge of Key-Link Fencing &amp; Superior Plastics' products &amp; installation methodsCollaborate with your team and other departments to develop effective Railing &...", "grouping_count": 0}, {"id": 705252721316962, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/17/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fproduct-training-specialist%2F79.637%3Fcoref%3D1.1.u74_B0D%261673993735700&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["705252721316962_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Superior Plastic Products Inc., a manufacturer of vinyl & aluminum fencing, railing, and specialty products, is looking for a Product Training Specialist. You will provide quality interactions and training for railing & fencing dealers, such as hardware and building supply companies, railing & fence installation vendors, and contractors. COMEET.COM Job opportunity: Product Training Specialist at Team Builder Recruiting Product Training SpecialistGreenville, SCChampion the development of training resources for contractors and dealersGain in-depth knowledge of Key-Link Fencing &amp; Superior Plastics' products &amp; installation methodsCollaborate with your team and other departments to develop effective Railing &am...", "grouping_count": 0}, {"id": 877125556860563, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/17/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Finside-sales-representative%2F59.63A%3Fcoref%3D1.1.u74_B0D%261673973285344&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["877125556860563_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Monterey Door has provided overhead garage doors for residents in Lancaster County and surrounding areas since 1987. We are a family owned & operated business that strives to offer high-quality products at a reasonable price. We are looking for an Inside Sales Representative to help our team generate sales and to ensure excellent customer service. COMEET.COM Job opportunity: Inside Sales Representative at Team Builder Recruiting Inside Sales RepresentativeBird-in-Hand, PARepresent a growing company by connecting with new and existing customers to generate sales, provide updates, process orders, and complete the sales process. Engage with customers regarding their questions on orders, installations, or repairsAssist customer...", "grouping_count": 0}, {"id": 719422569569475, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/16/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fsolar-sales-representative--commercial-and-agricultural%2FA8.63C%3Fcoref%3D1.1.u74_B0D%261673900240675&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["719422569569475_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We also perform service (O&M) work on the systems we install in these states and on systems that other solar installation companies have installed. COMEET.COM Job opportunity: Solar Sales Representative – Commercial and Agricultural at Team Builder Recruiting Solar Sales Representative – Commercial and AgriculturalLocation: Albany NY$80,000 - $100,000 or more per year&nbsp;What we're looking for in a Commercial and Agricultural Solar Sales Representative:Skilled: Strong track record of exceeding sales goals and quotas in outside or field sales. Experie...", "grouping_count": 0}, {"id": 734324978205697, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/16/2023", "ad_url": [], "image_save_path": ["734324978205697_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Wireless Technician, Upward Broadband Location: Carlisle/Fort Littleton, PA Area What we're looking for in a Wireless Technician: • Skilled: Hard-working, quick learner who is unafraid of heights and can work safely and efficiently using all required PPE. Able to properly use power tools, wrenches, basic grounding devices, and interactive wireless product hardware and software. • Team Player: Humble. Self-motivated. Hard worker. Excellent communicator. • Passionate: Eager to learn about a dynamic and growing industry and excited about working to establish reliable broadband infrastructure and provide great internet service to customers, particularly those under-served. Desire to continuously learn and build your knowledge and skills. • Knowledgeable: Able to deal with and communicate effectively with teammates, homeowners, and business clients to meet their specific needs and expectations. What is required to be a Wireless Technician: • Experience and competency in installing and provisioning electronics like modems, routers, switches, access points, and wireless radios. • A valid driver's license with a good or clean driving record. • A willingness to learn, grow and engage in creative problem-solving. What we offer our Wireless Technicians • $22 - $26 per hour, DOE • Thorough onboarding and on-the-job training to launch your career in the telecom industry, with opportunities for advancement and growth • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a fast-paced startup focused on providing reliable and relevant fixed wireless internet access to under-served areas and receive on-the-job training to help you build a career in an exciting and growing industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Work to safely install and maintain highly reliable wireless radio infrastructure on customers' job sites • Be an integral part of helping us continue to build our reputation as industry-leading experts in relevant wireless internet access in the communities we serve About Upward Broadband Upward Broadband is a fast-paced fixed Wireless Internet Service Provider (WISP) startup focused on providing reliable and relevant wireless internet access to under-served areas. We are an equal-opportunity employer, and we believe in empowering our team and allowing them to take pride in and have a passion for helping us accomplish our vision. FULL-TIME · $22 - $26 / HOUR · LANCASTER, PENNSYLVANIA Wireless Technician Apply now", "grouping_count": 0}, {"id": 1207172186896302, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/16/2023", "ad_url": [], "image_save_path": ["1207172186896302_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Sales Representative/Canvasser, Upward Broadband Location: Harrisburg/Carlisle, PA Area What we're looking for in a Sales Representative/Canvasser: • Skilled: Track record of achieving sales goals in outside sales. Experience in educating potential clients and closing sales with qualified candidates. Ability to deal with both residential and commercial clients and a strong comfort level with conducting \"cold calls\" with potential clients in-person and over the phone. • Team Player: Humble. Excellent communicator. Self-starter with an eagerness to embrace challenges, both externally and internally. • Passionate: Eager to learn about a dynamic and growing industry and excited about working to establish reliable broadband infrastructure and provide great internet service to customers, particularly those under-served. Desire to continuously learn and build your knowledge and skills. • Knowledgeable: Able to discern when it's appropriate to continue a conversation with a potential client and when it's best to simply end the conversation and move on without having them feel as though they've been pressured into making a decision. What we offer our Sales Representative/Canvasser: • Wage commensurate with experience and potential to succeed • A company vehicle, cell phone, and laptop with all required accessories • Thorough onboarding and on-the-job training to launch your career in the telecom industry, with opportunities for growth and advancement • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a fast-paced startup focused on providing reliable and relevant fixed wireless internet access to under-served areas • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Enjoy a high degree of independence and ownership for growing sales in the designated region while receiving a great deal of support from management and marketing as you seek to educate and qualify potential clients in that area • Be an integral part of helping us continue to build our reputation as industry-leading experts in relevant wireless internet access in the communities we serve About Upward Broadband Upward Broadband is a fast-paced fixed Wireless Internet Service Provider (WISP) startup focused on providing reliable and relevant wireless internet access to under-served areas. We are an equal-opportunity employer, and we believe in empowering our team and allowing them to take pride in and have a passion for helping us accomplish our vision. FULL-TIME · CARLISLE, PENNSYLVANIA Sales Representative/Canvasser Apply now", "grouping_count": 0}, {"id": 505750978324660, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/12/2023", "ad_url": [], "image_save_path": ["505750978324660_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Solar PV Installer Location: Sugarcreek, OH What we're looking for in a Solar PV Installer: • Skilled: Construction-related experience such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Good communicator. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge and skills with full company support and both online and on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements, as appropriate. An associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Solar PV Installers: • $22 - $28 per hour, DOE, and pay for travel time to and from all job sites • Travel premium and per diem for meals when traveling overnight, but home on the weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short- & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company-paid in-person and online training to help you build a career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Install both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including layout and site preparation, installation, and both mechanical and electrical work. About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team and have been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we are the #1 commercial solar installation company in PA. We're an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $22 - $28 / HOUR · SUGARCREEK, OHIO Solar PV Installer Apply now", "grouping_count": 0}, {"id": 940989060129323, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/12/2023", "ad_url": [], "image_save_path": ["940989060129323_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Solar PV Installer Location: Hagerstown MD What we're looking for in a Solar PV Installer: • Skilled: Construction-related experience such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Good communicator. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge and skills with full company support and both online and on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements, as appropriate. An associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Solar PV Installers: • $22 - $28 per hour, DOE, and pay for travel time to and from all job sites • Travel premium and per diem for meals when traveling overnight, but home on the weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short- & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company-paid in-person and online training to help you build a career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Install both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including layout and site preparation, installation, and both mechanical and electrical work About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team and have been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we are the #1 commercial solar installation company in PA. We're an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $22 - $28 / HOUR · HAGERSTOWN, MARYLAND Solar PV Installer Apply now", "grouping_count": 0}, {"id": 701080691524948, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/12/2023", "ad_url": [], "image_save_path": ["701080691524948_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Solar PV Installer Location: Harrisonburg VA What we're looking for in a Solar PV Installer: • Skilled: Construction-related experience such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Good communicator. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge and skills with full company support and both online and on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements, as appropriate. An associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Solar PV Installers: • $22 - $28 per hour, DOE, and pay for travel time to and from all job sites • Travel premium and per diem for meals when traveling overnight, but home on the weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short- & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company-paid in-person and online training to help you build a career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Install both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including layout and site preparation, installation, and both mechanical and electrical work About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team and have been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we are the #1 commercial solar installation company in PA. We're an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $22 - $28 / HOUR · HARRISONBURG, VIRGINIA Solar PV Installer Apply now", "grouping_count": 0}, {"id": 6333288876700353, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/11/2023", "ad_url": [], "image_save_path": ["6333288876700353_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Service Technician, O&M Locations: Hagerstown MD What we're looking for in a Service Technician for O&M • Skilled: Training and experience in both testing and troubleshooting electrical systems. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required of independently performing service work on solar systems installed by us or other solar installers. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Excellent communicator. Self-motivated. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge and skills with full company support and both online and on-the-job training. • Knowledgeable: Able to use testing equipment such as meggers, PV check, IV-curve tracers, clamp-on amp meters, and digital multi-meters. An Associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Service Technicians in O&M • $26 - $32 per hour, DOE, and pay for travel time to and from all job sites • Travel premium and per diem for meals when traveling overnight, but home on weekends • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short- & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and a growing O&M initiative • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Use sophisticated testing equipment to evaluate system performance, then troubleshoot and resolve poor and/or non-performing issues on previously installed solar systems • Be part of our O&M initiative servicing solar systems ranging in size from 2kW to 75MW+ About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We also perform service (O&M) work on the systems we install in these states and on systems that other solar installation companies have installed. We are committed to empowering our team, and we've been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we're the #1 commercial solar installation company in PA. We are an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $26 - $32 / HOUR · HAGERSTOWN, MARYLAND Service Technician, O&M Apply now", "grouping_count": 0}, {"id": 723058949143692, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/10/2023", "ad_url": [], "image_save_path": ["723058949143692_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Construction Driver/Laborer – Entry-level or Skilled Gap, PA • Grow a meaningful career with a reputable, faith-based company – entry-level or skilled workers welcome • Build meaningful relationships with the team by working and vacationing together • On-the-job training available for motivated individuals • Arrive early at the shop to gather supplies and drive the crew • Drive to the job site and do a range of skills, including carpentry, building decks, additions, retaining walls, and patios, installing siding, roofing, interior trim, and concrete work • Leave the job site and drive back to the shop by 5:00 pm to be home every evening • Saturday work is optional A & A Renovations, LLC is a family-owned, faith-based business that started in 2003. We specialize in residential exterior remodeling and home renovations. We value our reputation of having integrity & honesty, doing quality work, and regularly going the extra mile for our customers. We are looking for a full-time, reliable Construction Driver/Laborer – Entry-level or Skilled, who enjoys working with a close-knit team and is self-motivated & eager to have a valuable career in the construction industry. \"If you're not having fun on the job, then you're on the wrong job.\" Our Ideal Construction Driver/Laborer: • Experience: Construction experience is preferred but not required; willing to train entry-level candidates. • Reliable & Punctual: We meet at the shop each morning at 5:45 am. As the driver, you must be on time so that we are on time to the job site. • Motivated: We're willing to teach you if you have an aptitude for construction and want to learn the trade. But we're also very open to considering those skilled in construction. • Team Player: We all work together and support each other in performing the quality work our customers have come to expect. • Positive: Your experience is not as important as your attitude. We are looking for someone who is friendly and a good team player. • Friendly & Sense of Humor: Our guys enjoy being with each other. We keep our friendships strong, so our work doesn't suffer. • Active: This position requires climbing, kneeling, bending, standing, walking, and lifting up to 80 lbs. • Clean Driving Record: Must have a valid PA License and a clean driving record for the past five years. • Must have your own basic hand tools What We Offer our Construction Driver/Laborer: • $20-$30/h, DOE. Willing to pay for your experience! • Consistent Hours: Mon-Fri 5:45 am to 5:00 pm; Saturdays are optional • Health Insurance reimbursement • Paid Vacation • Paid Holidays • Summer and Christmas bonuses • Participation in recreational activities • No evenings or overnights • Opportunity to work for a reputable, faith-based company • Fulltime Hours with Overtime Pay To Apply To be considered for a Construction Driver/ Laborer position on our team, please submit your resume in MS Word or PDF Format. It doesn't need to be fancy but should include your name, contact information, relevant skills, and work history (employer, job title, dates of employment, and responsibilities). Both skilled and entry-level construction workers can apply for this full-time position. FULL-TIME · $20 - $30 / HOUR · GAP, PENNSYLVANIA Construction Driver/Laborer – Entry-level or Skilled Apply now", "grouping_count": 0}, {"id": 876748410326560, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/10/2023", "ad_url": [], "image_save_path": ["876748410326560_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Solar PV Installer Location: Salisbury, MD What we're looking for in a Solar PV Installer: • Skilled: Construction-related experience such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Good communicator. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge and skills with full company support and both online and on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements, as appropriate. An associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Solar PV Installers: • $22 - $28 per hour, DOE, and pay for travel time to and from all job sites • Travel premium and per diem for meals when traveling overnight, but home on the weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short- & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company-paid in-person and online training to help you build a career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Install both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including layout and site preparation, installation, and both mechanical and electrical work About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team and have been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we are the #1 commercial solar installation company in PA. We're an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $22 - $28 / HOUR · SALISBURY, MARYLAND Solar PV Installer Apply now", "grouping_count": 0}, {"id": 1476155866245976, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/09/2023", "ad_url": [], "image_save_path": ["1476155866245976_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Solar PV Installer Location: Paradise PA, What we're looking for in a Solar PV Installer: • Skilled: Construction-related experience such as roofing, HVAC, and/or electrical work. If you have experience as a roofer, electrician, or carpenter, we will provide on-the-job training based on your skill level, and we offer an electrical apprenticeship program to qualified candidates. • Active: Able to climb ladders, work from a roof, use hand tools, lift up to 75 lbs., and perform the physical work required for solar panel installation and site preparation. • Safety Conscious: Use all required PPE, including a safety harness. Certified in or willing to obtain OSHA 10, First Aid & CPR. Driver's license with a clean or good driving record. • Team Player: Humble. Good communicator. Hard worker. • Passionate: Excited about Solar Energy. Desire to continuously learn and build your knowledge & skills with full company support and online & on-the-job training. • Knowledgeable: Able to read drawings and apply NEC code requirements, as appropriate. An associate's degree or certificate from a trade school OR equivalent experience is preferred. What we offer our Solar PV Installers: • $22 - $28 per hour, DOE, and pay for travel time to & from all job sites • Travel premium and per diem for meals when traveling overnight, but home on the weekends • On-the-job training, with opportunities for advancement and an electrical apprenticeship program • Quarterly profit-sharing bonus (profits permitting) • Safe and desirable working environment • Medical, Dental & Vision • PTO that rolls over & Paid Holidays • 401(k) with company match • Short & Long-Term Disability • Basic and Voluntary Life and AD&D Consider the possibilities: • Join a well-established, award-winning solar installation company with a focus on commercial & agricultural projects and receive both on-the-job and company-paid in-person & online training to help you build a career in the growing renewable energy industry • Receive competitive pay and a comprehensive benefits package • Connect with our values of Faith, Integrity, Innovation, Teamwork & Stewardship • Install both ground-mount and roof-mount solar systems on customers' job sites ranging in size from 2kW to 2MW, with an average size of 55kW • Be part of the entire installation process, including layout and site preparation, installation, and both mechanical and electrical work About Paradise Energy Solutions Since 2009, Paradise Energy Solutions has become one of the leading solar installation companies in the mid-Atlantic region. We provide turn-key solar energy system installations for businesses, farmers, and homeowners in PA, MD, NY, OH, VA, DE, WV, and NJ. We are committed to empowering our team and have been recognized as one of the \"Best Places to Work in PA.\" We've also been ranked as a Top Solar Contractor by Solar Power World for 11 consecutive years, and we are the #1 commercial solar installation company in PA. We're an equal-opportunity employer, and we genuinely care about the people who are part of our team. FULL-TIME · $22 - $28 / HOUR · PARADISE, PENNSYLVANIA Solar PV Installer Apply now", "grouping_count": 0}, {"id": 904881794187931, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/09/2023", "ad_url": [], "image_save_path": ["904881794187931_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Concrete Finisher/Laborer - $5000 sign-on bonus! Ronks, PA • Do you love being outside & working with your hands? • Work as part of a team that likes what they do and has fun together • Learn a valuable trade that will set you up for future advancement – entry-level and experienced workers are welcome to apply • Enjoy variety in your work – projects include warehouse floors, decking slaps, loading docks, concrete paving, sidewalks, footers & piers, and decorative concrete • Load trucks with equipment the night before • Attend team meetings each morning • Drive your crew to assigned construction site • Pour & finish concrete at the direction of the Foreperson • Clean up tools & equipment • Join a steadily growing company that cares about your safety & professional development • Consistent year-round work Paradise Masonry is a commercial concrete contractor that takes care of the entire concrete flatwork process for commercial, industrial, and residential customers. We serve Southeast and Central Pennsylvania with quality work, cutting-edge equipment, high-caliber craftsmanship, and professional communication. We are looking for an entry-level or experienced Concrete Finisher/Laborer to work with a crew preparing, pouring, and finishing concrete work on our job sites. If you LOVE being outdoors & working with your hands, have a background in construction, or have some experience with masonry, block & bricklaying, concrete finishing, or pouring concrete, consider joining our tight-knit, supportive team! Our Ideal Concrete Finisher/Laborer: • Experience: Entry-level candidates are encouraged to apply. On-the-job training available. Higher pay for candidates with construction, safety knowledge, bricklaying, masonry, pouring concrete, and general knowledge of safety equipment. • Active: This position requires driving, lifting, bending, squatting, being on your feet most of the day, pushing a wheelbarrow, etc. • Team Player: Ability to get along and work efficiently with a team of 4 workers. Owns up to mistakes, pulls their weight, and is friendly. • Punctual, Reliable & Flexible: Work hours are typically 6 am to 5 pm, about 50 hours per week. Occasionally, the start time is before 6 am to beat the summer heat, or the end time could be after 5 pm until the job is complete – possibility of occasional Saturday work. • Desire to Learn: We provide on-the-job training for entry-level candidates and are eager to offer advancement opportunities for motivated people to learn. • Motivated: Your experience is not as important as your attitude. We are looking for someone who is friendly and a good team player. What we offer our Concrete Finisher/Laborer: • $22-$26/hour. DOE with a $5000 sign-on bonus! • Flexible, consistent hours, approx. 6 am to 5 pm work hours. Overtime Pay. • Health Insurance • Simple IRA w/ a company match • Paid Time off & Paid Vacation • Safety equipment provided • Profit Sharing • A steadily growing company that provides a supportive work environment for every employee To Apply If you have some construction experience or knowledge of bricklaying, masonry, pouring concrete, or equipment safety, consider applying for our Concrete Finisher/Laborer position. Submit your resume in MS Word or PDF Format. It doesn't need to be fancy but should include your name, contact information, relevant skills, and work history (employer, job title, dates of employment, and responsibilities.) Both entry-level and experienced are encouraged to apply. FULL-TIME · $22 - $26 / HOUR · RONKS, PENNSYLVANIA Concrete Finisher/Laborer - $5000 sign-on bonus! Apply now", "grouping_count": 0}, {"id": 1956938257977410, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/06/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fsales-manager--exterior-remodeling%2F13.63E%3Fcoref%3D1.1.u74_B0D%261673035985472&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["1956938257977410_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Glick's Exteriors of Gap, PA, is experiencing exciting growth and is ready to add a Sales Manager – Exterior Remodeling to our Exterior Remodeling Company. The ideal candidate will take on an essential role in the company and work directly with the owner to grow and develop the business. COMEET.COM Job opportunity: Sales Manager – Exterior Remodeling at Team Builder Recruiting Sales Manager – Exterior RemodelingGap, PABuild a sales team that will take our Exterior Remodeling company to the next levelGet Rewarded for results with a generous commission structure with no cap on earnings!Hire and train additional sales repsSet monthly, quarterly, and annual goals for each o...", "grouping_count": 0}, {"id": 848238733105697, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/07/2023", "ad_url": [], "image_save_path": ["848238733105697_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Appliance Service Technician Brownstown, PA • Service electric & gas appliances in customers' homes and businesses • Receive on-the-job training in appliance repair • Check your job list each morning on your phone (typically 6-8 service calls/day) • Stock the truck with the necessary parts & tools • Call the customer before arriving • Consult with the customer about the needed repair • Diagnose & repair the issue on-site or order parts as needed • Take customer payments • Help with in-shop repairs as schedule allows • Join a team with a heart to serve each other & our customers Martin Appliance is looking for a full-time Service Tech to provide excellent repair services on all our appliances. We offer a variety of appliances & brands from GE to Frigidaire. Our mission is to glorify Christ by positively impacting the lives of those we serve daily while being faithful stewards of all things entrusted to us. If you have previous experience in a technical/diagnostic position, such as HVAC, auto mechanic, installation, repair tech, etc., we will provide on-the-job training in appliance repair. We value our people and are committed to providing a safe working environment. Our Ideal Appliance Service Technician: • Experienced: Technical and/or diagnostic experience is highly preferred. A background in HVAC or experience as a mechanic would be helpful. Willing to train in the appliance field. • Great Attitude: Enjoys serving customers & fixing their problems with empathy. • Problem-Solver: Someone who enjoys troubleshooting & fixing problems. • Detail-Oriented: Aware of small details when inspecting & repairing appliances; the ability to work efficiently & effectively within time constraints while remaining organized. • Communication Skills: Provide friendly service by listening and clearly explaining the repair or replacement options. • Computer Skills: Basic computer skills needed; will be trained on our software. • Active: Ability to lift up to 75 pounds on occasion & distinguish various colors of wires & electronic systems, and wiring. • Tools: Basic hand tools are required, but the company provides specialty tools. • Travel: Local work within a 50 to 70-mile radius of the shop. Must have a reasonably clean driving record for 3 years. What We Offer Our Appliance Service Technician: • $23 - $25/h, depending on experience • Health Insurance • PTO & Paid Holidays • 401K w/ employer match • Consistent full-time hours, 8 am to 5 pm, Monday through Friday • Optional overtime with evening & Saturday hours • On-the-job training programs & vendor update classes • Uniforms • Company cell phone • Christmas bonus • Christmas banquet & Summer picnic To Apply If you have technical or diagnostic experience in a position like HVAC tech, auto mechanic, appliance repair technician, etc., please submit your resume in response to this job ad. We will provide on-the-job training for qualified candidates. FULL-TIME · $23 - $25 / HOUR · BROWNSTOWN, PENNSYLVANIA Appliance Service Technician Apply now", "grouping_count": 0}, {"id": 900998837721634, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["900998837721634_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Driver / Installer – Entry-level or Skilled - $1,000 Sign-On Bonus! Quarryville, PA • Grow a meaningful career with a reputable, local company – entry-level or skilled workers welcome • Arrive at the shop by 7:00 am • Load trailer with supplies for the day's job(s) • Drive to the job site, usually within 30 minutes to 2-hour radius • Evaluate the job & do the work required at each job site • Return to the shop, clean out the trailer, & get rid of scrap to prepare the truck for the next day • On-the-job training available for motivated individuals Brightside Chimney is a small business that specializes in the installations & inspections of stainless steel liners, chimneys, chimney chases, and chimney rain caps. We take pride in installing quality products to make chimneys safe and provide training to our employees to ensure everyone stays current on the latest products & installation techniques. We also sell & install wood stoves and gas fireplaces. We are looking for an entry-level or skilled full-time Driver/Installer who has a strong desire to learn, enjoys working closely with others, and is dependable & trustworthy. Our Ideal Driver/Installer: • Experience: Construction experience is helpful but not required. Willing to provide on-the-job training for someone with a strong desire to learn. Knows how to use basic hand tools. • Reliable & Punctual: We meet at the shop each morning at 7 am. As the driver, you must be on time so that we are on time to the job site. • Trustworthy: Someone who is honest, works hard, and communicates any changes in their schedule. • Team Player: We all work together to get the job done well; someone who listens & takes direction while also offering their ideas & feedback. • Positive: Your experience is not as important as your attitude. We are looking for someone who is friendly and a good team player. • Detail-Oriented: A task-oriented, organized person with high standards. Able to prioritize tasks and deliver high-quality work. • Active: Ability to lift & carry up to 75 pounds, bend, kneel, climb ladders, & work from roof height. • Clean Driving Record: Must have a valid PA License and a clean driving record for the past 3 years. Will drive a pickup truck, pulling a 14-foot trailer. What We Offer our Driver/Installer: • $20 - $22/hour • $1,000 sign-on bonus • Job-based bonuses • Year-round work: 30-40 hours/week during the slow season & up to 50 hours/week during the busy season • Paid Vacation • Paid Holidays • Employer supplies all safety PPE • Development & training by vendors on their products • Learn a valuable trade, keeping chimneys in good repair & safe around the community To Apply: To be considered for a Driver/Installer position on our team, please submit your resume in MS Word or PDF Format. It doesn't need to be fancy but should include your name, contact information, relevant skills, and work history (employer, job title, dates of employment, and responsibilities). Both skilled and entry-level construction workers can apply for this full-time position. FULL-TIME · $20 - $22 / HOUR · QUARRYVILLE, PENNSYLVANIA Driver / Installer – Entry-level or Skilled - $1,000 Sign-On Bonus! Apply now", "grouping_count": 0}, {"id": 876962867089598, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/04/2023", "ad_url": [], "image_save_path": ["876962867089598_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Over The Road Class A CDL Truck Driver - Full Benefits & $5,000 sign-on bonus New Holland, PA • Drive a Kenworth T680 truck with an 80\" sleeper cab • Haul a 53-foot curtain-side trailer • Earn competitive pay - .53¢/mile + $18-20/hour load and unload pay • Get full benefits • Be out 3-4 nights per week, but home every weekend • Load in New Holland, PA, and make deliveries on one of three rotating routes: Ohio to Wisconsin, Ohio to Missouri, and Virginia to Florida • Have steady year-round work with Overtime (50+ hours per week) Superior Hauling, a division of Superior Plastic Products, is looking for a Full-Time Class A CDL Truck Driver to haul building materials. As a company, we are interested in people who want to be problem solvers and treat others with respect and, in turn, get steady employment by a company that values every person and treats them with respect. What We're Looking for in our Class A CDL Truck Drivers: • License: Valid Class A CDL License with at least one year of truck driving experience • Clean Record: Must have a clean driving history and pass a drug screen • Experienced: Forklift experience is preferred, but we are willing to train • Safety Conscious: Able to operate vehicles and equipment in high-traffic and busy environments • Active: Must lift and pull equipment up to 50 lbs. • Accountable: Able to work independently and manage your time with little supervision What We Offer our Class A CDL Truck Drivers: • Competitive Pay - .53¢/mile + 18-20/hour during loading and unloading • Health, Dental, and Vision Insurance - available after 30 days of employment • 401k with a match • Paid Time Off PLUS 8 Paid Holidays • Consistent schedule • Meal allowance while on the road • Opportunity for additional Overtime • Life Insurance • Short & Long-Term Disability Insurance - 100% employer-paid • Employee Assistance Program To Apply To be considered for one of our Class A CDL Driver positions, please submit your resume in Microsoft Word or PDF format. It doesn't need to be fancy but should include your name, contact information, relevant licenses & education, and work history (employer, dates of employment, job title, and responsibilities). If you are a CDL Truck Driver looking to join a great team – we hope to hear from you! FULL-TIME · $18 - $20 / HOUR · NEW HOLLAND, PENNSYLVANIA Over The Road Class A CDL Truck Driver - Full Benefits & $5,000 sign-on bonus Apply now", "grouping_count": 0}, {"id": 873814186999497, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/04/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fbrand-marketing-associate%2F02.63F%3Fcoref%3D1.1.u74_B0D%261672844382250&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["873814186999497_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Refresh LED is looking to add a Brand Marketing Associate to coordinate our B2B marketing efforts and maintain brand consistency across all our social media channels. We are looking for someone who will confidently develop & expand our brand onto new channels and create blogs, emails, & social media posts that align with our mission. COMEET.COM Job opportunity: Brand Marketing Associate at Team Builder Recruiting Brand Marketing AssociateMechanicsburg, PA&nbsp;Jump into a newly created role working with social media and coordinating the marketing content across all media outletsManage our social media channelsInteract with the comments &amp; traffic across our platformsBuild audiences and superfans on social...", "grouping_count": 0}, {"id": 864099318197137, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/04/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fsenior-accountant%2FF1.636%3Fcoref%3D1.1.u74_B0D%261672839398278&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["864099318197137_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Metalum is looking for a Senior Accountant to oversee our financial and HR initiatives and be a part of our business growth. Metalum is a family-friendly and community-focused workplace comprised of both Amish and non-Amish employees. COMEET.COM Job opportunity: Senior Accountant at Team Builder Recruiting Senior AccountantHoneybrook, PA &nbsp;Track financial trends and make recommendations that will help take us to the next level of growthCollaborate with the leadership team on annual budget &amp; budgeting for special projectsDevelop and record standard accounting and HR procedures Process A/P, A/R,...", "grouping_count": 0}, {"id": 564494038518295, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "01/03/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Flead-drafter%2F41.533%3Fcoref%3D1.1.u74_B0D%261672750069217&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["564494038518295_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Lapp Millwright LLC is looking for a Lead Drafter to join our team. You will play a critical role in our company by designing parts and assembly drawings while leading the rest of your department. COMEET.COM Job opportunity: Lead Drafter at Team Builder Recruiting Lead DrafterLebanon, PA&nbsp;Lead a drafting team in designing 3D drawings &amp; fabrication drawings for top-of-the-line dust collection systemsCollaborate and meet with Sales &amp; Operations to review the job scheduleSchedule work for your team Draw promotional materials for our productsDesign ac...", "grouping_count": 0}, {"id": 889418435594257, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "12/29/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Flumber-yard-manager%2FEF.538%3Fcoref%3D1.1.u74_B0D%261672342803925&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["889418435594257_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored For over 30 years, Stoltzfus Forest Products has partnered with local landowners to manage their timber lots sustainably, protecting their resources and the land for years to come. Our vision is to be our community's most trusted hardwood provider and employer through excellent timber management and processing that exceeds customer expectations. We are looking for an experienced yard worker to receive, store, ship, and track inventory for our kiln-dried lumber. COMEET.COM Job opportunity: Lumber Yard Manager at Team Builder Recruiting Lumber Yard ManagerPeach Bottom, PAOversee daily operations in our kiln-dried lumberyardTrack lumber inventory and help maintain accurate recordsCollaborate with our sales team to know priority orders and pick-up schedulesSort and stack lumber coming from our kilnsOrganize the lumberyard in a way th...", "grouping_count": 0}, {"id": 1243544392895109, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "12/29/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fbookkeeper%2FEF.537%3Fcoref%3D1.1.u74_B0D%261672338574334&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["1243544392895109_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored For over 30 years, Stoltzfus Forest Products has partnered with local landowners to manage their timber lots sustainably, protecting their resources and the land for years to come. Our vision is \"To be the most trusted hardwood provider and employer for our community through excellent timber management and processing that exceeds customer expectations.\" We are looking for an experienced bookkeeper to join our team to provide general accounting/bookkeeping services and assist our office manager. COMEET.COM Job opportunity: Bookkeeper at Team Builder Recruiting BookkeeperPeach Bottom, PAProvide bookkeeping support in a growing business with multiple divisionsProcess AP/AR using QuickBooks OnlinePrepare payroll data to send to our accounting firmMatch purchase orders to bills for management's approvalComplete and process lumber invoices and packing slipsMon...", "grouping_count": 0}, {"id": 697711791970573, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "12/29/2022", "ad_url": [], "image_save_path": ["697711791970573_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Service Technician – Food & Beverage Equipment Torrington, CT • Join a rapidly growing company whose success is built on equipping, valuing, and caring for their team • Diagnose, Repair & Maintain commercial food service equipment in convenience stores & restaurants • Service equipment, including ice machines, coolers, fountain beverage equipment, carbonated and non-carbonated beverage dispensers, combi-ovens, etc. • Work independently at the job site. • Communicate with the customer throughout the service call – allowing them to explain the issue and review the recommended repairs. • Travel to job sites in a fully equipped service truck • Reflect our core values of faith, serving others, trust, passion, and Awesomeness • Enjoy a positive company culture that includes caring for our employees by providing competitive pay and a comprehensive benefits package Barranco Enterprise Inc is a nationwide contractor, electrical, and maintenance company built around creating an incredible experience for employees and customers. We desire to see God's world flourish by creating a culture where employees and customers thrive. Our team is growing and needs additional service technicians focused on quality and committed to serving our customers with excellence. Our Ideal Service Technician • Experience: 3+ years providing repairs and preventative maintenance for commercial food service equipment is preferred. Must have EPA certification. Strong refrigeration, mechanical and electrical background is preferred. • Detailed: Thoroughly inspect the equipment to identify the necessary repair. Work systematically and carefully. • Organized: Maintain a clean job site, track time and materials, and keep a fully stocked truck. • Committed: Strive to deliver excellence for the customer and continuous improvement. • Active: Able to lift up to 50 pounds, bend, kneel, and stand for extended periods. Perform all work associated with servicing equipment. • Reliable: A clean driving record and the ability to pass a criminal background check. What we offer our Service Technician: • $35+/hour DOE • Overtime available • Health, Dental, and Vision Insurance • Paid Holidays • Paid Vacation • Retirement plan • Company Chaplain • Advancement opportunities with a rapidly expanding company • Supportive, family-friendly work environment To Apply If you are a Service Technician with experience working on food and beverage equipment and looking for a positive work culture that offers you room to grow, please submit your resume via this job ad. FULL-TIME · $35 / HOUR · TORRINGTON, CONNECTICUT Service Technician – Food & Beverage Equipment Apply now", "grouping_count": 0}, {"id": 5754333517955038, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "12/29/2022", "ad_url": [], "image_save_path": ["5754333517955038_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Service Technician – Food & Beverage Equipment Alpharetta, GA • Join a rapidly growing company whose success is built on equipping, valuing, and caring for their team • Diagnose, Repair & Maintain commercial food service equipment in convenience stores & restaurants • Service equipment, including ice machines, coolers, fountain beverage equipment, carbonated and non-carbonated beverage dispensers, combi-ovens, etc. • Work independently at the job site. • Communicate with the customer throughout the service call – allowing them to explain the issue and review the recommended repairs. • Travel to job sites in a fully equipped service truck • Reflect our core values of faith, serving others, trust, passion, and Awesomeness • Enjoy a positive company culture that includes caring for our employees by providing competitive pay and a comprehensive benefits package Barranco Enterprise is a nationwide contractor, electrical, and maintenance company built around creating an incredible experience for employees and customers. We desire to see God's world flourish by creating a culture where employees and customers thrive. Our team is growing and needs additional service technicians focused on quality and committed to serving our customers with excellence. Our Ideal Service Technician • Experience: 3+ years providing repairs and preventative maintenance for commercial food service equipment is preferred. Must have EPA certification. Strong refrigeration, mechanical and electrical background is preferred. • Detailed: Thoroughly inspect the equipment to identify the necessary repair. Work systematically and carefully. • Organized: Maintain a clean job site, track time and materials, and keep a fully stocked truck. • Committed: Strive to deliver excellence for the customer and continuous improvement. • Active: Able to lift up to 50 pounds, bend, kneel, and stand for extended periods. Perform all work associated with servicing equipment. • Reliable: A clean driving record and the ability to pass a criminal background check. What we offer our Service Technician: • $30-32/hour DOE • Overtime available • Health, Dental, and Vision Insurance • Paid Holidays • Paid Vacation • Retirement plan • Company Chaplain • Advancement opportunities with a rapidly expanding company • Supportive, family-friendly work environment To Apply If you are a Service Technician with experience working on food and beverage equipment and looking for a positive work culture that offers you room to grow, please submit your resume via this job ad. FULL-TIME · $30 - $32 / HOUR · ALPHARETTA, GEORGIA Service Technician – Food & Beverage Equipment Apply now", "grouping_count": 0}, {"id": 701559621377014, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "12/29/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fsenior-accountant---public-accounting%2FF1.537%3Fcoref%3D1.1.u74_B0D%261672321357164&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["701559621377014_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored McClarigan CPAs & Advisors is growing and is looking for a skilled Senior Accountant focusing on business taxes. We are a proactive firm of accountants and consultants providing financial services within industry and service specialties. We offer services in a highly personalized manner to quality clients who value our expertise. COMEET.COM Job opportunity: Senior Accountant - Public Accounting at Team Builder Recruiting Senior Accountant - Public Accounting&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Paradise, PA&nbsp;Support clients through all five phases of their business cycle: expansion, peak, recession, trough, and recovery...", "grouping_count": 0}, {"id": 1839473533083535, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "12/29/2022", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.comeet.com%2Fjobs%2Fteambuilderrecruiting%2F45.003%2Fstaff-accountant---public-accounting%2FF1.536%3Fcoref%3D1.1.u74_B0D%261672324085527&h=AT3NkuyVOPuevOZ8KGM4h_OpH72ZCGGydL34jXNUfADtsmh134plqkw8c4i57uTg9bs0okKr1yCJrcq_ud4gOv6l59rLH7VpPshRHaRK6prvYwWoO1tHnSGwHnVfqDJOsmleghnPg7mrxi1tgnxgOxLr3Sc"], "image_save_path": ["1839473533083535_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored McClarigan CPAs & Advisors is growing and looking for a Staff Accountant focusing on business taxes. We are a proactive firm of accountants and consultants providing financial services within industry and service specialties. We offer services in a highly personalized manner to quality clients who value our expertise. COMEET.COM Job opportunity: Staff Accountant - Public Accounting at Team Builder Recruiting Staff Accountant - Public Accounting&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Paradise, PASupport clients through all five phases of their business cycle – expansion, peak, recession, trough, and recoveryWork...", "grouping_count": 0}, {"id": 460396002766187, "advertiser_name": "Team Builder Recruiting", "status": "Active", "date": "12/29/2022", "ad_url": [], "image_save_path": ["460396002766187_00.jpg"], "ad_text": "Team Builder Recruiting Sponsored Roofer – Entry-level or Experienced Lititz, PA • Build a broad skillset within roofing as an entry-level or experienced roofer • Drive a Chevy 2500 work truck & Equiptor roofer buggy/trailer to job sites daily • Install & repair cedar shake, asphalt, metal, and rubber roofing • Pick up supplies & additional materials to complete the job • Assist the crew in staging each job, removing the existing roof, installing the new roof, & cleaning up the work site • Clean out & wash the company vehicles and gas them up • Work with a leader who desires & values your feedback, ideas, and suggestions • Join a company that provides a clean, Christian work atmosphere with a positive, tight-knit culture Superior Roofing is a full-service roofing contractor that provides quality roofing services to Lebanon, Lancaster, and York counties. We aim to deliver exceptional customer service while installing high-quality roofing systems with excellent work, providing a close-knit work culture with advancement opportunities for our employees. We are hiring a Roofer who will drive the crew to the job sites and join in providing quality contractor services. Consider joining our team if you want to join a reputable, family-owned company with a great crew. We will train entry-level employees and offer future leadership opportunities to those who match our values to our customers. Our Ideal Roofer: • Experience: A background in roofing is a plus but not required. We are willing to train entry-level employees. • Willing to Learn: We provide on-the-job training for entry-level candidates. We are eager to offer advancement opportunities for people who demonstrate humility & servant leadership. • Respectful: Careful to protect our customer's property, use appropriate language, and maintain a reasonably clean-cut appearance. • Team Player: Humble and hardworking. You lead by example. Cares about teammates & customers – passionate about working together to provide quality service to our customers. • Active: Working in a physically demanding role, bending, kneeling, using tools, climbing scaffolding, comfortable with heights, and lifting 50+ lbs. Able to work hard in all seasons because we roof year-round! • Tools required: You provide your tool pouch. • Driver's License: You will be driving a company truck & trailer; a driver's license is required. Must be at least 18 years old with a relatively clean driving record. What we offer our Roofer: • $20-$24/hour. DOE • Consistent full-time hours, with regular overtime • Paid Time Off & Paid Holidays • Sales-based monthly bonuses • Company outings • Clean, Christian work atmosphere • Family-oriented and close-knit team • An open door to voice ideas/concerns to management • A fun-loving crew that loves to laugh & work hard together To Apply Please submit your resume via this job ad to be considered for our Roofer position. It does not need to be fancy. It should include your name, contact information, and recent work history (employer, dates of employment & job title.) We are interested in hearing from individuals who are entry-level or experienced in roofing. FULL-TIME · $20 - $24 / HOUR · LITITZ, PENNSYLVANIA Roofer – Entry-level or Experienced Apply now", "grouping_count": 0}]