[{"id": 712096453820807, "advertiser_name": "Ag Partners Coop", "status": "Active", "date": "01/27/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fagpartners.net%2Fcareers%2F&h=AT135k4krsqCCBvy7hea2oJ3w-6XEYMIlPh6Ko4awGzzUs9meyqneLpob_nmh3uoByfi7iecor55uLaI9ayWMckpxnGxcs9NGvkjmvx65w0zxOCyylDJRBt1sP9x1KxDKAATBq7t1ZNGVUcqkg8yWWSAUH0Z0h9TYqLyq-J_wM9X3C-4MNDfJ3-m"], "image_save_path": ["712096453820807_00.jpg"], "ad_text": "Ag Partners Coop Sponsored See Website for full list and details https://agpartners.net/careers/ FULL-TIME · GOODHUE, MINNESOTA Jobs in Agriculture Apply now", "grouping_count": 0}, {"id": 585089793079395, "advertiser_name": "Ag Partners Coop", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fagpartners.net%2Fcareers%2F&h=AT2KPH_xaxXMifOlm7s0mpIkkt_XU6CkOipg3IxicQ248bm7TFN6jUWOVt0WiXI0LoUudpyfdnMe0McBUO7TFVHb6rJ_WfeTIsOMGAoO9KTh1n30RdGuYDzvg1BL9FQi3Mw8bMhFkC6fWJUZCnk6iLk0FkRX77GL65Psiq03OTM"], "image_save_path": ["585089793079395_00.jpg"], "ad_text": "Ag Partners Coop Sponsored Custom Applicator Department: Agronomy Locations: Agronomy locations, Multiple in Southern MN and Western WI Pay: Competitive wages with bonus potential Date Posted: Winter 2023 Please apply at: https://agpartners.net/careers/ Job Summary: This is a full‐time position based at various locations. Regular hours can vary, extended hours will be necessary during peak times and as business dictates. The purpose of this position is to increase service performance and excellence to our customers by performing tasks associated with the day‐to‐day operations of our retail Agronomy supply and service operations. This job description is not intended to be all‐inclusive. Employee may be asked and expected to perform other related duties as negotiated or assigned to meet the ongoing and/or changing needs of the organization. All custom applicators, new and experienced, go through training to make sure they are comfortable and know how the equipment operates before using it in the field. Duties/Responsibilities: Perform day‐to‐day activities of our business including, but not limited to field application of crop protection and plant nutrient products for our customers and our business partners, truck hauling (pickup, dry and liquid tender, dump truck), blending and loading fertilizer and pesticide products, product delivery, warehouse fertilizer, seed, and pesticide, etc. Repair and maintain company equipment in our company shop and accurately complete all necessary records and documentation; contribute to property tidiness, upkeep, and appearance. Support and facilitate growth of company’s data management program, AYS, through soil sampling, data collection and entry, field‐trial documentation, etc. Effectively communicate with co‐workers, supervisors, and customers to perform needed tasks of the company to further enhance the company’s mission and image. Follow strict company safety protocol procedures including, but not limited to: Confined Space Entry, Lock‐out‐Tag‐out (LOTO) and use of Personal Protective Equipment (PPE). Complete all records and documentation of activities as required by regulatory agencies. Greet and serve ALL customers promptly and courteously throughout the facility, providing superior customer service. Required Skills/Abilities: Understand how to use and operate equipment used in our business (including field application equipment, heavy‐duty trucks, blending equipment, and all support equipment. Excellent verbal communication skills, ability to effectively communicate with co‐workers, supervisors and customers, positive attitude. Ability to work evening and weekend hours as business dictates. High attention to detail and high level of accuracy. Learn and recognize what needs to be done and do so without direct supervision or direction. Ability to work in a team or independently, multi‐task in a fast‐paced environment, and ability to accept responsibility and accountability for job performance. Must pass DOT physical and all required drug testing. Education and Experience: Must have or be able to obtain a Commercial Pesticide Applicators license. Must have or be able to obtain a Class A CDL with necessary endorsements (Haz Mat, air brakes, tanker) and maintain commercial insurability. Physical Requirements: Moderate to heavy lifting is required (60 lbs.) on a regular basis. Work conditions may include dust, fumes, moderate to loud noise levels, uneven surfaces, various heights. Ability to climb ladders and perform tasks at elevated positions. Ability to work near moving equipment, outside and insider, and in all‐ weather conditions. While performing the duties of the job, it is required to speak, hear, see, and use hands/fingers to operate a computer, telephone, equipment, etc. Ability to regularly stand, walk, reach with arms and hands, climb, balance, stoop, kneel, crouch, push and pull. Meet the physical and mental demands of working seasonal long hours, climbing ladders, repetitive heavy lifting, and prioritizing multiple tasks during peak workload times. Understand and comply with OSHA, MDA, DOT, EPA, MPCA and other regulations. Work efficiently while always keeping yourself and others safe. FULL-TIME · GOODHUE, MINNESOTA Custom Applicator Apply now", "grouping_count": 0}, {"id": 697518725202216, "advertiser_name": "Ag Partners Coop", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fagpartners.net%2Fcareers%2F&h=AT2LjgnTFP7WIcml_oqCAYN1YBe_unBC3uVqu-OMmkks9OJ_kank3tpLgGb2MFkLM3MeOWzNU73KO0DfzPspIEEElUzLhaY-KVZ7SHMPU90PEhERKCLVp59-Z_UOzZZ7_EAbTKusp3mH5g6U0RTNgKn5Eo3U8ZouJHyXcexA1kA"], "image_save_path": ["697518725202216_00.jpg"], "ad_text": "Ag Partners Coop Sponsored Seasonal Agronomy Department: Agronomy Location: Morristown, MN & Multiple Date Posted: Winter 2023 Please apply at: https://agpartners.net/careers/ Drive co-op owned trucks to deliver dry or liquid bulk material to our customers. Follow company protocol and safety regulations and comply with applicable regulations as required. (truck drivers) Qualifications: Class A or B CDL with tanker endorsement preferred; a seasonal (180 day) CDL may be adequate in certain circumstances. Valid DOT health card. Demonstrated proficiency of truck operation and maneuvering. Skid Loader/Forklift Operator (truck drivers) Operate skid loader/forklift for loading dry granular fertilizer into blending equipment. Maintenance and light repair of skid loader, forklift, and other equipment. Follow company protocol and safety regulations and comply with applicable regulations as required. (truck drivers) Seasonal Agronomy (all other) Qualifications: Proficiency with forklift and skid loader operator. CDL desirable but not required. Loading Dock, Customer Service, and Yard Work Assistant Aid co-op staff with outside activities including (but not limited to) loading customers with feed, seed, and pesticide products. Loading bulk pesticide and fertilizer products. Equipment maintenance and light duty repair. Receive and unload shipments of products. Follow company protocol and safety regulations and comply with applicable regulations as required. Attention to detail. Sufficient product knowledge to identify and load correctly. Proficiency with skid loader and forklift operation desirable but not required. CDL desirable but not required. Additional requirements for all positions: All Positions will require a valid class D or Commercial driver’s license. Ability to shift focus between departments as workload and labor needs dictate. Ability to communicate daily with co-workers, supervisors, and managers to perform needed tasks. Neatly and accurately complete written record keeping as required by the company and regulations. Ability to prioritize multiple tasks during peak workload times. Ability to lift a minimum of 55 pounds. Meet the physical and mental demands of working extended hours, repetitive heavy lifting, and climbing ladders to perform tasks at elevated or below-grade locations. Ability to understand and comply with state and federal regulations. Work efficiently while always keeping yourself and others safe. PART-TIME · MORRISTOWN, MINNESOTA Seasonal Agronomy Apply now", "grouping_count": 0}]