[{"id": 1089044605111129, "advertiser_name": "Trans Lines Inc.", "status": "Active", "date": "12/14/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT2D-GDqxDkdpPi4w1U6enyyfY58eQSrMJsF73OaGdriP46dJEfSI7n4WvJlZ9F6HXvzZSU3_aYkh8g1M9mOaxYgwPFaEBZePd9JnPcULel7P_PdoBOLZNrir6sBzs1b94MRtGetecWSDVhux6BC5VWCOmVpC-ClnPgtauAWPf0"], "image_save_path": [], "ad_text": "Trans Lines Inc. Sponsored If you’ve been riding the road for a few years now, you’ve seen “flash in the pan / get rich quick” offers from “Johnny-Come-Lately” truck lines come and go. Mostly they go, because they’re not based on a sound, long-term relationship – or a solid company with the facts to prove it. Chances are, you’ve seen a lot in this industry – so you can spot “the real deal” when it comes around. So keep reading, because this is no ordinary offer. And Trans Lines is no ordinary company. True professional drivers know that the only REAL opportunities in this industry are with well-established companies with long-term contracts with top shippers. You know, the kind that doesn’t put up with a lot of nonsense. REAL trucking companies truly DO their homework and only hire drivers who KNOW what they do, KNOW the types of equipment they like to pull, and KNOW the true value of a driver who can perform their duties with integrity, honor, and dedication to their team and their clients. At Trans Lines, these are the ONLY types of drivers we hire. And the drivers we DO end up selecting to work with us KNOW what they’re worth. And we PAY IT. In fact, we’re GLAD to pay it, because those are the quality drivers that will continue to provide for OUR success and client satisfaction. ONLY REAL PROFESSIONAL OWNER-OPERATORS NEED TO APPLY. Are you ready for a real opportunity with a legitimate top-of-the-line trucking company? Are you THROUGH driving for companies that can’t quite get their act together – and leave YOU holding the bag and taking the blame? If you’re ready for a REAL job pulling RELIABLE loads on CONSISTENT routes with QUALITY equipment and DEDICATED schedules, we need to talk. You’ll find that Trans Lines is the kind of company that you CAN do your due diligence on. Our success story is an open book, so ask around: get the details, talk to other drivers, and see if we’re the type of company you want to build a lifetime career around. We can throw down that challenge because we KNOW what you will find out about us. At Trans Lines, we ARE that kind of company. We’ve been growing our business since 2012 by providing reliable, accurate, and timely delivery of our client’s freight day after day, year after year. WE’RE BORING AND ROUTINE. AND WE LOVE IT. As the best Owner-Operators know, when push comes to shove, hauling freight for a rock-solid company like Trans Lines is a routine. The best freight lines keep their clients happy BECAUSE they’re pretty boring. They get the job done, they don’t ruffle any feathers, and they DON’T hire “New Kids on the Block” type of drivers. They hire experienced professionals who know what it takes to do the job right – and the drivers they hire ACTUALLY DO THE JOB – Accurately; Reliably; with NO NONSENSE on their part. Are YOU that type of driver? Do YOU get mad with amateurish dispatch personnel who don’t take THEIR job seriously? Do YOU wish that you had dedicated loads, dedicated routes, and a schedule you could set a clock to? Well, maybe… just maybe, you’re ready for a serious career driving for a serious company. You know, one like Trans Lines. We’re currently looking for top pro drivers to run dedicated routes in Midwest, East, and Southeast, (West coast loads are also available upon request.) Here are some of the “boring” details that don’t seem to matter to amateur drivers but mean a HECK OF A LOT to a true professional Owner-Operator: • Light Loads 35,000 lbs max • Primary lanes are GA, KS, OH, NY, NJ, PA, NC, SC, MS, FL • All loads pay at least $2.70 per mile • 22% from gross if company trailer is used (trailer maintenance, insurance, dispatching is included) • 12% from gross if you use your own truck and trailer • Equipment must pass DOT test and have a valid annual DOT inspection • Fuel cards with discounts provided • 24/7/365 Breakdown Service Telephone Line • Available subs in case your truck breaks down • Owners Gross up to $10k per week. • Trans Lines INC only works with Dry van trailers – no “surprise pulls” of overloaded flat-beds or Reefers with small-town routes through mountains and valleys on two-lane roads. • Trailers are also available for lease • Many dedicated contracts OTHER STUFF WE HANDLE THAT YOU WON’T HAVE TO WORRY ABOUT ANYMORE: • IFTA filings • NY, NM, OR, KY permits and licensing • Registration services • Heavy Highway Use Tax Filing • Repair Shop • Toll Pass (one device for all 48 states) • Weigh Station PrePass (All 48 states) SO WHO ARE TRANS-LINES REALLY? You’ll find that Trans Lines is satisfactorily rated by FMCSA. We have an ISS score of 47 (PASS on weigh stations) so you won’t get heckled over in weigh stations. What’s more, we implement the very highest safety standards to protect our drivers. We don’t “cut corners” or use old worn-out equipment like some other carriers. And yes – we will install dash and driver-facing cameras (no live streaming option, only harsh or G force events are recorded) in your truck at our expense (no drilling in dashboards or anywhere else, everything is plug-and-play). Our safety assurances give our clients confidence in our ability to get the job done correctly and safely. And again, while “ordinary /run-of-the-mill” drivers may not like them, true PROFESSIONAL career drivers will LOVE them. A real lifetime hauler will LOVE our safety standards because a TRUE professional has no interest in skirting the rules – or the law – at any time. Those games are for amateurs, not serious career drivers who know the value of their skills – and how to keep a good job for the long haul. ARE YOU READY TO JOIN A TRUCKING COMPANY THAT IS AS SERIOUS ABOUT ITS CRAFT AS YOU ARE? At this time, Trans Lines is looking for a few select drivers to join our team. We’re ONLY looking for safe and courteous drivers who “get” this industry and what it takes to perform consistently at the highest levels of performance. Sure, good drivers are in short supply. Everyone knows that. But the true professional drivers also know that a top company with top clients and a top dispatch team is the “real deal” and worth its weight in gold. BEST CLIENTS / BEST LOADS / BEST CONSISTENCY Our clients are among the top names in the business. They look to Trans Lines to handle overflow freight so they can provide exceptional service to THEIR customers. Sure, the spot market is tight. And yes, there are plenty of “one shot” deals that can really make your bank account fat. But here’s the REAL secret of taking a lot of these deals on an “onesy-twosie” basis: they won’t be around when things get slow in the off months. And THEN what will you do to earn steady cash? The real beauty of working for a company like Trans Lines is that we will continue to provide steady work for you ALL YEAR LONG. Our loads pay top dollar AND provide you with consistent loads year-round. We GET those reliable loads because we provide superior service to our customers. If you’re the type of driver who can provide superior service to the US, we need to talk. WHAT IT TAKES / DRIVER QUALIFICATIONS: Okay, let’s get down to brass tacks. MAJOR VIOLATIONS INCLUDE: 5 years with NO Major Violations 1-year CDL driving experience 3 years with no more than 2 traffic violations (any non-major violation showing on MVR) -or- 3 years with no more than 1 DOT reportable accident* 10 years with no DUIs for any driver if driver held CDL at the time of DUI (otherwise 5 years) Use of a vehicle for felonious purposes Leaving a scene of an accident (Hit & Run) or failure to stop and report an accident Reckless driving/Careless driving/Speed contest Driving while license is suspended or revoked Attempting to elude an officer of the law Speeding more than 20 mph of a posted speed limit For traffic violations (non-major) on MVR that are associated with an accident, we will only count the accident *Combination of violations/accidents cannot exceed more than 2 events in the last 3 years NO PROBLEMS? OKAY, HERE’S WHAT WE PROVIDE TO YOU: Let’s look at where the rubber meets the road. Big promises and lots of hype are worth exactly NOTHING when it’s you on the road at 3 am with a problem. And if you’re driving for Trans Lines, we’ve got your back and we’ll handle EVERYTHING on your behalf. So here’s what we offer to YOU: FREIGHT MANAGEMENT TEAM We know a thing or two about being on the road. That’s why EVERY MEMBER of our freight management team has either driven, owned or dispatched their own trucks. Because you can’t truly KNOW what’s needed in the field unless you’ve BEEN in the field. Imagine how much noise can be eliminated when every dispatcher you’ll deal with has ACTUALLY BEEN A DRIVER! EQUIPMENT We “get it.” Professional drivers spend a lot of time away from the comforts of home, so we want to PROVIDE many of those comforts to you on the road. And we want to make sure every trip is successful and as event-free as possible, so you can get back to the REAL comforts of your own home. That’s why we equip our trucks with some of the best features and technology in the industry. Plus, we perform all regularly-scheduled maintenance on-time (unlike some carriers who cut corners by delaying maintenance to save a few bucks. Who ends up paying the price in the long run? You, the driver.) Sure, stuff happens. And, in the event of an unforeseen issue on the road, we provide 24-hour roadside assistance at our expense. So take THAT one off your worry list. At Trans Lines, the safety, comfort and satisfaction of our drivers is our #1 priority. It’s how we keep our service records consistent and keep top clients coming back for more. And that’s the key to true performance and steady pay for YOU! SAFETY Safety isn’t a buzzword for us; we take it very seriously. That means taking care of our drivers and our trucks, on and off the road. With one of the best truck monitoring systems in the industry, our highly skilled safety managers offer personal hands-on training, logbook error elimination, and supervision of the logistics process during freight transportation. Red tape? Hardly. We “dot the I’s and cross the T’s” to keep you safe. And we provide training to keep you growing in your skill sets and increasing your value as a driver. It’s our “trifecta” of service performance: * Safe Trucks * Safe Drivers * Quality Work Environment ARE YOU READY TO JOIN A REAL TEAM OF PROFESSIONALS? At Trans Lines, we’re the “real deal.” And now – for a limited time and for a limited number of top-of-the-line Owner-Operators – we’re offering the “real deal” to YOU. We offer competitive pay, generous sign-on, and safety performance bonuses, travel across the continental U.S., weekly mileage, insurance coverage, experienced dispatchers, and more. We offer upward mobility for advancement based on your performance on the job. And that can include choice of top routes, top loads, top scheduling and more. And as time flies throughout the years, we offer our top performers the chance to advance into other driver positions or even home office company jobs. You REALLY DO rise in the “pecking order” when you drive for Trans Lines! Other companies may talk about “family,” but we actually TREAT YOU like family through scheduled reviews, ongoing “perks” and advancements in the business. You know, the types of things that REAL trucking companies offer REAL quality drivers. Like YOU. BUT WAIT – THERE’S MORE FOR COMPANY DRIVERS: As an Owner-Operator, you may value your independence. But consider becoming a COMPANY DRIVER for Trans Lines and you could enjoy these ADDITIONAL BENEFITS: Competitive Pay Health Insurance (Dental, Vision) 401(K) Match Annual Safety Performance Bonuses (up to $6,000) All Miles, Paid Detention, and Layover Paid Lease to Own Program Work/Life Balance Modern Trucks Equipment Rental Program Cash Advances Available 24/7/365 Roadside Assistance *Dry Van Loads Only STILL, VALUE YOUR INDEPENDENCE AS AN OWNER-OPERATOR? NO PROBLEM! YOU’LL STILL ENJOY THESE GREAT BENEFITS: Annual Safety Performance Bonuses (up to $6,000) No Forced Loads Industry-Leading Dispatchers 24-Hour Roadside Assistance Newer Trucks to Rent or Lease Lease to Own Programs Truck Sales Financing Breakdown Equipment House Rate Towing All 48 States Accepted READY TO “UPGRADE” YOUR CAREER AND SETTLE INTO THE “BORING” LIFE OF A PREDICTABLE PATH TO SUCCESS? One of the things that reliable and fast-growing companies do is evaluate WHAT makes us so successful. That’s why at Trans Lines, we’re constantly asking ourselves how we can keep our drivers happy. Maybe that’s a novel idea to the big freight lines, but not to us. You see, drivers are our most valuable commodity, the engine that keeps us trucking. Just like you, we “get it.” We’ve been behind the wheel of a big rig ourselves! We know the road can be a lonely place, and just know that your company has your back can make a BIG difference on how you view your job. You see after everything is said and done, trucking is no different than any other industry; happy drivers lead to happy customers. It’s not revolutionary; it’s just how we operate at Trans Lines. Do you have what it takes to be a valuable addition to our team? If you TRULY KNOW that you’re among the “best of the best” on the road today, we’d like to talk. Tap below to fill out a quick form, and we’ll put you in touch with one of our reps. We’re truckers just like you, so we can answer any question at all to help you decide if we’re right for you. Simply tap Apply below to send an inquiry. If this is the right time for you to upgrade your career path, we might just be a good fit for YOU! Attention Drivers! At least 12 Months of CDL experience is required! Applications with less than 12 months of experience will be rejected automatically.", "grouping_count": 2}, {"id": 546898267262776, "advertiser_name": "Trans Lines Inc.", "status": "Active", "date": "11/16/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT2D-GDqxDkdpPi4w1U6enyyfY58eQSrMJsF73OaGdriP46dJEfSI7n4WvJlZ9F6HXvzZSU3_aYkh8g1M9mOaxYgwPFaEBZePd9JnPcULel7P_PdoBOLZNrir6sBzs1b94MRtGetecWSDVhux6BC5VWCOmVpC-ClnPgtauAWPf0"], "image_save_path": ["546898267262776_00.jpg"], "ad_text": "Trans Lines Inc. Sponsored ATTENTION COMPANY DRIVERS: Congratulations on “figuring it out.” Since you’re already a company driver, you know all of the advantages that position entails vs. staying independent. There’s the guaranteed minimum income, the fixed schedule, fixed routes, consistent equipment, and loads. I could go on, but that is what is known as “preaching to the choir.” What you may NOT know is that all company driver positions are NOT the same! Some may give you the secure and steady employment you want, but do they give you the absolute ‘mother lode’ of benefits? Trans Lines is one of the nation’s top trucking firms with contracts with many of the very highest-ranked shippers in the nation… names you would recognize in a second. And currently, we’re looking to add a few VERY top-notch VERY reliable drivers to our team. Could you be one of them? Well, that depends on your track record and your history of successful driving. And if you’re confident that you’ll check out 110%, I’ll be glad to send you a complete list of the benefits, compensation, and additional incentives and perks of being a company driver for Trans Lines. The basics are shown before, but we have EVEN MORE incentives that we don’t post publicly. Why? Quite frankly, they’re SO GENEROUS and SO ABOVE industry standards that we would be covered over with applications from “so-so” drivers. But guess what? WE DON’T HIRE “so-so” drivers. We hire THE BEST. And if you already KNOW that you’re one of the best, we’d like to have a confidential chat. Chances are, you deserve more than what you’re getting now. Potentially, you deserve a WHOLE LOT MORE! To start with, we can help you enjoy a fixed schedule along the best routes, with the top-notch equipment you prefer to haul, a guaranteed minimum income, and the chance to earn a whole lot more through personal performance and service. And then there’s the peace of mind you’ll enjoy as a Company Driver for Trans lines: - Reliable at-home days & times - Direct-deposit paychecks like clockwork - Steady work and consistent routes Sometimes those benefits are worth more than a fat paycheck, especially if you’ve got kids at home. But now – you DON’T have to make sacrifices to enjoy them. In fact, you’ll be RELIEVED of the hassles of working the ever-changing spot market for loads. And FORGET about dead-heading; by pulling for Trans Lines you’re always compensated for every mile. Just look at these great benefits of being a Company Driver for Trans Lines: SOLO DRIVERS: - Up to 65 CPM - 1 CPM is added (up to 3 CPM) every 6 months based on performance (no moving or logbook violations, no tickets, being on time for pickups and deliveries (accidents and breakdowns taken into consideration) - 2 CPM are added if agree to lock the truck speed at 67 mph pedal and 65 mph cruise - $1,000 weekly pay minimum guaranteed (to qualify, the driver must be available to work at least 5 days of the week and his average pay for the current and previous week cannot exceed $1,200) TEAM DRIVERS: Base Pay: - Up to 72 CPM - 2 CPM are added if agree to lock the truck speed at 67 mph pedal and 65 mph cruise - $1,500 weekly pay minimum guaranteed per truck (to qualify, the driver must be available to work at least 5 days of the week and his average pay for the current and previous week cannot exceed $1,300) - 1 CPM is added (up to 3 CPM) every 6 months based on performance (no moving or logbook violations, no tickets, being on time for pickups and deliveries (accidents and breakdowns taken into consideration) Great CPM is one thing, but a driver’s first question is always the same: “How’s the equipment?” And that’s something we’re proud to discuss: EQUIPMENT - All trucks are 2018 and newer and very well maintained - Majority of trucks are Freightliner Cascadia’s and Kenworth T680s. We also run Mack’s and International LT’s. - All units have refrigerators, microwaves, and power invertors installed - 90% of the fleet trucks have APUs or optimized idling And then there’s the question of reliability. How much can you rely on Trans Lines to be there for you as a Company Driver? The key thing to know about us is that we’re not just a trucking company; we’re a trucker’s company. Each of us has been out there on the road, so we know what the struggles are – and how we can make life easier for you. What does that mean to you, the Company Driver? It means that EVERY MEMBER of our freight management team has either driven, owned, or dispatched their own trucks. We know that only another driver can truly KNOW what’s needed in the field since they’ve actually BEEN in the field. You’ll actually ENJOY interacting with our dispatchers because they know exactly where you’re coming from. In fact, hiring top-notch reliable drivers for our top management positions has been the key to our success story and always will be. We’re the type of company that drivers love to work for because we truly work as a finely-tuned machine. We’ve been growing our business since 2012 by providing reliable, accurate, and timely delivery of our client’s freight day after day, year after year. That’s the kind of proven performance that makes us great to work for. RELIABLE PROFESSIONAL DRIVERS ONLY. If you truly believe that you are the “best of the best”, it’s time to choose a REAL opportunity with a legitimate top-of-the-line trucking company. It’s time to say “YES” and become a Company Driver for Trans Lines. To review the complete list of benefits, compensation, and additional incentives and perks, just Tap below to fill out a quick form, and we’ll put you in touch with one of our reps to discuss your situation and how we can help. Sincerely, Trans Lines Team It’s time to enjoy the best years of your driving life, with all of the rewards and personal job satisfaction you’ve been looking for. It’s time for Trans Lines! Attention Drivers! At least 12 Months of CDL experience is required! Applications with less than 12 months of experience will be rejected automatically. Steady Work & Consistent Routes Apply Now", "grouping_count": 2}, {"id": 663916011960191, "advertiser_name": "Trans Lines Inc.", "status": "Active", "date": "11/16/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Ffb.me%2F&h=AT2D-GDqxDkdpPi4w1U6enyyfY58eQSrMJsF73OaGdriP46dJEfSI7n4WvJlZ9F6HXvzZSU3_aYkh8g1M9mOaxYgwPFaEBZePd9JnPcULel7P_PdoBOLZNrir6sBzs1b94MRtGetecWSDVhux6BC5VWCOmVpC-ClnPgtauAWPf0"], "image_save_path": [], "ad_text": "Trans Lines Inc. Sponsored ATTENTION COMPANY DRIVERS: Congratulations on “figuring it out.” Since you’re already a company driver, you know all of the advantages that position entails vs. staying independent. There’s the guaranteed minimum income, the fixed schedule, fixed routes, consistent equipment, and loads. I could go on, but that is what is known as “preaching to the choir.” What you may NOT know is that all company driver positions are NOT the same! Some may give you the secure and steady employment you want, but do they give you the absolute ‘mother lode’ of benefits? Trans Lines is one of the nation’s top trucking firms with contracts with many of the very highest-ranked shippers in the nation… names you would recognize in a second. And currently, we’re looking to add a few VERY top-notch VERY reliable drivers to our team. Could you be one of them? Well, that depends on your track record and your history of successful driving. And if you’re confident that you’ll check out 110%, I’ll be glad to send you a complete list of the benefits, compensation, and additional incentives and perks of being a company driver for Trans Lines. The basics are shown before, but we have EVEN MORE incentives that we don’t post publicly. Why? Quite frankly, they’re SO GENEROUS and SO ABOVE industry standards that we would be covered over with applications from “so-so” drivers. But guess what? WE DON’T HIRE “so-so” drivers. We hire THE BEST. And if you already KNOW that you’re one of the best, we’d like to have a confidential chat. Chances are, you deserve more than what you’re getting now. Potentially, you deserve a WHOLE LOT MORE! To start with, we can help you enjoy a fixed schedule along the best routes, with the top-notch equipment you prefer to haul, a guaranteed minimum income, and the chance to earn a whole lot more through personal performance and service. And then there’s the peace of mind you’ll enjoy as a Company Driver for Trans lines: - Reliable at-home days & times - Direct-deposit paychecks like clockwork - Steady work and consistent routes Sometimes those benefits are worth more than a fat paycheck, especially if you’ve got kids at home. But now – you DON’T have to make sacrifices to enjoy them. In fact, you’ll be RELIEVED of the hassles of working the ever-changing spot market for loads. And FORGET about dead-heading; by pulling for Trans Lines you’re always compensated for every mile. Just look at these great benefits of being a Company Driver for Trans Lines: SOLO DRIVERS: - Up to 65 CPM - 1 CPM is added (up to 3 CPM) every 6 months based on performance (no moving or logbook violations, no tickets, being on time for pickups and deliveries (accidents and breakdowns taken into consideration) - 2 CPM are added if agree to lock the truck speed at 67 mph pedal and 65 mph cruise - $1,000 weekly pay minimum guaranteed (to qualify, the driver must be available to work at least 5 days of the week and his average pay for the current and previous week cannot exceed $1,200) TEAM DRIVERS: Base Pay: - Up to 72 CPM - 2 CPM are added if agree to lock the truck speed at 67 mph pedal and 65 mph cruise - $1,500 weekly pay minimum guaranteed per truck (to qualify, the driver must be available to work at least 5 days of the week and his average pay for the current and previous week cannot exceed $1,300) - 1 CPM is added (up to 3 CPM) every 6 months based on performance (no moving or logbook violations, no tickets, being on time for pickups and deliveries (accidents and breakdowns taken into consideration) Great CPM is one thing, but a driver’s first question is always the same: “How’s the equipment?” And that’s something we’re proud to discuss: EQUIPMENT - All trucks are 2018 and newer and very well maintained - Majority of trucks are Freightliner Cascadia’s and Kenworth T680s. We also run Mack’s and International LT’s. - All units have refrigerators, microwaves, and power invertors installed - 90% of the fleet trucks have APUs or optimized idling And then there’s the question of reliability. How much can you rely on Trans Lines to be there for you as a Company Driver? The key thing to know about us is that we’re not just a trucking company; we’re a trucker’s company. Each of us has been out there on the road, so we know what the struggles are – and how we can make life easier for you. What does that mean to you, the Company Driver? It means that EVERY MEMBER of our freight management team has either driven, owned, or dispatched their own trucks. We know that only another driver can truly KNOW what’s needed in the field since they’ve actually BEEN in the field. You’ll actually ENJOY interacting with our dispatchers because they know exactly where you’re coming from. In fact, hiring top-notch reliable drivers for our top management positions has been the key to our success story and always will be. We’re the type of company that drivers love to work for because we truly work as a finely-tuned machine. We’ve been growing our business since 2012 by providing reliable, accurate, and timely delivery of our client’s freight day after day, year after year. That’s the kind of proven performance that makes us great to work for. RELIABLE PROFESSIONAL DRIVERS ONLY. If you truly believe that you are the “best of the best”, it’s time to choose a REAL opportunity with a legitimate top-of-the-line trucking company. It’s time to say “YES” and become a Company Driver for Trans Lines. To review the complete list of benefits, compensation, and additional incentives and perks, just Tap below to fill out a quick form, and we’ll put you in touch with one of our reps to discuss your situation and how we can help. Sincerely, Trans Lines Team It’s time to enjoy the best years of your driving life, with all of the rewards and personal job satisfaction you’ve been looking for. It’s time for Trans Lines! Attention Drivers! At least 12 Months of CDL experience is required! Applications with less than 12 months of experience will be rejected automatically. Steady Work & Consistent Routes Apply Now", "grouping_count": 2}]