[{"id": 709961933992478, "advertiser_name": "Bolton Logistics", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["709961933992478_00.jpg"], "ad_text": "Bolton Logistics Sponsored 🌐Start your Career today! 🚚🚛Delivery Freight Drivers 🚚🚛 Des Moines Full-time We are looking for responsible Delivery Drivers and Assistants to distribute products promptly to our customers. 💵💵💵💵💵💵💵💵💵💵💵💵💵 🌞This position starts at 8:00 a.m. and finishes around 4:00pm Monday thru Friday (end time depends on deliveries for the day). Rate of pay for this position is dependent on experience. We will train you if you’re willing to learn. Sign on BONUS available. 🚚 🚛 🚚 🚛 🚚 🚛 🚚 🚛 🚚 ☺️Load, unload, prepare, inspect, and operate a delivery vehicle. ⏰ Follow route and time schedule. Deliver a wide variety of items to our customers. 🚨Follow DOT regulations and safety standards. 💪Some light to moderate lifting required. Benefits package include Medical, Dental, Visionn, PTO and Retirement with 3% company match. 📞 Call 319-624-2086 option #4 for HR ☺️ FULL-TIME · DES MOINES, IOWA Delivery Driver Apply now", "grouping_count": 0}, {"id": 908092743652879, "advertiser_name": "Bolton Logistics", "status": "Active", "date": "01/25/2023", "ad_url": [], "image_save_path": ["908092743652879_00.jpg"], "ad_text": "Bolton Logistics Sponsored 🌐Start your career today. Only work 3 days a week! Weekends off! 5433 Tremont Ave Davenport, IA 52807 🚚 🚛 🚚 🚛 🚚 🚛 🚚 🚛 We are looking for responsible Delivery Line-haul Drivers to distribute products promptly to our customers. This is an early bird position that starts at 2:00 a.m. and finishes around 12:00pm. End time depends on deliveries and pickups for the day, typically 10-12 hour days. You’d be transferring auto parts, freight, and delivering mail bags to a few post offices. This route is completed in a straight truck and requires a Medical DOT card. Rate of pay for this position is dependent on your experience. Guaranteed full time hours. Benefits include Medical, Dental, Vision, PTO, and Retirement. 💵 💵 💵 💵 💵 💵 💵 💵 Responsibilities Load, unload, prepare, inspect, and operate a delivery vehicle. Follow route and time schedule. Deliver a wide variety of items to our customers. Follow DOT regulations and safety standards. Some light to moderate lifting required. 📞 Call us today to discuss this great opportunity! 319-624-2086. Opt #4 for HR 😊 FULL-TIME · DAVENPORT, IOWA Line Haul Driver Apply now", "grouping_count": 0}]