[{"id": 923592028658433, "advertiser_name": "Yost Farm", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["923592028658433_00.jpg"], "ad_text": "Yost Farm Sponsored Yost Farm, Inc., a multi generation ag business in West Central Minnesota is currently looking for someone to join our crew as a full time truck driver. Our Trucking segment supports the growing dairy industry in western Minnesota by providing safe and efficient transportation of feed ingredients and farm supplies. As a truck driver for Yost Farm, You will be: Operating late model Kenworth and Peterbilt tractors Pulling live bottom, hopper, walking floor, and step deck trailers. Performing light maintenance and pre/post trip inspections Delivering feed ingredients to modern dairy farms in West Central Minnesota. Filling out daily load sheets, pick up and delivery information, and daily inspection paperwork We Offer: Dedicated year round freight Flexible work schedule Competitive pay and benefit package Home every night Team Culture, Family Atmosphere If interested please contact Kevin @ 320-808-7713 or Mike @ 320-905-1216 FULL-TIME · MURDOCK, MINNESOTA Truck Driver Apply now", "grouping_count": 0}, {"id": 2342089432614729, "advertiser_name": "Yost Farm", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["2342089432614729_00.jpg"], "ad_text": "Yost Farm Sponsored Yost Farm Inc., a multi-generation ag business in West Central Minnesota, is currently looking for a highly organized and detail-oriented Office Manager to join our team. Responsibilities Include: Execute bookkeeping tasks: including receiving, coding and scanning bills, receipts and other financial documents. Manage data in farm management software system: including compiling and entering crop inputs and financial information, working with farm operators/managers to reconcile data inflow and monitoring grain/scale tickets during harvest and delivery periods. Collect and send employee hours to payroll. Assemble monthly invoicing for trucking fleet. Ideal But Not Required: Familiarity with basic accounting principles and practices. Ability to manage truck dispatching activities. We Offer: Competitive pay and benefit package. Team culture and family atmosphere. If interested, please contact Michael @ 202-494-0897 or Mike @ 320-905-1216 FULL-TIME · MURDOCK, MINNESOTA Office Manager Apply now", "grouping_count": 0}]