[{"id": 534154505149662, "advertiser_name": "Faithful Homes, LLC.", "status": "Active", "date": "01/03/2023", "ad_url": [], "image_save_path": ["534154505149662_00.jpg"], "ad_text": "Faithful Homes, LLC. Sponsored Faithful Homes is looking for qualified LPN candidates to support a young individual to live their best life. You will work in the home and have the opportunity to provide individualized 1:1 care and use your skills to allow the client to be a full member of their neighborhood and community. Responsibilities: Include providing direct one-on-one nursing services to client according to their individualized support plan (ISP), contributing to the development, implementation and evaluation of care plans, reporting and recording the patient’s condition and care, including signs and symptoms which may be indicative of change and preparing clinical progress notes on the day care is rendered, facilitating and supporting the client to participate in everyday activities, recreation and leisure and supporting the client to have choice, control and a great life! Qualifications: The ideal candidate will possess these qualifications: • LPN license required (individualized on the job training will be provided) • Ability to work together as a team with other nurses. • Ability to communicate clearly in writing and orally • Ability to both follow prescribed care plans and orders. • Initiate and facilitate community activities; as well as initiate tasks independently. • Interest in supporting individual to be a part of their community. Client is in need of LPN level care, including: o Tube Feeding o Medication administration o Assessment of vitals/status o The ability to implement care plans/protocols based upon assessment o Supporting the use of supplemental oxygen, routine suctioning, bipap and transfer lift as required by the individuals needs. Hiring Needs: • Every other weekend 7a-7p • PRN/occasional shifts (as available) Benefits: • On the job PAID individualized training will be provided to ensure competency and a successful working environment for both the individual in supports as well as the LPN. • The ability to work in a safe home/community environment with one client • Working with a strong, dedicated group of nurses and natural supports • $34/hour; pay differential offered for weekend shifts • Health Insurance available for qualified candidates. *Faithful Homes is an Equal Opportunity Employer* FULL-TIME · $34 / HOUR · MANHEIM, PENNSYLVANIA Licensed Practical Nurse Apply now", "grouping_count": 0}, {"id": 551543106890855, "advertiser_name": "Faithful Homes, LLC.", "status": "Active", "date": "01/03/2023", "ad_url": [], "image_save_path": ["551543106890855_00.jpg"], "ad_text": "Faithful Homes, LLC. Sponsored Faithful Homes, LLC. is looking for qualified DSP (Direct Support Professional) candidates in LANCASTER COUNTY, PA who are motivated to make a difference in the lives of individuals with intellectual disabilities (IDD) whom are residing in their own homes. DSP’s are responsible for providing the day to day care of the people they support within the residential programs as well as working with them to exercise their choice and control over their own lives. Paid training offered!! Responsibilities: • Providing direct care to individual(s) according to their individualized support plans (ISPs). • Assist individuals in the development of appropriate life skills, necessary to reach their highest potential. • Contributing to the development, implementation and evaluation of ISPs by engaging in household meetings, communication with the house manager, and the rest of the ISP team. • Facilitating and supporting the individual(s) to participate in everyday activities, recreation and leisure. • Working with the individual(s) and supporting them to have choice and control in their lives through the practice of person-centered thinking. • Medication administration • Completion of daily documentation • Transportation to/from outings and medical appointments. • Fostering relationships in the community as well as maintaining relationships • Completion of initial 40 hours of training and annual trainings thereafter. Qualifications: The ideal candidate will possess these qualifications: • Education- High School Diploma or GED • Age- 18 years or older • Ability to drive- valid PA Driver’s License • Completion of Background checks as outlined per state regulations • Health-Certification from a licensed independent practitioner that the candidate is free from communicable disease. Hiring Needs: Full-Time First Shift 7a-3p Full-Time Second Shift 3p-11p Part-time and PRN positions available as well!!! Benefits: • On the job PAID individualized training will be provided to ensure competency and a successful working environment for the individual(s) and the candidate. • Opportunities for advancement. • The ability to work in a safe home/community environment with intimate staffing to individual ratios. • Working with a strong, dedicated management team and fellow DSP’s who are trained in person centered practices. • Health/Dental Insurance plans offered to qualified candidates. • Paid time off offered to qualified candidates. *Faithful Homes is an Equal Opportunity Employer* FULL-TIME · MANHEIM, PENNSYLVANIA Direct Support Professional Apply now", "grouping_count": 0}]