[{"id": 867499504323506, "advertiser_name": "WSi Healthcare Personnel", "status": "Active", "date": "01/27/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.wsijobs.com%2Fjb%2FFull-Time-Family-Practice-Medical-Assistant-Jobs-in-Colorado-Springs-CO%2F8289570&h=AT3t4Bs5mCIU6oJCuxY6uo01WRTMWRtRBc-0ee8XID9C8AnN6M8tm2hdmuqaNd6oJ1F2PA_DLv2CKAP5_PPgXE1Ac0MCg_HkWhHqvk2w0w7JbIA-Ym4cAXstKZXImbTwsjQ3gBKicYbLh3nn0wRtz_L1bEzz3AaLZ9KPeNeC6yc"], "image_save_path": ["867499504323506_00.jpg"], "ad_text": "WSi Healthcare Personnel Sponsored **Experienced Family Practice Medical Assistant Opportunity** Want a career that you love and work in a family atmosphere? Are you looking for a career in medical assisting where you love to go to work and want to work in a family atmosphere? Do you build relationships with your patients and enjoy spending time getting to know them and their families? This medical assistant opportunity is for you! Apply now - https://jobs.wsijobs.com/jb/Full-Time-Family-Practice-Medical-Assistant-Jobs-in-Colorado-Springs-CO/8289570 Located in beautiful Northern Colorado Springs a local family care practice is looking for an easy-going, joyful, medical assistant to join their growing practice. Colorado Springs, CO 80918 Posted: 01/27/2023 Job Types: Temp To Perm Category: Medical Assistant Job Number: 740050 Pay Rate: $17-20 DOE Position / Certification: Med Assist Specialty: Family Practice State / Search: Colorado You will be responsible for the following duties: - Pre-authorizations - Injections - Blood draws - Rooming patients - Checking vitals - Assisting with in-office procedures - Scheduling - RX refills. - Other Medical Assisting duties as needed What is in it for you? - 36-hour work week full-time schedule, the half-day once a week - No Weekends or holidays - $17-20 per hour DOE - Benefits included Health, Vision, Dental, - Paid time off, and Sick time included. In-house training provided - $250 Referral Bonus is included when you refer a candidate to WSi Healthcare after they have completed 40 hours on our payroll. Job Requirements - Prior-Authorization experience - Scheduling appointments - Back and Front office experience - Injections and Phlebotomy experience - Rooming Patients - Taking vitals About WSi Healthcare Personnel We were recently awarded by ClearlyRated for ‘Best in Staffing for Clients’ in 2021 and ‘Best in Staffing for Talent’ in 2021. WSi has been committed to providing complete job placement services in healthcare to the western region since 1988 while providing the best for both our candidates and clients. Due to the outstanding placement services, pay rates, and opportunities, healthcare professionals trust their careers to WSi. Contact WSi Healthcare Personnel today for more information on how you can join our esteemed team of healthcare professionals. Referral Bonus Program Even if you are not currently needing assistance, if you know of other qualified healthcare workers seeking employment opportunities please pass on my contact information. Once they become active and have worked at least 40 hours on our payroll, we will send you a $250 referral bonus. There is no limit to the number of people you can refer. FULL-TIME · $20 / HOUR · GREENWOOD VILLAGE, COLORADO Full Time Family Practice Medical Assistant | Colorado Springs, CO Apply now", "grouping_count": 0}, {"id": 3417381998584143, "advertiser_name": "WSi Healthcare Personnel", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.wsijobs.com%2Fjb%2FFamily-Practice-Medical-Assistant-MA-Jobs-in-Aurora-CO%2F8916011&h=AT2f7NYS6nyNW06syi8khy8VNBoqpCu_sfs6Jwn4GH3K28qWF2PlP9BAqERvpWYI0-0rXq10-khwKVTeIcnN01OuvJUg8a9_9z6ijBfL516fulHR24a_sAKzZMmJqOPSxqwBJkymP0aeUEIdNHNRh4tP0S9J-y5B4jsWjv0ArII"], "image_save_path": ["3417381998584143_00.jpg"], "ad_text": "WSi Healthcare Personnel Sponsored We are looking for a compassionate Medical Assistant looking to work with a highly-trained team of physicians here in Aurora, CO! This Family Practice is not only dedicated to providing comprehensive care for families; they are also dedicated to providing a career trajectory for their MA's. Apply now if you are looking for a positive work environment and a rewarding career as a Family Practice Medical Assistant! Apply now - https://jobs.wsijobs.com/jb/Family-Practice-Medical-Assistant-MA-Jobs-in-Aurora-CO/8916011 Aurora, CO 80012 Posted: 01/23/2023 Job Types: Direct Hire Category: Medical Assistant Job Number: 747175 Pay Rate: $21-$23/hr. DOE Position / Certification: Med Assist Specialty: Family Practice State / Search: Colorado Pay: $21-$23/ hour Schedule: M-F: 8:00 am - 5 pm Benefits: - Medical/ Dental - Short-term and Life - PTO - MA Job Duties: Injections - Blood Draws - Gather patient history - Vitals - Point-of-care testing - Manage Inbox - Training - Medical Assistant What's in it for you? Great Benefit's! - Assistance with certification! - Room for growth! - Referral bonus- $250 for you and $250 for them!! - If you want a long-term, rewarding career then this is the perfect MA position for you! Job Requirements - Must have be a Medical Assistant with a diploma - Must have six (6) months of recent experience as a Medical Assistant. - Must have two (2) great manager or supervisor references. - Must have EMR experience. - Able to pass a background check and drug screen. - Must have a current American Heart Association-approved CPR Healthcare Provider Card. - COVID Vaccinated - Must have proof of current TB placed within the past 12 months. About WSi Healthcare Personnel Since 1988, WSi Healthcare Personnel, Inc. has been committed to providing complete job placement services to the Western Region. Recently voted one of the 10 most dependable staffing agencies in the region, we push the boundaries of what a healthcare staffing company can offer its candidates and clients. Healthcare professionals trust their careers with WSi Healthcare Personnel. Our professionals are the most loyal because of WSi’s outstanding placement services, pay rates and opportunities. Whether you need a full time position, part time or temporary opportunity, contact WSi Healthcare Personnel today for more information on how you can join our esteemed team of healthcare professionals. Referral Bonus Program Even if you are not currently needing assistance, if you know of other qualified healthcare workers seeking employment opportunities please pass on my contact information. Once they become active and have worked at least 40 hours on our payroll, we will send you a $250 referral bonus and they will get $250 as well. There is no limit to the number of people you can refer! FULL-TIME · $23 / HOUR · GREENWOOD VILLAGE, COLORADO Family Practice - Medical Assistant (MA) Apply now", "grouping_count": 0}, {"id": 495189079356192, "advertiser_name": "WSi Healthcare Personnel", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.wsijobs.com%2Fjb%2FPRN-Occupational-Therapist-OTR-Jobs-in-Denver-CO%2F7502240&h=AT2YkxCcC9sogAyDSOCYkRnwEKYHneN6_qrriiyxufwtp8Ipl3aW5M6A_DqNum7NI4_9TXodBMk6zTiaDrGq36Ps1CP7k67gpeXfCw7WzpmYmGnmmpbUHJPei-zqPL4pBWgv2ax7Zo_TFLMXlZbnVBf-agxDzWT6C87pfeqmV9o"], "image_save_path": ["495189079356192_00.jpg"], "ad_text": "WSi Healthcare Personnel Sponsored PRN Occupational Therapist? Want to get paid weekly? Apply now! We are looking for an energetic and caring PRN Occupational Therapist (OTR) that would like the chance to work for well-known practices across Colorado. In this exciting new role, you will have the opportunity to work alongside some of the best therapists in Colorado. No minimum hours to work, and the clients are flexible with schedules. Still, you will also be able to utilize your skills in numerous different settings. Apply today - https://jobs.wsijobs.com/jb/PRN-Occupational-Therapist-OTR-Jobs-in-Denver-CO/7502240 Your primary responsibilities would include, but are not limited to: - Develop and implement individualized therapy programs designed to restore, reinforce and enhance performance. - Identify and treat patients for whom therapy is medically necessary and document the need. - Make referrals to other disciplines to address the comprehensive needs of the patient. - Instruct, educate and train patients and caregivers in the skills and functions essential for promoting patient independence and productivity in order to diminish or correct pathology What does WSi have to offer you? - Dental/Vision Insurance - Health Insurance - Short-Term Disability - Long-Term Disability - $250 Referral Bonus for you and $250 for the person you refer (upon working 40 hours)! - Weekly Paycheck! Job Requirements - Current Colorado License in Occupational Therapy (OTR) - Current BLS certification - Ability to successfully pass a background check - Ability to successfully pass a drug screen About WSi Healthcare Personnel We were recently awarded by ClearlyRated for ‘Best in Staffing for Clients’ in 2021 and ‘Best in Staffing for Talent’ in 2021. WSi has been committed to providing complete job placement services in healthcare to the western region since 1988 while providing the best for both our candidates and clients. Due to the outstanding placement services, pay rates, and opportunities, healthcare professionals trust their careers to WSi. Contact WSi Healthcare Personnel today for more information on how you can join our esteemed team of healthcare professionals. Referral Bonus Program Even if you are not currently needing assistance, if you know of other qualified healthcare workers seeking employment opportunities please pass on my contact information. Once they become active and have worked at least 40 hours on our payroll, we will send you a $250 referral bonus. There is no limit to the number of people you can refer. FULL-TIME · $45 / HOUR · GREENWOOD VILLAGE, COLORADO PRN Occupational Therapist (OTR) Apply now", "grouping_count": 0}, {"id": 542100227869194, "advertiser_name": "WSi Healthcare Personnel", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.wsijobs.com%2Fjb%2FCertified-Nursing-Assistant-CNA-Create-Your-Schedule-Jobs-in-Denver-CO%2F8855466&h=AT15vgYzirUcRDCzAZZccJIUseYYeWJQYzY8GLE3K3MAfpBAUjfBQq_STwAawHOnRelIeWM_HxLf9gLBV8lHKjl0cXe1WkOA8et1HIxT6nOdTkGW1yRWwcPqUUS0Zbk4e_clmptVCIxBf6cczQszP7rjCVeTWyVySNjzkultFC0"], "image_save_path": ["542100227869194_00.jpg"], "ad_text": "WSi Healthcare Personnel Sponsored Denver, CO 80230 Posted: 01/13/2023 Job Types: Contract, PT, FT, PRN Category: Nursing Job Number: 741957 Pay Rate: $21-25+ Position / Certification: CNA Specialty: State / Search: Colorado Job Description We are looking for an enthusiastic, dependable Certified Nursing Assistant (CNA) to support various locations in the Denver Metro area. You are extremely vital for the care of patients in their time of need. The perfect individual for this position enjoys working with people and can easily manage multiple tasks with ease and expertise. Apply now - https://jobs.wsijobs.com/jb/Certified-Nursing-Assistant-CNA-Create-Your-Schedule-Jobs-in-Denver-CO/8855466 Benefits: - Various schedules offering PRN, Part-Time or Full-Time Opportunities - Flexible scheduling with days, evenings, and nights available - Competitive weekly pay - Overtime, bonuses, sick pay, and holiday pay available - Insurance benefits are open to employees working 30+ hours a week - Ability to travel locally and work with various locations throughout Colorado - Employee incentive bonuses and company swag! - Opportunity to build meaningful relationships with others - Referral bonuses! Responsibilities: - Assist with patient care under the direction of the nursing staff - Aid patients with their needs - Provide up-to-date information to nurses regarding patient conditions - Build strong rapport with patients and co-workers - Maintain a clean, healthy environment - Continue to show a professional, can-do attitude Requirements: - Active Colorado State CNA license - Must be 18 years or older - Up-to-date BLS CPR Certification (must include in-person testing on a mannequin) - Must be able to pass a background check and drug screen - Ability to work well in teams and individually - Reliable and hard-working Please Note: Although it is not required to be an employee of WSi Healthcare, most of our Healthcare clients require all new and returning candidates to be COVID vaccinated or have proof of an exemption. About WSi Healthcare Personnel We were recently awarded by ClearlyRated for ‘Best in Staffing for Clients’ in 2021 and ‘Best in Staffing for Talent’ in 2021. WSi has been committed to providing complete job placement services in healthcare to the western region since 1988 while providing the best for both our candidates and clients. Due to the outstanding placement services, pay rates, and opportunities, healthcare professionals trust their careers to WSi. Contact WSi Healthcare Personnel today for more information on how you can join our esteemed team of healthcare professionals. Referral Bonus Program Even if you are not currently needing assistance, if you know of other qualified healthcare workers seeking employment opportunities please pass on my contact information. Once they become active and have worked at least 40 hours on our payroll, we will send you a $250 referral bonus. There is no limit to the number of people you can refer. FULL-TIME · $25 / HOUR · GREENWOOD VILLAGE, COLORADO Certified Nursing Assistant (CNA) - Create Your Schedule! Apply now", "grouping_count": 0}, {"id": 585698886732719, "advertiser_name": "WSi Healthcare Personnel", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.wsijobs.com%2Fjb%2FRadiology-Technician-C-Arm-Pain-Jobs-in-Denver-CO%2F8868184&h=AT2ROJqY-R-K5nczOu6eAhdiEp11I6PMDLzdIkPeppOlpDyYEYPdXA5ACgspDEKkpIgQ-IKpyWVexdV2DTnf8qSs0ULkqOgmon02nUO9F6OcwJp_V4CTM6ywMW7UadPdVrURzzlbKlG9XJZzN3BhPXw2bGF_uqOCsOewelopn5k"], "image_save_path": ["585698886732719_00.jpg"], "ad_text": "WSi Healthcare Personnel Sponsored WSi Healthcare Personnel partners with the top surgery centers in the Denver Metro area, and they are in need of Radiology Technicians who are skilled in pain management, C-Arm, and OR procedures. Apply today - https://jobs.wsijobs.com/jb/Radiology-Technician-C-Arm-Pain-Jobs-in-Denver-CO/8868184 This is a PRN (As Needed) role so days and hours vary based on the surgery center's demands. If you are looking to pick up shifts and earn $34-$40/hr (based on experience), then this is a great opportunity for you. **If you're interested in picking up shifts during the week and earning extra income, please contact Vince at (719)-314-2309 or email me at vincel@wsijobs.com** Denver, CO 80208 Posted: 01/16/2023 Job Types: PRN Category: Imaging (Radiology) Job Number: 033123 Pay Rate: $34-$40 DOE Position / Certification: Rad Tech Specialty: Pain/ OR/ X-ray/ Ortho State / Search: Colorado Job Requirements - Must be able to pass a drug screen - Clean background check - Appropriate accreditation from a radiology program - BLS/CPR Certified - Covid Vaccinated About WSi Healthcare Personnel We were recently awarded by ClearlyRated for ‘Best in Staffing for Clients’ in 2021 and ‘Best in Staffing for Talent’ in 2021. WSi has been committed to providing complete job placement services in healthcare to the western region since 1988 while providing the best for both our candidates and clients. Due to the outstanding placement services, pay rates, and opportunities, healthcare professionals trust their careers to WSi. Contact WSi Healthcare Personnel today for more information on how you can join our esteemed team of healthcare professionals. Referral Bonus Program Even if you are not currently needing assistance, if you know of other qualified healthcare workers seeking employment opportunities please pass on my contact information. Once they become active and have worked at least 40 hours on our payroll, we will send you a $250 referral bonus. There is no limit to the number of people you can refer. FULL-TIME · $40 / HOUR · GREENWOOD VILLAGE, COLORADO Radiology Technician (C Arm/Pain) Apply now", "grouping_count": 0}, {"id": 1557657048066757, "advertiser_name": "WSi Healthcare Personnel", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.wsijobs.com%2Fjb%2FOrthopedic&h=AT1kXjAiA0bqyoS65SCHjJm12QACGcXMiwKtnMu-6hUAg5I77sbeOc8Vqq1Ay8AE_9MjovCq_GId4ujlqPrvZzGDHBEtqYgNy2W_Ie6HKBz89kbvRLOa-8rcqDJBEiCEISUYgCigEHwr8LT58nP-CfxtzvPbkY-j_Xdjt_QHKIE"], "image_save_path": ["1557657048066757_00.jpg"], "ad_text": "WSi Healthcare Personnel Sponsored If you are a passionate, reliable, and experienced Medical Assistant looking for a hands-on, state-of-the-art Orthopedics facility then this is a great opportunity for you! As a Medical Assistant, you will work alongside a team of experts dedicated to improving the lives of their patients with innovative treatments. Apply today if you are looking for a rewarding career as an MA! Apply now - https://jobs.wsijobs.com/jb/Orthopedic -Medical-Assistant-Jobs-in-Denver-CO/8900689 Location: Denver, CO Pay/Benefits: $18-24/ hour Health insurance PTO Hours: M-F 8a - 5p - No Weekends! Unlimited $250 referral bonus! Job Duties: - Provide and coordinate patient care - Blood draws - Assisting in minor procedures - Documents appropriately - Taking Vitals - EMR - Sterilization and maintenance of equipment - Apply now if you are an MA looking for a rewarding career providing growth and stability!!! Job Requirements - Must have a Medical Assistant diploma OR certification. - Must have recent experience as a Medical Assistant. - Must have two (2) great manager or supervisor references. - Able to pass a background check and drug screen. - Must have a current American Heart - Association-approved CPR Health care Provider Card. - Must have proof of current TB placed within the past 12 months. - Proof of current Covid Vaccine About WSi Healthcare Personnel We were recently awarded ‘Best in Staffing for Talent’ by ClearlyRated in 2020, WSi has been committed to providing complete job placement services in healthcare to the western region since 1988 while providing the best for both our candidates and clients. Due to the outstanding placement services, pay rates, and opportunities, healthcare professionals trust their careers to WSi. Contact WSi Healthcare Personnel today for more information on how you can join our esteemed team of healthcare professionals. Referral Bonus Program Even if you are not currently needing assistance, if you know of other qualified healthcare workers seeking employment opportunities please pass on my contact information. Once they become active and have worked at least 40 hours on our payroll, we will send you a $250 referral bonus. There is no limit to the number of people you can refer. FULL-TIME · $24 / HOUR · GREENWOOD VILLAGE, COLORADO Orthopedic Medical Assistant Apply now", "grouping_count": 0}, {"id": 741555293787103, "advertiser_name": "WSi Healthcare Personnel", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.wsijobs.com%2Fjb%2FCertified-Nurse-Assistant-CNA-Flexible-Schedule-Jobs-in-Fort-Collins-CO%2F8900577&h=AT3jzc0mMIIrBBUtwSudggvv-z1RZzg0jC0W1XwI9YNiqWGhAYlcn9PgI_qY5jc5_gaD9NI3HqLhxeQNXiGddi7HLNJTen4xWKTyaRD_mX1b0qqhsPKMP7sul2ZKUb-dVK27Tlw2Vd1q7uziV3LRcf71wwgstSZMMrlpIoa9f1Q"], "image_save_path": ["741555293787103_00.jpg"], "ad_text": "WSi Healthcare Personnel Sponsored WSi Healthcare is looking for friendly, experienced Certified Nurse Assistants (CNA) to support various clients in Fort Collins and surrounding areas. We are looking for CNAs with experience in LTC, rehab, skilled nursing, or home health. The right individual for this role will have great compassion and people skills, with the capacity to easily manage multiple tasks with ease. Apply today - https://jobs.wsijobs.com/jb/Certified-Nurse-Assistant-CNA-Flexible-Schedule-Jobs-in-Fort-Collins-CO/8900577 This is a local position only and is NOT a travel CNA position Fort Collins, CO 80524 Posted: 01/20/2023 Job Types: PRN or Block booking Category: Nursing Job Number: 745314 Pay Rate: $21-$25+ Position / Certification: CNA Specialty: State / Search: Colorado Benefits: - Flexible schedules offering part-time, full-time, and PRN opportunities - $250 employee referral bonus - Ability to try different facilities and gain experience - Complete flexibility over your schedule, with every shift time available - Build your own schedule - Weekly Pay - Overtime, bonus, and holiday pay - Friendly, understanding staff - Opportunity for shift bonuses Responsibilities: - Provide patient care under the direction of the nursing staff. - Assist patients with daily Living and activities with a positive attitude. - Build strong rapport with patients and co-workers. - Give primary health care and maintain a healthy environment. Requirements: **Please Read Before Applying** - Colorado State CNA license - Current CPR certification (BLS)- Your CPR MUST be a BLS and not just an online CPR card - Although WSi does not require the COVID vaccination, the facilities we support require the vaccine. Please be able to provide documentation of COVID vaccination. - Must be able to pass a background check and drug screen. - Ability to work well in teams and individually - Dependable and accountable - Reliable transportation - Previous CNA or Caregiving experience Additional Information About WSi Healthcare Personnel We were recently awarded by ClearlyRated for ‘Best in Staffing for Clients’ in 2021 and ‘Best in Staffing for Talent’ in 2021. WSi has been committed to providing complete job placement services in healthcare to the western region since 1988 while providing the best for both our candidates and clients. Due to the outstanding placement services, pay rates, and opportunities, healthcare professionals trust their careers to WSi. Contact WSi Healthcare Personnel today for more information on how you can join our esteemed team of healthcare professionals. Referral Bonus Program Even if you are not currently needing assistance, if you know of other qualified healthcare workers seeking employment opportunities please pass on my contact information. Once they become active and have worked at least 40 hours on our payroll, we will send you a $250 referral bonus. There is no limit to the number of people you can refer. FULL-TIME · $25 / HOUR · GREENWOOD VILLAGE, COLORADO Certified Nurse Assistant (CNA) - Flexible Schedule | Fort Collins, CO Apply now", "grouping_count": 0}, {"id": 712832190559149, "advertiser_name": "WSi Healthcare Personnel", "status": "Active", "date": "01/23/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fjobs.wsijobs.com%2Fjb%2FPrior-Authorization-Specialist-Medications-Colorado-Only-Jobs-in-Cherry-Hills-Village-CO%2F8910337&h=AT37zaLeegxc6fxEHfaYlaXOi_k1oMA7oGsWTnmgVYlMhag94ssikpYVepEVgP5SEdm-yO6Ghw_Mf-37_WXIt_SYC1RHhL4Pg1vBRZfbiFMYUF5NPUYCrtjW2UJ0hmfNMMi5qk0Pw6Ab-E9nxnf-_tQNWilVVYeaHYT_uDfX6vc"], "image_save_path": ["712832190559149_00.jpg"], "ad_text": "WSi Healthcare Personnel Sponsored **100% PAID MEDICAL INSURANCE** We are seeking an extraordinary Prior Authorization Specialist for Medications!We are looking to hire an experienced Prior Authorization Specialist for our team. We pay 100% of your Medical Benefits - join our team today! This opportunity will be in charge of obtaining Authorization for various inflammation-reducing medications. Apply now - https://jobs.wsijobs.com/jb/Prior-Authorization-Specialist-Medications-Colorado-Only-Jobs-in-Cherry-Hills-Village-CO/8910337 Our office has multiple locations but you will be stationed in our main office near Swedish Hospital. The ideal person will be compassionate, helpful, and highly patient with our valuable customers. Job functions include but are not limited to obtaining prior authorizations, working on Documentation for billing those authorizations, and assisting with various patient-related questions pertaining to those insurance authorizations. Cherry Hills Village, CO 80113 Posted: 01/22/2023 Job Types: Direct Hire Category: Medical Administration Job Number: 965512 Pay Rate: $21-22/hour DOE Position / Certification: Med Admin Specialty: Rheumatology State / Search: Colorado Free Medical - Dental - Vision - 401K - Paid Holidays - PTO and all the bells and whistles! - Apply today, and start next week! Job Requirements - Must have six (6) months of recent experience in Medical - Must have two (2) great manager or supervisor references. - Must have EMR experience. - Must have proof of current TB placed within the past 12 months. About WSi Healthcare Personnel We were recently awarded ‘Best in Staffing for Talent’ by ClearlyRated in 2019, WSi has been committed to providing complete job placement services in healthcare to the western region since 1988 while providing the best for both our candidates and clients. Due to the outstanding placement services, pay rates, and opportunities, healthcare professionals trust their careers to WSi. If you’re in need of a full-time or part-time position, or a temporary opportunity, contact WSi Healthcare Personnel today for more information on how you can join our esteemed team of healthcare professionals. Referral Bonus Program Even if you are not currently needing assistance, if you know of other qualified healthcare workers seeking employment opportunities please pass on my contact information. Once they become active and have worked at least 40 hours on our payroll, we will send you a $100 referral bonus. There is no limit to the number of people you can refer! FULL-TIME · $22 / HOUR · GREENWOOD VILLAGE, COLORADO Prior Authorization Specialist - Medications | Colorado Only Apply now", "grouping_count": 0}]