[{"id": 492212089770571, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fn%2Fravvd%3Fls%3D3162&h=AT3rg6be9BUq1O4pcu0GC0RyiptBFXude3NFXuSfzpgd3QEw6K89HUDM3X8qPEy8JjrgQaUuT-D55f2Dz5OsqbQdJRXCL4rv0DTIUytWAalS4wOnJ9a__3oJOBWFogHS5oOhJR9q-_f09pSI8AZcSEwjE5RuQOgY3WEyBwZ86mI"], "image_save_path": ["492212089770571_00.jpg"], "ad_text": "HandledNow LLC Sponsored Are you an experienced welder/fabricator looking for a company motivated by growth but still treats its employees like family? We are looking for the right individuals to fill a full-time Welder/Fabricator position, with experience welding stairs, in Indianapolis, IN. Schedule - Monday to Thursday, 6:00 am to 4:30 pm. Potential 8 hours on Friday and volunteer overtime offered on the weekend. Bonus - $250 bonus is offered if you have perfect attendance during the first 2 weeks. Interested in applying please click here, http://www.driver-reach.com/n/ravvd?ls=3162 Have questions? Give us a call at 866-217-5630 Job Description: Following all safety and environmental rules, regulations, and procedures as set forth by company policies and OSHA Operating and monitoring all equipment and production area safely and efficiently. Ability to utilize various equipment and tools in order to accurately position, align, fit and weld steel pieces together to form each unit and submit. Ensure accuracy in welding by measuring and marking each piece to account for stock thickness, as well as machine and welding shrinkage. Using fabrication drawings to complete the fabrication of the job correctly Coordinate with coworkers and supervisors to effectively organize, plan and prioritize and make decisions regarding client project work. Utilize various mechanized vehicles or devices to move project pieces, large and small in size, throughout the fabrication workshop Ability to help out in other areas of the warehouse when help is needed. Job Requirements: Safety Focused Ability to read and analyze customer drawings Must have a minimum of 2 years of welding experience Must be capable of working with different types of steel projects, from small detailed parts to large-scale structural pieces. Ability to perform rigorous physical activities in all weather conditions Self-motivated with a solid work ethic 1-2 years of experience in a manufacturing or warehouse environment A High School degree or GED is preferred Must be able to read and write English and calculate mathematical equations at approximately a 9th-grade level. Must be able to read and use a tape measure Must be able to communicate orally effectively and professionally Steel fabrication or industry experience is strongly preferred Attention to detail and strong organizational skills Must be able to communicate and work successfully as part of a team Ability to perform all essential functions Must wear protective equipment such as a welding shield, safety glasses, face shield, gloves, welding sleeves, welding aprons, hearing protection, and steel-toed boots. Ability to work in an environment exposed to the elements and work in a building with various temperatures, dirt, and dust. Must also be able to work in an environment that is loud. Areas of the work environment include moving conveyor belts. Be able to stand on your feet during the entire workday. Must also be able to walk, climb stairs, and occasionally use ladders and scaffolding. Use hands to finger, handle or feel objects, tools, or controls. Reach with hands and arms. Be able to balance, stoop, kneel, crouch or crawl, talk or hear. Ability to lift 10 LBS to 100 LBS daily. Ability to operate motor vehicles, including trucks, forklifts, and overhead cranes. Ability to use a large variety of hand and power tools, including but not limited to grinders, hammers, sledgehammers, hand torches, jacks, wedges, turnbuckles, and drill presses. *HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. Job Type: Full-time Pay: From $18.00 per hour Shift: 10 hour shift Day shift Weekly day range: Monday to Friday Ability to commute/relocate: Indianapolis, IN: Reliably commute or planning to relocate before starting work (Required) Experience: Welding: 2 years (Preferred) Work Location: One location FULL-TIME · $18 / HOUR · INDIANAPOLIS, INDIANA Experienced Welder with Stairs Experience -1st shift Apply now", "grouping_count": 0}, {"id": 679954203871616, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fn%2F44sn9%3Fls%3D3162&h=AT3gXvDnXck4MfcfjVXNU3CKfGZOi1lQJb2ZCuSK5IAUrZn78IKb7nFBEN1OmXcOXH7sBxqcO6MTLH17B6gg9CB4bLap9_qACl6tKu3WYqMjuKhpchXhARvTiX_eDZDMtprSU6gJOMAkp_5qILtC-kbUyzZ77a2MwFg8PZyfgkE"], "image_save_path": ["679954203871616_00.jpg"], "ad_text": "HandledNow LLC Sponsored Are you looking for a company that offers opportunities for growth? If so, look no further. We are hiring experienced forklift drivers for an established, fast-paced company. We need forklift drivers for 1st shift: 1st shift -Monday to Friday, 6:30 am to 3:30 pm or until work is done. Weekend needs possible. Raise given after 90 days and at 1 year! We are offering a $250 bonus if you do not miss any time in your first two weeks! Interested in applying, http://www.driver-reach.com/n/44sn9?ls=3162 Give us a call at 866-217-5630 during business hours with any questions! Job Description: Using a sit-down forklift to load and unload palletized freight Using an RF Scanner to create the WMS update upon IB and OB Shrink Wrap skids if needed Read freight labels to match up to the manifest and identify the shipper and consignee Count using basic math to identify the number of parts on a skid Operating under all safety instructions in regard to OSHA guidelines Job Requirements: Minimum 1 year of forklift experience Reliable transportation Ability to learn and use RF Scanner and warehouse WMS technology HS Diploma or GED Ability to do basic math Ability to read labels and manifests Ability to lift up to 50 lbs Ability to walk in circles while shrink-wrapping parts on a pallet *HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. Job Type: Full-time Pay: From $16.75 per hour Schedule: Day shift Monday to Friday Overtime Weekend availability Experience: Warehouse experience: 1 year (Preferred) Work Location: One location FULL-TIME · $16.75 / HOUR · TANNER, ALABAMA Experienced Forklift operator needed - 1st Shift Starting Orientation 1/30 Apply now", "grouping_count": 0}, {"id": 832711511164852, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fhandlednow.com%2Fjob-search%2F&h=AT08uZlO0lpI_ANGkrutcNTH_X9_2M3EglMZzLQzmGGGC0XPfIn8SRGHZFajuQjjQNoAKVral43Pi8QUej0-xWgjHa1OeL9mI25aPHIt1bv2f_S2ulBiFHjrzjDHL7QrnElq35j0xchHUEoyVZ6RvhQC4917xv7fUaO-ChvYxUs", "https://l.facebook.com/l.php?u=https%3A%2F%2Fhandlednow.com%2Fjob-search%2F&h=AT08uZlO0lpI_ANGkrutcNTH_X9_2M3EglMZzLQzmGGGC0XPfIn8SRGHZFajuQjjQNoAKVral43Pi8QUej0-xWgjHa1OeL9mI25aPHIt1bv2f_S2ulBiFHjrzjDHL7QrnElq35j0xchHUEoyVZ6RvhQC4917xv7fUaO-ChvYxUs", "https://l.facebook.com/l.php?u=https%3A%2F%2Fhandlednow.com%2Fjob-search%2F&h=AT08uZlO0lpI_ANGkrutcNTH_X9_2M3EglMZzLQzmGGGC0XPfIn8SRGHZFajuQjjQNoAKVral43Pi8QUej0-xWgjHa1OeL9mI25aPHIt1bv2f_S2ulBiFHjrzjDHL7QrnElq35j0xchHUEoyVZ6RvhQC4917xv7fUaO-ChvYxUs", "https://l.facebook.com/l.php?u=https%3A%2F%2Fhandlednow.com%2Fjob-search%2F&h=AT08uZlO0lpI_ANGkrutcNTH_X9_2M3EglMZzLQzmGGGC0XPfIn8SRGHZFajuQjjQNoAKVral43Pi8QUej0-xWgjHa1OeL9mI25aPHIt1bv2f_S2ulBiFHjrzjDHL7QrnElq35j0xchHUEoyVZ6RvhQC4917xv7fUaO-ChvYxUs", "#"], "image_save_path": ["832711511164852_00.jpg", "832711511164852_01.jpg", "832711511164852_02.jpg", "832711511164852_03.jpg"], "ad_text": "HandledNow LLC Sponsored Hey CDL Drivers! Do you want better pay and more home time in 2023? It's possible with HandledNow LLC! Search openings and easily apply today in less than 5 minutes! HANDLEDNOW.COM Search Our Job Openings Learn More HANDLEDNOW.COM Search Our Job Openings Learn More HANDLEDNOW.COM Search Our Job Openings Learn More HANDLEDNOW.COM Search Our Job Openings Learn More", "grouping_count": 0}, {"id": 8588113394596272, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["8588113394596272_00.jpg"], "ad_text": "HandledNow LLC Sponsored Looking to make a change in your CDL career? Give us a call at 866-217-5620 and let us help you! Local trucking company in search of a professional local driver to run relay routes and drop & hook runs to customers in IN, OH, MI and KY from our terminal in Nashville, TN. This is a home daily position with day cab and is no touch freight. The pay has a weekly MINIMUM guarantee of $1250, but with a mileage base and extra $$ for stops, delay and drop & hooks, you have an opportunity to make more! Our Nashville drivers are averaging $1500/wk! Plus *** $5,000 in Bonuses*** What we offer: - Competitive mileage pay - $1250 per week GUARANTEED minimum - Vacations and Holiday Pay, Safety Bonus & more! - Benefits similar to Ryder Logistics Qualifications: - Must have a valid Class A CDL License - Must have at least 9 months of tractor trailer experience in the last 3 years (Or 2 years in last 5, or 5 year in last 10) - Must be able to pass a DOT drug screen - No more than 1 major preventable accident in the last 3 years Sound like the opportunity for you? Give us a call! (866) 217-5620 ***HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. FULL-TIME · $1,250 / WEEK · NASHVILLE, TENNESSEE Class A CDL Truck Driver - Home Daily - $1250 MIN - Nashville, TN Apply now", "grouping_count": 0}, {"id": 867723051203826, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/24/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fn%2F44sn9%3Fls%3D3162&h=AT0eTsbVr63BktwUx0rarOfwbVC8Vrn9Hv3ScMLQo5cNIWoqVmA9anSFVQUkRz2xM0peKM3S3sKfp5s_SfOLbS-mWMh4qkJAGoIdW1f954KAOJaYgrWTHxkKlWwiQdWxraQ9a_PAh7iERwPKgALm5IyarRAq4OrJfBe7gYsZ_zg"], "image_save_path": ["867723051203826_00.jpg"], "ad_text": "HandledNow LLC Sponsored HandledNow is dedicated to providing opportunities for growth and advancement. We are currently in search of experienced Forklift Drivers to join our fast-paced and industry-leading team. We need forklift drivers for 2nd shift -Monday to Friday, 5:30 pm to 2:30 am or until work is done. Weekend needs possible. Orientation 1/30/2023 Raise given after 90 days and at 1 year! Plus, we offer a $250 bonus if you do not miss any time in your first two weeks! Interested in applying, http://www.driver-reach.com/n/44sn9?ls=3162 or give us a call at 866-217-5630 Job Description: Using a sit-down forklift to load and unload palletized freight Using an RF Scanner to create the WMS update upon IB and OB Shrink Wrap skids if needed Read freight labels to match up to the manifest and identify the shipper and consignee Count using basic math to identify the number of parts on a skid Operating under all safety instructions in regard to OSHA guidelines Job Requirements: Minimum 1 year of forklift experience Reliable transportation Ability to learn and use RF Scanner and warehouse WMS technology HS Diploma or GED Ability to do basic math Ability to read labels and manifests Ability to lift up to 50 lbs Ability to walk in circles while shrink-wrapping parts on a pallet ***HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. FULL-TIME · $17.25 / HOUR · TANNER, ALABAMA Experienced Forklift operator needed - 2nd Shift - Tanner. AL Apply now", "grouping_count": 0}, {"id": 3001507386820289, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/16/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fl%2F3c7hk%3Fls%3D3162&h=AT2cKbK-6_4qfM_sGsX0CtT25PJJvZzYIj2knFx78XUGuU617FAqtc2YBPBuWVbMkAyhrTXhfLIEC23tSJrWE2zTBFNyZx7FT3Ltv0Wx6WLDGTmTJdT433ZDfE1YekeacZJcQpbeJqMR-eOrWsaif-0cAiVGWuhCQo3O-mjdTGo"], "image_save_path": ["3001507386820289_00.jpg"], "ad_text": "HandledNow LLC Sponsored Do you have a valid Class A CDL License and the drive to work for a company that values you as much as you value your home time? Look no further! We are a local trucking company in search of a local professional driver to run relay routes and drop & hook runs out of our Indianapolis, IN terminal to customers within 250-275 miles of the terminal. This is a home daily position with a day cab and is no touch freight. Pay for this position has a weekly MINIMUM guarantee of $1500, with a mileage base and an extra $$ for stops, delay, and drop & hooks. You have an opportunity to make more! Benefits we offer: Competitive mileage pay $1500 per week GUARANTEED minimum Vacations and Holiday Pay, Safety Bonus Employment with a safety-focused company committed to our employee's job satisfaction Qualifications: Must have a valid Class A CDL License Must be able to pass a DOT drug screen No more than 1 major preventable accident in the last 3 years Interested in applying? Give us a call at (866) 932-3511 or apply online at http://www.driver-reach.com/l/3c7hk?ls=3162 We look forward to talking to you soon! **HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. FULL-TIME · $1,500 / WEEK · INDIANAPOLIS, INDIANA Class A CDL Truck Driver - Home Daily - Indianapolis, IN Apply now", "grouping_count": 0}, {"id": 5401738399931609, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/12/2023", "ad_url": [], "image_save_path": ["5401738399931609_00.jpg"], "ad_text": "HandledNow LLC Sponsored Hey drivers, looking for more home time and better pay? Check out this opportunity... We are a local trucking company in search of a professional local driver to run relay routes and drop & hook runs from our terminal in Fort Wayne, IN to customers in IN, OH, KY, MI, IL and surrounding terminals. This is a home daily position with day cab and is no touch freight. Pay for this position has a weekly MINIMUM guarantee of $1300, with a mileage base and extra $$ for stops, delay and drop & hooks, you have an opportunity to make more! $5,000 in bonuses paid at intervals over the 1st year. New equipment! Benefits we offer: - Competitive mileage pay - $1300 per week GUARANTEED minimum - Vacations and Holiday Pay, Safety Bonus - Employment with a safety focused company committed to our employees job satisfaction Qualifications: - Must have a valid Class A CDL License - Must have at least 9 months of tractor trailer experience in the last 3 years (Or 2 years in last 5, or 5 year in last 10) - Must be able to pass a DOT drug screen - No more than 1 major preventable accident in the last 3 years Interested in applying? Give us a call at 866-217-5620 or apply now. We look forward to talking to you soon! ***HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. FULL-TIME · $1,300 / WEEK · FORT WAYNE, INDIANA Class A CDL Truck Driver Apply now", "grouping_count": 0}, {"id": 481385407491878, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/10/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fn%2Fravvd%3Fls%3D3162&h=AT3BelBcLDMwaCFNNVpm2BvawzveDS-ly-zaBe8UNuYMx9gY6ikIwAMv92wxXFdTqOSgqVDOSy5sJbIO-_S0ynVR5csmPKcXTWEo5yS_g3w8hbxqKnOYjis9b6FIC26IDdzQw98mdMnCqVPxelku2FIiIgpkQr21ICIMoOH701k"], "image_save_path": ["481385407491878_00.jpg"], "ad_text": "HandledNow LLC Sponsored Are you an experienced, reliable, Welder/Fabricator looking for a growing company that treats employees like family? If so we want YOU on our team! We are looking for the right individuals to fill a full-time Welder/Fabricator position in Indianapolis, IN. Schedule - Monday to Thursday, 6:00 am to 4:30 pm. Potential 8 hours needed on Friday and volunteer overtime offered on the weekend. Bonus - $250 bonus is offered if you have perfect attendance during the first 2 weeks. Interested in applying please click here, http://www.driver-reach.com/n/ravvd?ls=3162 Have questions? Give us a call at 866-217-5630 Job Description - Following all safety and environmental rules, regulations, and procedures as set forth by company policies and OSHA - Operating and monitoring all equipment and production area safely and efficiently. - Ability to utilize various equipment and tools in order to accurately position, align, fit and weld steel pieces together to form each unit and submit. - Ensure accuracy in welding by measuring and marking each piece to account for stock thickness, as well as machine and welding shrinkage. - Using fabrication drawings to complete the fabrication of the job correctly - Coordinate with coworkers and supervisors to effectively organize, plan and prioritize and make decisions regarding client project work. - Utilize various mechanized vehicles or devices to move project pieces, large and small in size, throughout the fabrication workshop - Ability to help out in other areas of the warehouse when help is needed. Job Requirements - Safety Focused - Ability to read and analyze customer drawings - Must have a minimum of 2 years of welding experience - Must be capable of working with different types of steel projects, from small detailed parts to large-scale structural pieces. - Ability to perform rigorous physical activities in all weather conditions - Self-motivated with a solid work ethic - 1-2 years of experience in a manufacturing or warehouse environment - A High School degree or GED is preferred - Must be able to read and write English and calculate mathematical equations at approximately a 9th-grade level. - Must be able to read and use a tape measure - Must be able to communicate orally effectively and professionally - Steel fabrication or industry experience is strongly preferred - Attention to detail and strong organizational skills - Must be able to communicate and work successfully as part of a team - Ability to perform all essential functions - Must wear protective equipment such as a welding shield, safety glasses, face shield, gloves, welding sleeves, welding aprons, hearing protection, and steel-toed boots. - Ability to work in an environment exposed to the elements and work in a building with various temperatures, dirt, and dust. Must also be able to work in an environment that is loud. Areas of the work environment include moving conveyor belts. - Be able to stand on your feet during the entire workday. Must also be able to walk, climb stairs, and occasionally use ladders and scaffolding. Use hands to finger, handle or feel objects, tools, or controls. Reach with hands and arms. Be able to balance, stoop, kneel, crouch or crawl, talk or hear. - Ability to lift 10 LBS to 100 LBS daily. - Ability to operate motor vehicles, including trucks, forklifts, and overhead cranes. - Ability to use a large variety of hand and power tools, including but not limited to grinders, hammers, sledgehammers, hand torches, jacks, wedges, turnbuckles, and drill presses. ***HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. Job Type: Full-time Pay: From $18.00 per hour Benefits: 401(k) 401(k) matching Dental insurance Health insurance Life insurance Paid time off Vision insurance Experience level: 2 years Shift: 10 hour shift Day shift Weekly day range: Monday to Friday Weekend availability FULL-TIME · $18 / HOUR · INDIANAPOLIS, INDIANA Experienced Welder and Fabricator Needed - Bonus Pay - Indianapolis, IN Apply now", "grouping_count": 0}, {"id": 3319166541702621, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/10/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fn%2Fpkyg3%3Fls%3D3162&h=AT2L-MG1f0w8RaFP5F_P1-fSgiiPO2rRDls4s2s1yqdju1x6UuhAHiWwtZs6PaZ4xgPrACqHDQJjMrRTIF2d6F_F2MCrS6sUa3DkXs7CCiecGgkQ0y_1R2oM3r5Urr1_zX7bjzLhouUyYVRRQAj1EcRkzHoGzOKm5NT874HX3GM"], "image_save_path": ["3319166541702621_00.jpg"], "ad_text": "HandledNow LLC Sponsored Fast-growing company looking for a material handler with heavy-duty forklift experience to help move steel pieces inbound and outbound using flatbed trailers, yard space, and warehouse space. Job Description: - Unload raw steel parts off the flatbed trailer in the yard and move them to the desired space in the yard or warehouse. - Load finished goods onto a flatbed trailer to deliver to the construction site - Move steel to the station for fabrication - Work with a flexible mindset that staging areas may change due to current needs. - Follow daily directions from the supervisor or manager - Perform pre- and post-operation inspection of the equipment in accordance with Company policy to ensure windows, lights, mirrors, and a rear-view camera are clean. - Safely and efficiently operate equipment that may include forklift, excavator, bulldozer, front-end loader, and other equipment using proper safety standards. - Keep areas clean from debris - Use different sizes of forklifts to handle different sizes of material. - Use equipment, in addition to the forklift, to transport large beams inside the warehouse to be fabricated - Help out in other areas when not currently busy - Work safely and follow OSHA requirements Job Requirements - Must have 2 years of Forklift experience, preferred Heavy duty experience - Experience in working with large-capacity forklifts (more than 36,000 lb. capacity) - Must have 2 years of working in a warehouse experience - Able to work outside the environment all year - Must have a HS degree or GED - Must have experience moving oversized material - Can be flexible, be able to work with changing environments due to project needs - Ability to lift up to 100 LBS - Ability to adhere to Company policies and rules set forth; promotes the Company's safety standards; does not take inappropriate risks. - Can be a team player - Good, professional verbal communication skills - Maintains a feeling of pride in work; strives to achieve all goals. Pay: $16hr Interested in applying? Click here, http://www.driver-reach.com/n/pkyg3?ls=3162 or apply directly here. Have questions please give us a call at 866-217-5630 *HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. FULL-TIME · $16 / HOUR · INDIANAPOLIS, INDIANA Material Handler with Heavy Duty Forklift Experience - Indianapolis, IN Apply now", "grouping_count": 0}, {"id": 2561084124061171, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "01/03/2023", "ad_url": [], "image_save_path": ["2561084124061171_00.jpg"], "ad_text": "HandledNow LLC Sponsored Looking for a company who values you as a person both in and out of the driver seat? A company who actually delivers on their promises? Join the HandledNow team and notice the difference! We are a local trucking company in search of a professional local driver to run relay routes and drop & hook runs to customers in KY, OH, IN, TN out of our terminal in Georgetown, KY. This is a home daily position with day cab and is no touch freight. The pay has a weekly MINIMUM guarantee of $1200, but with a mileage base and extra $$ for stops, delay and drop & hooks, you have an opportunity to make more! What we offer: - Competitive mileage pay - $1200 per week GUARANTEED minimum - $1350 per week Extra Board GUARANTEED minimum - Vacations and Holiday Pay, Safety Bonus & more! Qualifications: - Must have a valid Class A CDL License - Must have at least 9 months of tractor trailer experience in the last 3 years (Or 2 years in last 5, or 5 year in last 10) - Must be able to pass a DOT drug screen - No more than 1 major preventable accident in the last 3 years ***HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. FULL-TIME · $1,200 / WEEK · GEORGETOWN, KENTUCKY Class A CDL Truck Driver - Home Daily - $1200 Weekly MIN Apply now", "grouping_count": 0}, {"id": 1127526634502249, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "12/22/2022", "ad_url": [], "image_save_path": ["1127526634502249_00.jpg"], "ad_text": "HandledNow LLC Sponsored Drivers, ready to make some money? HandledNow is connecting drivers with jobs that work for them. Earn more on the road and enjoy home-time daily! Details below: We are a local trucking company in search of a Certified CDL A Driver to run relay routes and drop & hook runs to customers IN, OH, KY, MI, IL and surrounding terminals from our Lafayette, IN location. This is a home daily position in a day cab. No-touch freight. Pay for this position has a weekly MINIMUM guarantee of $1300. With a mileage base and extra $$ for stops, delay, and drop & hooks, you have an opportunity to make more! Plus: $3,000 in bonuses paid at intervals over the 1st year AND new equipment. Interested in applying? Give us a call at 866-217-5620 or apply now! Benefits we offer: - Mileage pay - $1300 per week GUARANTEED minimum - Home Weekends - Vacations and Holiday Pay, Safety Bonus - Employment with a safety focused company committed to our employees job satisfaction Qualifications: - Must have a valid Class A CDL License - Must have at least 9 months of tractor trailer experience in the last 3 years (Or 2 years in last 5, or 5 year in last 10) - Must be able to pass a DOT drug screen - No more than 1 major preventable accident in the last 3 years ***HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. Benefits FULL-TIME · $1,300 / WEEK · LAFAYETTE, INDIANA Class A CDL Truck Driver - Home Daily - $1300 Weekly MIN - Lafayette, IN Apply now", "grouping_count": 0}, {"id": 725338005860317, "advertiser_name": "HandledNow LLC", "status": "Active", "date": "12/16/2022", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.driver-reach.com%2Fl%2F83qdt&h=AT28a8RYjCnXetMWS5uRl_a7SLHzuJqx7-7mza3PJKc1AtksFtxZotZhRfcrMntVUp2vticE9NQrMPw7hfBMk_EUffx7FeFFaDBBwKT8cO8QEWoIZ0yIeteGkEsPu5eDa1bIP2b39-qZt7OCKFvDsu03f8IcWZuaMOf7tW2Vi5I"], "image_save_path": ["725338005860317_00.jpg"], "ad_text": "HandledNow LLC Sponsored Are you a Class A CDL Driver looking for a home daily, no touch, drop & hook route opportunity? We have the job for you. Join our team, apply today! We are a local trucking company in search of a professional local driver to run relay routes and drop & hook runs to customers in IN, OH, TN and KY. Benefits we offer: - Mileage pay - $1200 per week GUARANTEED minimum - Vacations and Holiday Pay, Safety Bonus - Employment with a safety-focused company committed to our employees' job satisfaction - Benefits similar to Ryder Logistics Qualifications: - Must have a valid Class A CDL License - Must have at least 9 months of tractor trailer experience in the last 3 years (Or 2 years in the last 5, or 5 years in the last 10) - Must be able to pass a DOT drug screen - No more than 1 major preventable accident in the last 3 years Interested in applying? Give us a call at 866-217-5620 or apply online at http://www.driver-reach.com/l/83qdt application. We look forward to talking to you soon! ***HandledNow does not discriminate in any employment practices on the basis of race, color, religion, gender, national origin, age, disability, or other characteristics protected by law. Decisions at HandledNow are made solely on the basis of merit, ability, qualifications, and character. FULL-TIME · $1,200 / WEEK · SHARONVILLE, OHIO Class A CDL Truck Driver - Home Daily - $1200 Weekly MIN -Sharonville, OH Apply now", "grouping_count": 0}]