[{"id": 1428431184567444, "advertiser_name": "Weddle Enterprises Inc", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["1428431184567444_00.jpg"], "ad_text": "Weddle Enterprises Inc Sponsored Heavy Equipment Mechanic Experienced Heavy Equipment Mechanic. 10 years + Experience with ability to manage entire maintenance crew and fleet. Manage/Supervise all field technicians while also managing main shop and mentor/oversee lower level technicians. This is a Head Mechanic Position and said individual will be responsible for maintaining roughly 60 pieces of heavy equipment and 20 Class 8 Heavy Duty Trucks. Company offers benefits and retirement option. Must be able to provide job references and pass a background check. Must possess a valid Driver’s License and able to safely operate a service truck equipped with crane. Possess excellent interpersonal skills able to communicate with equipment operators and truck drivers to be able to problem solve and diagnose faults or malfunctions to determine needed repairs. Review parts manual and order parts for repair. Repair and replace damaged or worn parts. Dismantle and reassemble heavy equipment components when required for repair. Clean, fuel, lubricate, and perform other routine maintenance work on equipment and vehicles as necessary. Have full knowledge of air brake systems and brake repair for highway dump trucks and tractor/trailer combo. Examine parts for damage or excessive wear. . . Schedule maintenance for equipment, and keep equipment service records. Perform engine and hydraulic oil and filter changes. Read and understand equipment operating and parts manuals. Overhaul and test machines or equipment to ensure operating efficiency. Possess excellent knowledge and skill of electrical and hydraulic system repairs. Weld or solder broken parts and structural members, using electric or gas welders. Willing to work overtime when needed and able to fill out reports and maintenance records as necessary. Has the ability to work with and properly maintain various hand and power tools in a safe manner and is able to maintain and clean and safe work area at all times. FULL-TIME · SOMERSET, KENTUCKY Heavy Equipment Mechanic Apply now", "grouping_count": 0}, {"id": 1217324585556708, "advertiser_name": "Weddle Enterprises Inc", "status": "Active", "date": "01/26/2023", "ad_url": [], "image_save_path": ["1217324585556708_00.jpg"], "ad_text": "Weddle Enterprises Inc Sponsored Heavy Equipment Operators: Excavator and Dozers Prior operating experience is preferred. Possess a basic knowledge of earthwork tasks to include cut and fill operations, ditch construction, haul road management, storm water management to include diversion ditches and erosion control devices. Have a good understanding of a cut / excavation / borrow sites. Have a good understanding of slopes and the ability to safely operate on slopes. Preferably, prior experience with Trimble GPS or Topcon grade control systems and/or has a general understanding of computer systems and is willing to learn. Apply Online or at our office from 8:00 AM - 5:00 PM M-F. You can also send us a message. FULL-TIME · SOMERSET, KENTUCKY Equipment Operator Apply now", "grouping_count": 0}]