[{"id": 744456187066975, "advertiser_name": "Nelson Sanitation & Rental, Inc.", "status": "Active", "date": "01/17/2023", "ad_url": [], "image_save_path": ["744456187066975_00.jpg"], "ad_text": "Nelson Sanitation & Rental, Inc. Sponsored We are hiring! Route Technician Drivers. Nelson Sanitation & Rental, Inc. is a locally owned, well established, growing company with locations in Rice, MN & the Brainerd Lakes area. We are seeking outgoing professionals that have the desire to excel. A clean driving record is required. The Full-Time Route Technician Driver Position requires a valid driver’s license. Route experience is preferred but not required, willing to train. Must pass background check. Must be willing to get a medical card upon hire. Main duties will include servicing, cleaning, delivering, picking up restrooms daily and completing proper paperwork. Other duties will be assigned as needed. Ability to climb, bend, or stand for an extended period of time. In addition, individuals must be able to reach above shoulders and lift a minimum of 75 pounds. Daily duties include but are not limited to: Perform daily safety checks, pre-trip and post-trip inspections to ensure equipment is in safe working order. Complete reports for any defective equipment. Operating and maintaining company work vehicles on a daily basis while keeping the inside and outside vehicle clean and organized at all times. Refuel trucks, check and add fluids as needed. Ensure compliance with company policies, safety, and maintenance procedures. Drive to disposal site to empty truck. Ability to drive trucks safely through residential streets, alleys, and other residence or business areas following all driving laws and using seat belt at all times. Benefits are available including health insurance, 401K, paid time off, and holiday pay. April – December hours ranging between 45 – 55 hours per week. January - March hours ranging around 40 hours per week. Pay is competitive and based on experience. Pay ranges between $40,000-$55,000+ per year with overtime. Company uniforms are provided. If you would like to be part of our growing team providing superior customer service, please contact us today. For inquires please contact by email at Amanda@NelsonSanitation.com or by phone at 320-393-2787 for an application. Nelson Sanitation & Rental, Inc. is an Equal Opportunity Employer. Nelson Sanitation & Rental, Inc. Construction, Home Repair, Event Service Send message", "grouping_count": 0}]