[{"id": 837522284017063, "advertiser_name": "Builders FirstSource - Petoskey", "status": "Active", "date": "01/16/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fbldr.com%2Fwhy-builders%23benefits&h=AT0Z0C_8czd4nteHnVw7UQbWn4fJXf2itQpbwJPOt-ib_bfRd5Gk9wbT7k2y8pwLXyDI_em5RLb0rU0us_ak-bKtPNSkhd0DtbhrPKl6VL9d13mH8aQc-TiEmu1ICNVoO8zFaC1nG-yDu0mbKNUMFjehW30lUMKlBcvsfn36uMY"], "image_save_path": ["837522284017063_00.jpg"], "ad_text": "Builders FirstSource - Petoskey Sponsored AMAZING CAREERS ARE FOUND HERE Our Team Members are the heartbeat of our Company, and we appreciate each and everyone for their partnership, dedication and their loyalty. We work hard to provide a workplace that is safe and one that promotes bringing fresh ideas and perspectives to help us grow and remain a thriving, sustainable business and a source of pride in this industry. As a Fortune 400 Employer, our goal is to provide career opportunities which will impart a pride of ownership and respect for every team member. Our Vision is to make the dream of homeownership more achievable for everyone, making Builders First Source the most valuable partner in the industry. PURPOSE Responsible for driving delivery vehicles and/or operating truck-trailer combinations to transport and deliver materials to customer sites. Adheres to driver safety/compliance regulations, delivers un-damaged goods on schedule, and provides professional service to customers. Drive vehicles weighing greater than 26,000 pounds and may tow vehicles or trailers less than 10,000 pounds. ESSENTIAL DUTIES AND RESPONSIBILITIES - May load or assist with loading and appropriately securing product, materials, or supplies inside the delivery vehicle. - Maintains the cleanliness and appearance of delivery vehicles; performs routine safety checks to ensure vehicles comply with company guidelines. - Required to use handheld devices, except for while driving, to ensure compliance with DVIR and HOS. - Maintain hours of service logs and pre/post-trip inspection procedures. - May perform credit/product return pick-ups and related paperwork. - Operate Forklift or non-motorized material handling equipment to load and offload materials to designated areas. - Understands and observes all safety procedures and practices in order to prevent injury to self or co-workers; attends periodic safety meetings as required; may recommend changes to improve safety procedures. - Other duties as assigned. REQUIREMENTS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. - Valid driver’s license - Class B CDL license - Pass MVR report - Obtain a DOT medical card - Basic math & measurement skills - Ability to read and speak the English language COMPETENCIES - Relationship Building: Builds working relationships and seeks to resolve issues constructively. - Teamwork: Knows and supports teammates’ work and deliverables. Encourages team unity through sharing information or expertise. - Customer Focus: Listens to, anticipates and responds to customer needs. WORK ENVIRONMENT / PHYSICAL ACTIVITY The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. - Work is performed within a production environment, subject to temperature variations, hazardous chemicals, mechanical parts, increased noise levels and dust. - Must be able to physically operate delivery vehicles (climb up and down into cab, twist torso for 360-degree visibility, use arms to operate controls, etc.). BENEFITS (Click Here - https://bldr.com/why-builders#benefits ) - Medical, dental and vision insurance - Life Insurance - Paid holidays and paid time off - Flexible spending accounts for Health and Dependent Care - 401K retirement plan with matching contributions - Short-term and long-term disability coverage FULL-TIME · CONWAY, MICHIGAN CDL Driver-Class B Apply now", "grouping_count": 0}]