[{"id": 1246229052910505, "advertiser_name": "Presbyterian SeniorCare Network Careers", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fpm.healthcaresource.com%2FCS%2Fsrcare%2F%23%2Fjob%2F3740&h=AT0d9-KZqswrRq5lxti-kdnMzeEH0JXrNsRDg1_s7MFiVxfduKgJ-qLC3NANdcqtFuns3FWm3leNmEoK0qyFis3cpNLS4HTmRbMDFUmPphYfVfDDZMGYYGx60KeNBh8uO11aaffCYCI2tqMTv8gUVYoLgnz482S3ybjC1xWckRs"], "image_save_path": ["1246229052910505_00.jpg"], "ad_text": "Presbyterian SeniorCare Network Careers Sponsored Are you a nurse who wants to make a positive difference in the lives of older adults? Are you tired of the revolving door of patients so common at large healthcare systems? Then join our team. We're hiring RNs for our Erie communities of Elmwood Gardens and Manchester Commons. Our long-term care communities provide you with an opportunity to develop the caring relationships many nurses yearn for. You can also maintain and sustain your clinical expertise, and we also support your professional growth. Find your calling with us. We offer sign-on bonuses and flexible scheduling options. Apply here: https://pm.healthcaresource.com/CS/srcare/#/job/3740 FULL-TIME · ERIE, PENNSYLVANIA Registered Nurse (RN) Apply now", "grouping_count": 0}, {"id": 506723154905929, "advertiser_name": "Presbyterian SeniorCare Network Careers", "status": "Active", "date": "01/25/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fpm.healthcaresource.com%2FCS%2Fsrcare%2F%23%2Fjob%2F5831&h=AT1DJwnW9JLqFqqpO0Sz6prBJXIXIbPxPyoNq6MzwtyZ5AjsnMzjHjWCixhitnGIsbNyKl03JfBbQWo3f835KqUTMMqv_H-IxsDD7fT5-OVdFUG5iQfGqVGOghUlvWpq2fIvapZO0GYoljhp2JhgjGHOC2Ew-Zsxo4bvlz8adM8"], "image_save_path": ["506723154905929_00.jpg"], "ad_text": "Presbyterian SeniorCare Network Careers Sponsored Would you answer YES to the following? * Do you like to be busy? * Are you a self-starter who is able to work independently? * Do you enjoy painting, minor electric, plumbing, drywall repair, and other maintenance work? Then apply today for our Maintenance Technician position! We are hiring Maintenance Techs in our apartment communities. We're offering a sign-on bonus of up to $3,000. Learn more & apply here: https://pm.healthcaresource.com/CS/srcare/#/job/5831 FULL-TIME · PITTSBURGH, PENNSYLVANIA Apartment Maintenance Technician Apply now", "grouping_count": 0}, {"id": 475422134798185, "advertiser_name": "Presbyterian SeniorCare Network Careers", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fpm.healthcaresource.com%2FCS%2Fsrcare%2F%23%2Fjob%2F3755&h=AT1Q704s3NNLAW1SCEfXTaJy77y08Zu99KWHAHSXQgMoOSGVok7QlgM6S0JsP7SHki4TkYoFiWq6ta7nkHUw_UKG7Ng3ExFdxTNa12Zpo189aDPsU6_iukbtXRO3qGZ52RxXWMcVKeRUNoYo0ledBBxeGK2-d4qxNsXwQupPV5M"], "image_save_path": ["475422134798185_00.jpg"], "ad_text": "Presbyterian SeniorCare Network Careers Sponsored We’re hiring compassionate CNAs to help make a difference in the lives of seniors! Are you interested in a rewarding career where you can build meaningful relationships with older adults? Become a Certified Nurse Aide (CNA) at Presbyterian SeniorCare Network. We're offering a sign-on bonus of up to $2,000. Our CNAs help our residents by providing comfort and supporting daily living needs. This includes assisting with personal hygiene and vital sign monitoring. Must be able to effectively interact with residents, resident families, and team members. Apply here: https://pm.healthcaresource.com/CS/srcare/#/job/3755 Not a CNA yet? We’ll hire you and train you - and pay you for your time to learn. With us, you can earn while you learn. After receiving your nurse aide certification, you'll go right to work for us in one of our care communities. FULL-TIME · OAKMONT, PENNSYLVANIA Certified Nursing Assistant (CNA) Apply now", "grouping_count": 0}, {"id": 715969546850409, "advertiser_name": "Presbyterian SeniorCare Network Careers", "status": "Active", "date": "01/20/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fpm.healthcaresource.com%2FCS%2Fsrcare%2F%23%2Fjob%2F3775&h=AT2KKhTOfEgGKf36D44vkZ6B4zedt6eTsDlgm_g2gzJsszMpiU9A7MyDadt4bfc63g2-2-Sbd8T4SncFlhC2ruG4cJK-1apsL0JpTKkZR1jopMiG3OIVcG-JmKetFT1Ro_w3vkJTQen3LATbmreqS36Dz1OQQatX79IgLoblLGk"], "image_save_path": ["715969546850409_00.jpg"], "ad_text": "Presbyterian SeniorCare Network Careers Sponsored Now hiring housekeepers at our Oakmont location! Ask about our sign-on bonus of up to $500. Responsible for providing housekeeping services for the efficient, clean, comfortable and safe operation of all departments. These services include, but are not limited to: maintenance of a safe and sanitary environment; housekeeping in residents’ room and around the building; and promotion of customer satisfaction. May assist in providing laundry services for residents. High school graduate or GED preferred but not required. Learn more and apply: https://pm.healthcaresource.com/CS/srcare/#/job/3775 FULL-TIME · OAKMONT, PENNSYLVANIA Housekeeping/Environmental Services Aide Apply now", "grouping_count": 0}, {"id": 475521144782904, "advertiser_name": "Presbyterian SeniorCare Network Careers", "status": "Active", "date": "01/17/2023", "ad_url": [], "image_save_path": ["475521144782904_00.jpg"], "ad_text": "Presbyterian SeniorCare Network Careers Sponsored Presbyterian SeniorCare Home Health is seeking caring professional nurses to provide home health visits to patients for both of our Oakmont and Washington campuses and communities through the Presbyterian SeniorCare Home Health RN, Registry position. FULL-TIME · OAKMONT, PENNSYLVANIA Home Health Registered Nurse (RN), Registry (Covering Oakmont and Washington, PA Communities) Apply now", "grouping_count": 0}]