[{"id": 2109062095933190, "advertiser_name": "Midwest Viking, Inc.", "status": "Active", "date": "10/28/2022", "ad_url": ["#"], "image_save_path": ["2109062095933190_00.jpg", "2109062095933190_01.jpg", "2109062095933190_02.jpg", "2109062095933190_03.jpg", "2109062095933190_04.jpg"], "ad_text": "Midwest Viking, Inc. Sponsored Midwest Viking is looking for full time OTR drivers. Home weekends, or every other weekend- you decide. Our loads typically get drivers through Des Moines at least once during the week. Our business consists of dry van and reefer loads - there is a potential for a flatbed driver as well. Interested drivers must have 3 years experience and a clean driving record. Midwest Viking is looking for quality drivers that want to help grow our small company. We have immediate openings available. We are flexible with each driver and at our company you are not a number, but a person. Our mission is to employ the best team in the industry to move our customers' freight safely and on time - every time Truck Driver Qualifications Valid Class A Commercial Driver's License (CDL) with at least THREE years verifiable experience. Must be at least 24 years or older. Must have a clean MVR for past three years. Truck Driver Pay & Benefits for full time drivers. Ѻ Mileage or percent. Ѻ Quality home time. Ѻ Flexible scheduling available. Ѻ Quarterly Safety Bonus Ѻ Paid time off. Ѻ Medical, dental and vision insurance. Ѻ No employment contract. We offer: o Excellent benefit package includes Health, Dental & Vision (company pays 50% of employee premium) o Two Weeks paid vacation in year one o Local Company established in 1979 where you are a person, a friend, and not just another number! o Positive work environment. o Strong emphasis on your personal safety. o Consistent year-round freight. o Referral bonus for helping to hire more drivers. Our goal is to provide our employees with an inviting, fun, high energy work atmosphere that fosters an entrepreneurial spirit by providing sound, financial rewards for hard work and dedication. This is a great opportunity for a professional driver with strong customer service skills interested in being home weekly while still making great pay. EOE Please call Brad - (515) 964-1933 FB.COM Midwest Viking, Inc. Send Message FB.COM Midwest Viking, Inc. Send Message FB.COM Midwest Viking, Inc. Send Message FB.COM Midwest Viking, Inc. Send Message FB.COM Midwest Viking, Inc. Send Message", "grouping_count": 0}]