[{"id": 844376113306617, "advertiser_name": "Edgerton Care Center", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["844376113306617_00.jpg"], "ad_text": "Edgerton Care Center Sponsored Full-time & part-time available for Caregivers/Resident Assts (RAs). Shift choice: PMs (2p-10:30p) or NOC (10p-6:30a). Excellent, paid training. No experience needed. FREE CNA CLASSES! Ask about our Earn & Learn program and get your nurses assistant certification for free. Join a team where you'll make a difference. RAs provide companionship and help with personal care, mealtime, activities, etc. SUPPORTIVE WORKPLACE EMPLOYEE ASSISTANCE PROGRAM PAID TRAINING FREE CNA CLASSES JOB GROWTH TUITION REIMBURSEMENT Wage based on experience (not nec), shift choice and chosen benefits. Free classes require an employment obligation. FULL-TIME · $15 - $16 / HOUR · EDGERTON, WISCONSIN Caregivers needed: Days or evenings - Free CNA classes Apply now", "grouping_count": 0}, {"id": 889693148851568, "advertiser_name": "Edgerton Care Center", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["889693148851568_00.jpg"], "ad_text": "Edgerton Care Center Sponsored Part-time or full-time. Shift choice: PMs (2p-10:30p) or NOC (10p-6:30a). Weekdays & every other weekend. Requirements: Completed the Wisconsin Medication Assistant Training Program or an approved college-level pharmacology course and training in the area of medication administration. Must be a Wisconsin-licensed CNA. SUPPORTIVE WORKPLACE GREAT BENNIES EMPLOYEE ASSISTANCE PROGRAM PAID TIME OFF JOB GROWTH IN ORGANIZATION Apply today! Wage dependent on experience, shift and chosen benefits. FULL-TIME · $19 - $25 / HOUR · EDGERTON, WISCONSIN Med Tech Apply now", "grouping_count": 0}, {"id": 709187370682159, "advertiser_name": "Edgerton Care Center", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["709187370682159_00.jpg"], "ad_text": "Edgerton Care Center Sponsored Part-time or full-time. AMs: 6a - 2:30p PMs: 2p - 10:30p NOC: 10p-6:30a Up to $4K bonus depending on shift. Make a difference and love where you work. We're looking for conscientious caregivers like you to join our team - caring for residents and each other! Must be a licensed CNA in Wisconsin. SUPPORTIVE WORKPLACE EMPLOYEE ASSISTANCE PROGRAM TUITION REIMBURSEMENT PROGRAM JOB GROWTH OPTIONS If you're not a CNA, but want to be, we offer FREE CNA classes. Start with us in another dept and earn your CNA in a matter of weeks! Wage based on experience, shift choice & desired benefits. Free class requires employment obligation. #careersincaring FULL-TIME · $16 - $19.25 / HOUR · EDGERTON, WISCONSIN CNAs needed: Careers in Caring! Apply now", "grouping_count": 0}]