[{"id": 5723604571085364, "advertiser_name": "Go CDL", "status": "Active", "date": "01/26/2023", "ad_url": ["https://l.facebook.com/l.php?u=http%3A%2F%2FGoCDL.com%2F&h=AT07t3jxG0cfMjIVk5oXwl2R4ffaaFvDlQwZCjTh7lwM2zGcR-SNvI6UZTpIKdbfWTOzh8WfzgOOg4toYYiRE885uuXqO5Dah-LKyrhTq6XjytiY4TXjOwgNCTBORlIzCsPtjKsVjQSBhpOuW0C8mpyB_G0"], "image_save_path": ["5723604571085364_00.jpg"], "ad_text": "Go CDL Sponsored GoCDL.com is a great place to find a job in Trucking. We have positions of all description nationwide. Home daily, OTR, days, nights, touch, no touch, we have it all. Give us some information and we will contract you with only the best jobs for you. GoCDL for Better CDL Jobs Sign up", "grouping_count": 0}, {"id": 3456379474689870, "advertiser_name": "Go CDL", "status": "Active", "date": "01/24/2023", "ad_url": [], "image_save_path": ["3456379474689870_00.jpg"], "ad_text": "Go CDL Sponsored This CDL-A job dispatches out of Chicago, IL. You will receive great pay, a steady schedule, and this is a long term opportunity. 6 day work week Working weekends and holidays Early am start times 2-6am roughly 99% no touch live load Driver is required to assist when needed but this is rare Secure load after live-load complete with mail belts & lock trailer 55+ hours paid per week typical, actual clock time is about 85% of that. Example: Route A pays minimum 10.5 hours for completed trip Route A takes approximately 8.5 hours on average start to finish Result? Get paid 10.5 for working 8.5 hours Route X pays minimum 10.5 hours for completed trip Route X took 11.5 hours on that day Result? Get paid 11.5 for working 11.5 hours For more details and available routes, contact us today. Great pay $34h f/40 - $28.50 all hours Dedicated runs Guaranteed hours Health benefits 401(k) long term FULL-TIME · $28.50 - $34 / HOUR · CICERO, ILLINOIS CDL A Driving Job - Home Daily - Local - $28 - $34 Apply now", "grouping_count": 0}, {"id": 1229425980991885, "advertiser_name": "Go CDL", "status": "Active", "date": "01/23/2023", "ad_url": [], "image_save_path": ["1229425980991885_00.jpg"], "ad_text": "Go CDL Sponsored Our Sr. Recruiter Peg is available at 610-655-7092 to discuss with you - or send us a resume here. Day Cab Home daily M-F Day Shift – approximately 7 am starts Departs Goffstown NH Avg 10 – 12 hrs per day Pay depends upon experience. Make up to $30 per hour. Looking for 2 years exp. in CDL A This job includes: Great Equipment Steady Hours Health Insurance 401(k) PTO / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. FULL-TIME · $25 - $30 / HOUR · GOFFSTOWN, NEW HAMPSHIRE CDL A - No Touch - Home Daily - up to $30h Apply now", "grouping_count": 0}, {"id": 1538914266617130, "advertiser_name": "Go CDL", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["1538914266617130_00.jpg"], "ad_text": "Go CDL Sponsored I need a home daily CDL driver and a OTR driver out of Scranton area. Home Daily pays $30h OTR home every 2 to 3 days - avg over $1400 week. Our Sr. Recruiter Peg is available at 610-655-7092 to discuss details with you - or send us a resume here. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. We have home daily, regional and OTR driving jobs, so you can put your CDL to work how you want to drive. CDL Labor Logistics is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws. This policy applies to all CDL and non-CDL employment practices within our organization, including hiring, recruiting, promotion, termination, layoff, recall, leave of absence, compensation, benefits, training, and apprenticeship. CDL Labor Logistics makes hiring decisions based solely on qualifications, merit, and business needs at the time. We follow all applicable Federal Motor Carrier Safety Administration - FMCSA regulations, and all applicable DOT requirements in hiring and utilizing CDL drivers and for placements in CDL jobs. FULL-TIME · $30 / HOUR · SCRANTON, PENNSYLVANIA Home Daily CDL A Work / OTR Available too! Apply now", "grouping_count": 0}, {"id": 1568333166979773, "advertiser_name": "Go CDL", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["1568333166979773_00.jpg"], "ad_text": "Go CDL Sponsored Second Shift yard jockey positions. Make $27.00 hour + OT after 40. 4pm starts daily. Please give Anthony a call or text - 717-562-9574 - This is Anthony's cell phone and he is able to answer questions on this jockey job and will get back to you quickly. Need 9 months verifiable CDL-A Experience. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits and have truck driving jobs with good pay and longterm stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. FULL-TIME · $27 / HOUR · SPRING HILL, TENNESSEE Yard Jockey Needed - $27h + OT - CDL A Apply now", "grouping_count": 0}, {"id": 434928008774645, "advertiser_name": "Go CDL", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["434928008774645_00.jpg"], "ad_text": "Go CDL Sponsored Daylight Mon – Fri – $26.00 per hr No touch freight – Home Daily Requires at least 1 full year of class A TT exp. Please give our recruiter Anthony a call or text - 717-562-9574 - or send us a resume here. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations FULL-TIME · $26 / HOUR · YORK, PENNSYLVANIA CDL A - No Touch - Home Daily Apply now", "grouping_count": 0}, {"id": 885587619154731, "advertiser_name": "Go CDL", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["885587619154731_00.jpg"], "ad_text": "Go CDL Sponsored I need 4 drivers. We have one location where they go to a supplier and off load live parts and reload his same trailer with empty racks. The other 3 are drop and hooks at a cross dock. These pay $270.00 for the drop and hook routes and $292.50 for the live unload and reload by the supplier route. The three cross dock routes depart at 13:00, 14:30, 16:30 and 17:45 Please give our recruiter Anthony a call or text - 717-562-9574 - or send us a resume here. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations FULL-TIME · $1,350 - $1,450 / HOUR · LOUISVILLE, KENTUCKY CDL A - Home Daily - No Touch - MF Apply now", "grouping_count": 0}, {"id": 1302954857169406, "advertiser_name": "Go CDL", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["1302954857169406_00.jpg"], "ad_text": "Go CDL Sponsored We need drivers with a CDL A license and at least 9 months recent experience. This is home daily no touch work. Our Sr. Recruiter Peg is available at 610-655-7092 to discuss with you - or send us a resume here. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer.", "grouping_count": 2}, {"id": 687003512970494, "advertiser_name": "Go CDL", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["687003512970494_00.jpg"], "ad_text": "Go CDL Sponsored Great trucking job! Home Daily - NO TOUCH $1300 Weekly Minimum Our Sr. Recruiter Peg is available at 610-655-7092 to discuss details with you - or send us a resume here. requires at least 9 months of recent verifiable experience This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. We have home daily, regional and OTR driving jobs, so you can put your CDL to work how you want to drive. FULL-TIME · $1,300 - $1,500 / WEEK · INDIANAPOLIS, INDIANA CDL A - Home Daily - No Touch Apply now", "grouping_count": 0}, {"id": 828123911614029, "advertiser_name": "Go CDL", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["828123911614029_00.jpg"], "ad_text": "Go CDL Sponsored Long term - great home daily with no touch. Can make more but no less than $1,150 for 5 days work. Our Sr. Recruiter Peg is available at 610-655-7092 to discuss details with you - or send us a resume here. Requires 9 months experience. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. We have home daily, regional and OTR driving jobs, so you can put your CDL to work how you want to drive. FULL-TIME · $1,150 - $1,300 / WEEK · TEMPLE, TEXAS CDL A - Home Daily - No Touch Freight Apply now", "grouping_count": 0}, {"id": 572096548093451, "advertiser_name": "Go CDL", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["572096548093451_00.jpg"], "ad_text": "Go CDL Sponsored Schedule: Monday – Friday with Occasional Saturdays Deliver SOLO to MI, OH, IN, and Ontario, Canada Route: Home Daily Tractor Type: Day Cab 53' Box Trailer Freight: No Touch Evening start times Brownstown Terminal This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. We have home daily, regional and OTR driving jobs, so you can put your CDL to work how you want to drive. FULL-TIME · $1,300 - $1,500 / HOUR · FLAT ROCK, MICHIGAN $1300 Weekly - Home Daily - No Touch Apply now", "grouping_count": 0}, {"id": 5941816622562159, "advertiser_name": "Go CDL", "status": "Active", "date": "01/19/2023", "ad_url": [], "image_save_path": ["5941816622562159_00.jpg"], "ad_text": "Go CDL Sponsored CDL A - Home Daily night shift from 6 PM to 6 AM. 5 day on 5 days off Requires 1 yr experience Forklift some pallets Our Sr. Recruiter Peg is available at 610-655-7092 to discuss with you - or send us a resume here. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. We have home daily, regional and OTR driving jobs, so you can put your CDL to work how you want to drive. FULL-TIME · $25.50 / HOUR · MEMPHIS, TENNESSEE Shuttle - $25.50 per hr - Nights Apply now", "grouping_count": 0}, {"id": 5761428037306245, "advertiser_name": "Go CDL", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["5761428037306245_00.jpg"], "ad_text": "Go CDL Sponsored CDL A - Home Daily No Touch Requires 9 months experience. Can make $1,400 some weeks. No less than $1,250. Our recruiter Anthony is available at 717-562-9574 to discuss details with you - or send us a resume here. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. We have home daily, regional and OTR driving jobs, so you can put your CDL to work how you want to drive. FULL-TIME · $1,250 - $1,400 / WEEK · HUMBOLDT, TENNESSEE CDL A - Home Daily - No Touch Freight Apply now", "grouping_count": 0}, {"id": 1052963232364678, "advertiser_name": "Go CDL", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["1052963232364678_00.jpg"], "ad_text": "Go CDL Sponsored CDL A - Home Daily No Touch Requires 9 months experience. Can make $1,600 some weeks. No less than $1,200. Our Sr. Recruiter Peg is available at 610-655-7092 to discuss details with you - or send us a resume here. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. We have home daily, regional and OTR driving jobs, so you can put your CDL to work how you want to drive. FULL-TIME · $1,100 - $1,600 / WEEK · DESOTO, TEXAS CDL A - Home Daily - No Touch Freight Apply now", "grouping_count": 0}, {"id": 500825638701469, "advertiser_name": "Go CDL", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["500825638701469_00.jpg"], "ad_text": "Go CDL Sponsored We need drivers with a CDL A license and at least 9 months recent experience. This is home daily no touch work. Our Sr. Recruiter Peg is available at 610-655-7092 to discuss with you - or send us a resume here. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations CDL Labor Logistics has better driving jobs for better CDL drivers. We offer our CDL drivers benefits, and have truck driving jobs with good pay and long term stability. To learn more about this CDL driver job or our other CDL jobs, apply now with the information we need to contact you, as well as your preference for what CDL driving jobs you prefer. FULL-TIME · $1,200 - $1,400 / WEEK · SAN ANTONIO, TEXAS CDL A No Touch Home Daily Autoparts Shuttle Apply now", "grouping_count": 0}, {"id": 1871740533184337, "advertiser_name": "Go CDL", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["1871740533184337_00.jpg"], "ad_text": "Go CDL Sponsored Home Daily Evening starts $1300 Weekly Pay is based on work or availability - so if we don't have freight you still get paid! 9 months recent exp. required. Apply for more details. This job includes: Great Equipment Steady Hours Health Insurance 401(k) Paid time off / Vacations FULL-TIME · $1,300 - $1,400 / WEEK · OWENSBORO, KENTUCKY CDL A - Home Daily - $1300 weekly Apply now", "grouping_count": 0}]