[{"id": 553428743498195, "advertiser_name": "Gaeta Green Environmental Services", "status": "Active", "date": "01/16/2023", "ad_url": [], "image_save_path": ["553428743498195_00.jpg"], "ad_text": "Gaeta Green Environmental Services Sponsored Gaeta Interior Demolition Inc. is Staten Island’s leading waste collection company. We are looking for a Lead Sales Representative to execute our sales strategy and help grow our business to new heights. As our Lead Sales Representative you will need to be capable of working independently to market services to commercial businesses. To be successful in this position you need to be highly motivated, extremely confident, a self-starter with a positive attitude, and possess strong communication and time management skills. You will plan and execute on-site events, engage consumers and increase property penetration rate by driving sales of products and services. The Sales Representative meets regularly with prospective new clients in his or her assigned market area to deliver sales presentations, follow up with key decision-makers and sell all services, as appropriate. Responsibilities also include account retention for the achievement of customer satisfaction and long-term customer relationship and community involvement networking. We are looking for Lead Sales Rep. that is competitive by nature and innovative by design. Responsibilities • Developing and maintaining positive relationships with property managers, business owners, and key decision makers • Achieving weekly and monthly sales goals. • Scheduling events and negotiating additional marketing tactics. • Promote events and offers • Establish clear communication between clients and our operations team. Expectations • Meet and exceed sales goals. • Meet weekly event scheduling needs and expectations. • Communicate and work with management to drive sales growth. • Build and maintain relationships with property managers, business owners, event contacts, team members and internal staff. Qualifications • Prior outside sales experience with commercial & retail businesses • Possess a strong work ethic, requires little supervision • Solid organization, communication and interpersonal skills are imperative • Reliable form of transportation Gaeta Interior Demolition Inc. is the top provider of Waste Collection Services on Staten Island with a full-service transfer station. At Gaeta, we provide our client’s with that personal touch, so they are confident we are looking out for their best interests in this ever-changing industry. Base pay plus commission. Job Type: Full-time Salary: $45,000.00 per year Benefits: • 401(k) matching • Paid time off Schedule: • Monday to Friday • Weekend availability Supplemental pay types: • Bonus pay • Commission pay Experience: • Outside Sales: 4 years (Preferred) License/Certification: • Driver's License (Preferred) Willingness to travel: • 75% (Preferred) Work Location: On the road FULL-TIME · $45,000 / YEAR · NEW YORK, NEW YORK Outside Sales Agent Apply now", "grouping_count": 0}, {"id": 961917764784696, "advertiser_name": "Gaeta Green Environmental Services", "status": "Active", "date": "01/06/2023", "ad_url": [], "image_save_path": ["961917764784696_00.jpg"], "ad_text": "Gaeta Green Environmental Services Sponsored Come join a winning team, with over 25 years of experience in the industry we understand how important it is to take care of our clients and our employees. You want to work for a mid-sized company where you know you feel like you are part of a team, part of a family then come check us out. We take care of our equipment so you can do your job the best way possible. We are looking for experienced Rear Load Garbage Truck Drivers with a CDL Class B License to join our team. Ideal candidates will be familiar with using route-ware to navigate to the various stops and acknowledge each pickup. Responsibilities: Complete the trash collection of provided route. • Work with assigned helper to ensure safety protocols are followed at all times • Availability to work evenings and weekends. • Perform daily inspections of all equipment and report any necessary repairs to management. • Open and transparent communication with management. Qualifications & skills: • Must have CDL-B License and Medical Certification • Previous experience operating a Garbage truck is required • Clean driving history Compensation: We offer competitive wages, plus all full time employees are eligible for medical, dental and vision coverage, 401k with matching, Life Insurance. We offer continued training and advancement opportunities for those looking to grow. Gaeta Interior Demolition is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, age, or any other characteristic protected by applicable law. The statements used herein are intended to describe the general nature and level of the work being performed by an employee in this position, and are not intended to be construed as an exhaustive list of responsibilities, duties and skills required by an incumbent so classified. Furthermore, they do not establish a contract for employment and are subject to change at the discretion of the Company Benefits: • 401(k) • Dental insurance • Health insurance Schedule: • 8 hour shift Ability to commute/relocate: • Staten Island, NY 10310: Reliably commute or planning to relocate before starting work (Required) Experience: • Commercial driving: 1 year (Preferred) License/Certification: • CDL B (Required) Work Location: One location FULL-TIME · $29 - $32 / HOUR · NEW YORK, NEW YORK Garbage Truck Driver- CDL Class B Apply now", "grouping_count": 0}]