[{"id": 712812490198891, "advertiser_name": "Nurse Advantage", "status": "Active", "date": "01/19/2023", "ad_url": ["https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.careadvantageinc.com%2Fsupplemental-staffing-richmond-virginia&h=AT0iNlVFWNVtgTACrG6hTPU9E1lLc31IUx41a3ZhVKHQROT2prUe1DK82ZdUWSzbE5Lpo9xw_-Q9gMbDzYba59DdRdWcwqF1dKeTCIxtthUVI3ObcipWkATJ_cwVUN0rcCQ9M7pOvbrA6p19MBcg6J75Wos4MC-1W3aQ-CkOOqc", "https://l.facebook.com/l.php?u=https%3A%2F%2Fnurseadvantage.applicantpro.com%2Fjobs%2F&h=AT0iNlVFWNVtgTACrG6hTPU9E1lLc31IUx41a3ZhVKHQROT2prUe1DK82ZdUWSzbE5Lpo9xw_-Q9gMbDzYba59DdRdWcwqF1dKeTCIxtthUVI3ObcipWkATJ_cwVUN0rcCQ9M7pOvbrA6p19MBcg6J75Wos4MC-1W3aQ-CkOOqc", "https://l.facebook.com/l.php?u=https%3A%2F%2Fnurseadvantage.applicantpro.com%2Fjobs%2F&h=AT0iNlVFWNVtgTACrG6hTPU9E1lLc31IUx41a3ZhVKHQROT2prUe1DK82ZdUWSzbE5Lpo9xw_-Q9gMbDzYba59DdRdWcwqF1dKeTCIxtthUVI3ObcipWkATJ_cwVUN0rcCQ9M7pOvbrA6p19MBcg6J75Wos4MC-1W3aQ-CkOOqc", "#"], "image_save_path": ["712812490198891_00.jpg", "712812490198891_01.jpg", "712812490198891_02.jpg"], "ad_text": "Nurse Advantage Sponsored Nurse Advantage (a Care Advantage Inc. company), the region's most experienced healthcare supplemental staffing firm is looking to hire a FLEXIBLE part-time or full-time Personal Care Assistant (PCA), Skilled Nurses, and Medical Technicians to provide healthcare services to our clients throughout the greater Richmond area. We work with clients that have positions in assisted living, senior living, hospitals, jails, schools, and medical centers. We are a people-minded organization that offers flexible schedules, W2 Employment, aggressive pay rates, and benefits; while advancing our employee's careers. If you are looking for a flexible work schedule where you work on your day and your time, while being able to represent Nurse Advantage values....then we want to talk with you! Our positions have great benefits including overtime opportunities, referral and incentive bonuses, and employee recognition programs. CAREADVANTAGEINC.COM Stop Looking Anywhere Else! You just found the perfect opportunity. Nurse Advantage offers flexible schedules, overtime opportunities, referral and incentive bonuses. Apply Now You just found the perfect opportunity. Nurse Advantage offers flexible schedules, overtime opportunities, referral and incentive bonuses. NURSEADVANTAGE.APPLICANTPRO.COM Are YOU a STAR performer?! From Personal Care Assistants to Skilled Nurses, we are always here to help manage peak workloads for our clients. Apply Now From Personal Care Assistants to Skilled Nurses, we are always here to help manage peak workloads for our clients. NURSEADVANTAGE.APPLICANTPRO.COM Make your own schedule. Nurse Advantage offers a flexible schedule with the ability to choose where you work. Apply Now Nurse Advantage offers a flexible schedule with the ability to choose where you work.", "grouping_count": 0}]