[{"id": 881761766585588, "advertiser_name": "Fonson Company, Inc.", "status": "Active", "date": "01/04/2023", "ad_url": [], "image_save_path": ["881761766585588_00.jpg"], "ad_text": "Fonson Company, Inc. Sponsored Fonson would like to add skilled pipelayers to our team for the 2022 season!! We are a heavy civil/road construction and underground contractor, our jobsites are generally within an hour's travel of Brighton. Fonson offers competitive pay, health/vision/dental/life insurance, and a 401k. We have a lot of work on the books for 2022 (and we are still bidding more) and anticipate having all crews back to work by March 15th weather permitting. This position is responsible for assembling, connecting, and constructing pipe systems for storm or sanitary sewers, drains, and water mains. Responsibilities (include, but not limited to the following): • Hand dig to expose existing pipe or utilities (gas, water, sewer, electric, etc.) in trench area • Guide excavator operator in trench excavation • Hand shape trench bottom to accommodate pipe installation • Hand shape pipe bedding for proper elevation and alignment • Inspect pipe to insure proper jointing can be achieved • Install pipes for sanitary and storm sewer, water mains and other related piping at the correct elevation and alignment and leak free • Verify installation using lasers and/or levels and grade rods • Make pipe connections to manholes, chambers, etc. • Connect active or inactive water and sewer lines, install fittings, etc. • Drill holes into pipes or structures for additional lines • Install or repair sanitary or storm sewer structures or pipe systems • Compact fill below, around and above pipe installations • Knowledge of confined spaces entry/exit requirements • Must adhere to safety procedures • Must be able to work independently and as a member of a team • Perform related duties and responsibilities as required Working Conditions/Physical Demands: • This position will include mostly outdoor work environments and work in all weather conditions. • Must have TDap and Hepatitis B & A vaccinations up to date prior to start of employment • Kneeling, crouching, bending, stooping, lifting and reaching in a ditch while installing/connecting water or sewer pipe • Climb up and down a ladder or other means of egress from the trench, walk on uneven ground • Push and pull pipes together with pipe bar, 120 lbs force may be required • Must be able to use power and manual hand tools such as vibratory compactors, air hammers, shovels, etc. Additional Requirements: • Must have reliable transportation • Ability to pass drug screening/physical • Possession of Commercial Driver’s License (CDL) is a plus We are an Equal Opportunity Employer and provide a Drug Free Work Place FULL-TIME · GREEN OAK, MICHIGAN Pipelayer Apply now", "grouping_count": 0}, {"id": 728063915408746, "advertiser_name": "Fonson Company, Inc.", "status": "Active", "date": "01/11/2023", "ad_url": [], "image_save_path": ["728063915408746_00.jpg"], "ad_text": "Fonson Company, Inc. Sponsored Fonson would like to add a Foreman to our team for the 2022 season!! We are a heavy civil/road construction and underground contractor, our jobsites are generally within an hour's travel of Brighton. Fonson offers competitive pay, health/vision/dental/life insurance, and a 401k. We have a lot of work on the books for 2022 (and we are still bidding more) and anticipate having all crews back to work by March 15th weather permitting. The Foreman will organize and lead a crew to safely and efficiently perform mass earthwork balancing and road construction/reconstruction. The Foreman works under the general direction of the Superintendent. Position requirements include but are not limited to the following: • Plan, organize and lead grading or underground crew • Keep accurate records of labor and equipment time • Schedule aggregate material quantities and deliveries • Determine trucking needs and schedule trucks via the Trucking Manager • Understand project work scope and keep accurate records of work tasks and quantities of work completed • Notify Superintendent of all customer requests or field condition changes prior to performing changed work • Prepare and submit detailed, accurate daily reports • Communicate with owners, inspectors, testing personnel, subcontractors and other project stake holders • Reinforce company EEO, Non-Discrimination and Harassment policies Skills and Qualifications • Must be proficient in math, written and verbal communication • Must have expert knowledge of means and methods of earthworks and road construction • Must have effective team building and communication skills • Must possess expertise in MIOSHA and traffic safety standards • Must have, or obtain within 60 days of appointment, and maintain a Commercial Driver’s License (CDL Class A) • Must have, or obtain within 60 days of appointment, a certificate of completion of MIOSHA 30-hour training Physical Requirements • Work outside in all weather conditions • Standing, crouching, bending, stooping, lifting, reaching, walking on uneven ground and climbing • Must be able to use power and manual hand tools such as vibratory compactors, air hammers, shovels, etc. Additional Requirements: • Ability to pass drug screening/physical Benefits • Salary commensurate with experience • Heath care • Life insurance • 401k with Employer contribution • Defined/Objective bonus program • Company furnished vehicle We are an Equal Opportunity Employer and provide a Drug Free Work Place FULL-TIME · GREEN OAK, MICHIGAN Foreman Apply now", "grouping_count": 0}, {"id": 1205035437062104, "advertiser_name": "Fonson Company, Inc.", "status": "Active", "date": "01/05/2023", "ad_url": [], "image_save_path": ["1205035437062104_00.jpg"], "ad_text": "Fonson Company, Inc. Sponsored We are currently looking for Class A CDL drivers with gravel train experience. Ideal candidates will also have experience operating equipment and hauling equipment/other construction materials. This is generally seasonal work; typically March through Christmas. However, if we have appropriate weather conditions and workload, we will run year-round. We have good equipment - trucks are 2015 or newer and well maintained! Benefits: weekly pay based on experience, 401k match, full healthcare after 30 days: we pay 75%, flexible leave time. FULL-TIME · GREEN OAK, MICHIGAN Gravel Train Driver Apply now", "grouping_count": 0}, {"id": 5573188462792772, "advertiser_name": "Fonson Company, Inc.", "status": "Active", "date": "01/04/2023", "ad_url": [], "image_save_path": ["5573188462792772_00.jpg"], "ad_text": "Fonson Company, Inc. Sponsored The Heavy Equipment Operator is responsible for operating heavy equipment in an efficient and effective manner. Must know and practice safe equipment operation in order to minimize the risk of injury, property damage or loss of life. Heavy equipment may include trucks, front-end loaders, dozers, graders, compactors, excavators, and other related pieces of equipment. Responsibilities (including, but not limited to): • Must clean, maintain and secure all equipment as directed by legislation, policies and procedures • May build, level and excavate land surfaces using all types of construction equipment • Excavate, move, stockpile and load dirt and waste products from job sites onto trucks • Excavate, stockpile or place aggregate products • Will be lifting, pulling, pushing and managing heavy loads • Work in all weather conditions • Must be able to work as a member of a team as well as independently and is expected to maintain the schedule of work • Must have knowledge of truck and equipment safety, workplace safety requirements and procedures. • Perform preventive maintenance on equipment as required including fluid and filter changes and parts lubrication • Perform related duties and responsibilities as required Must demonstrate the following skills: • Comprehensive knowledge of equipment operation and capabilities, analytical and problem solving, decision making, and effective verbal, listening and communications. • Must also possess client service and public interaction skills and team mentality • Understanding of measurements, distance and volume Physical Requirements: • Must be able to climb, twist and lift 50 pound loads without the use of equipment. • Must be able to perform physical labor in all weather conditions. • Must be able to sit or stand for extended periods of time. Additional Requirements: • Must have reliable transportation • Ability to pass drug screening/physical • Possession of Commercial Driver’s License (CDL) is a plus We are an Equal Opportunity Employer and provide a Drug Free Work Place FULL-TIME · GREEN OAK, MICHIGAN Heavy Equipment Operator Apply now", "grouping_count": 0}]